
var all_country 	= ["Австралия","Австрия","Белгия","България","Хърватия","Република Чехия","Дания","Финландия","Франция","Германия",
						"Гърция","Унгария","Италия","Люксембург","Холандия","Норвегия","Полша","Португалия","Румъния","Русия",
						"Сърбия","Словения","Испания","Швеция","Швейцария","Обединено кралство","Нова Зеландия"," "/*Arab*/,"Естония"," "/*Hebrew*/,
						"Латвия","Словакия","Турция","Ирландия","*","Филипини","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"Китай","*","*","*","*","*","*","Други","Литва"/*新添加的，底层结构体中没有*/,"Украйна"/*新添加的，底层结构体中没有*/,
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Литва"];						
				
var all_language 	= ["Чешки","*","Датски","*","*","Немски","Английски","Френски","Гръцки","Испански",
						"Хърватски","*","Италиански","Унгарски","Нидерландски","Норвежки","Полски","Португалски","Руски","Румънски",
						"Словенски","Сръбски","Финландски","Шведски","Български","Словашки","*","*","Ирландски","*",
						"Уелски","Арабски","Irlandés","Латвийски","*","Турски","Естонски","Нидерландски"/*Netherlands*/,"*","*",
						"*","*","*","*","*","*","Волапюк"/*Qaa*/,"Неопределен"/*Undetermined*/,"*","Неидентифициран",
						"Неопределен","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Баски","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Bjeloruski","*","*","Каталонски","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Галицийски","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Исландски","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Литовски",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Романтика","*","*","*","*",
						"*","*","*","Сами","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Телетекст",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Украински","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*"];
var offOn			= ["Изкл.","Вкл."];
var okCancel		= ["ОК","Отказ"];
var yesNo			= ["ДА","НЕ"];
var level			= ["Изкл.","Нисък","Високо","Среден"];
var manualAuto		= ["Ръчно","Автоматично"];
var homeShop		= ["У дома","В магазин"];
var picPreset		= ["Cтандарт","Динамичният","Естествен","Кино","Цифрово кино","Лични данни"];
var picColorTemp	= ["Студен","Нормален","Топъл","Топъл2","Потребител"];
var pic3dNavig		= ["Ръчно","Автоматично","Полуавт."];
var _3dOptions		= ["3D режим","3D-към-2D","L-R бутон","Дълбочина на рязкост"];
var pic3DMode       = ["Изкл.","2D-към-3D","Един до друг","Горе и долу","Паралелна работа"];
var picEcoOptions	= ["Енергоспестяване","Светлинен сензор","Затъмнение на място","Смесено затъмняване"];
var picGeoOptions	= ["Геометрия","Хориз. позиц.","Вертикална позиция","Честота","Фаза"];//Geometry 无翻译
var picAdWhiteBal	= ["Рег. червено","Рег. зелено","Рег. синьо","Увел. червено","Увел. зелено ","Увел. синьо  "];
var souOptions		= ["Предварително зададен звук","Баланс","Закъснение на звука","SRS TSHD","Авт. сила на зв.",
						"SPDIF тип","Закъснение на SPDIF","Разполагане на телевизора","Език на звука","Звуков канал",
						"Звуково описание","Тип на извежданото цифрово аудио","Професионална настройка за Dolby"];
var soundOutputoptions =["DAP изход за телевизионен говорител","Външен AVR кодиран изход"];		
var inteligenteqoptions =["Фокусиран","Богат"];						
var souSpdifType	= ["Автоматично"/*Dolby*/,"PCM","Изкл."];
var colorSpace      = ["Автоматично","Местен","Потребител","DCIP3"];
var souPresetPara	= ["100Hz","300Hz","1KHz","3KHz","10KHz","Заобикалящ виртуализатор","Диалогов подобрител","Подобрител на ниските честоти","Интелигентна сила на звука","Медиен анализатор","Графичен еквалайзер","Интелигентен EQ"];
var chOptions		= ["Сканиране на канали","Списък на каналите","EPG","Органайзер","Диагностика на каналите",
						"времеотместване","Субтитри","Телетекст","Тип на списъка с канали"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Сила на сигнала","Качество на сигнала","Честота (KHz)","Ид. номер обслужване","Ид.код на мрежа","Име на мрежата"];
var chScanOptions	= ["Държава","Режим на тунер","Автоматично търсене","Автоматично актуализиране","Ръчно скан. аналог. ",
						["Ръчно сканиране на мрежа","Ръчно сканиране с антена","Ръчна настройка на сателит"],"Настройване на сателитна антена","Избор на предпочитана мрежа","Изтриване на списъка с каналите",];
var favNetDes		= "Моля изберете своята любима мрежа.";
var tuner			= ["Кабел","Aнтена","Сателит"];//Satelite 无翻译
var passError		= "Грешна парола.\nОпитайте отново!";
var chType			= ["Аналогови канали: ","Цифрови канали: "];
var chScanStatus	= ["Състояние: Сканиране","Състояние: Сканирането приключи","Състояние: Отмяна на сканирането","Състояние: Грешка при сканиране"];
var chScanPara		= ["Честота (KHz)","Модулация","Скорост:символи (Ksym/s)","Ид.код на мрежа","Система",
						"Фина настройка","Сила на сигнала","Качество на сигнала","Режим на сканиране","Идентификационен номер на каналите"];
var chScanParaMHZ      = ["Честота (MHz)"];
var chAtvManSys		= ["ЗАПАДНА ЕВРОПА","ИЗТОЧНА ЕВРОПА","Обединеното кралство","Франция"];
var modulation		= ["16QAM","32QAM","64QAM","128QAM","256QAM","Автоматично"];
var chCleanDes		= "Желаете ли да изчистите списъка с канали?";
var chDeletDes		= "Желаете ли да изтриете канала?";
var chOperator		= ["Ziggo","UPC","Други"];
var chScanType		= ["Цифрови & Аналогов","Цифрови","Аналогови"];
var chScanMode		= ["Пълно","Напред","Бърз"];
var bookingModes	= ["Запис","Напомняне"];
var dayName			= ["Нд","Пн","Вт","Ср","Чт","Пт","Сб"];
var monthName		= ["ян.", "февр.","март","апр.","май","юни","юли","авг.","септ.","окт.","ноем.","дек."];
var filter			= ["Филтър","Тип","Подвид"];
var chEpgFirstGenre	= ["Кино","Новини","Шоу","Спорт","За децата","Музика","Изкуство","Социални","Образование","Отдих","СПЕЦИАЛНИ"];
var chEpgSecondGenre= [["Драма","Криминални","Приключенски","Научна фантастика","Комедия","Сапунен сериал","Романтика","Сериозни","Филм за възрастни"," "," "," "],
						["Новини","Прогноза за времето","Новинарско предаване","Документален филм","Дискусия"," "," "," "," "," "," "," "],
						["Шоу","Игра","Естрадна програма","Беседа с гост"," "," "," "," "," "," "," "," "],
						["Спорт","Специални събития","Спортни предавания","Футбол","Тенис",
							"Отборни спортове","Атлетика","Моторни спортове","Водни спортове","Зимни спортове",
							"Конни спортове","Бойни изкуства"],
						["За децата","За деца в предучилищна възраст","Забавна програма за деца от 6 до 14","Забавна програма за деца от 10 до 16","Информационна програма","Анимация"," "," "," "," "," "," "," "],
						["Музика","Рок","Сериозни","Фолк","Джаз","Мюзикъл","Балет"," "," "," "," "," "],
						["Изкуство","Сценични изкуства","Изящни изкуства","Религия","Популярна култура",
							"Литература","Филм","Експериментални","Радиопредаване","Нови медии",
							"Предавания за изкуство","Мода"],
						["Социални","Магазинни предавания ","Икономика","Забележителни личности"," "," "," "," "," "," "," "," "],
						["Образование","Природа","Технология","Медицина","Чужди страни","Социални науки","Допълнително образование","Езици"," "," "," "," "],
						["Свободно време и хоби","Туризъм","Занаяти","Автомобилизъм","Фитнес и здраве","Готварство","Реклами","Градинарство"," "," "," "," "],
						["Оригинален език","Чернобял","Непубликувани","Излъчване на живо"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Преск. канал","Сортиране канали","Редактиране канали","Закъснение канал","канал суап","канал вложка"];
var chEditPara 		= ["Име на мрежата","Номер на канала","Име на канала","Честота","Система за цветовете","Звукова система"];
var chSatTitles		= ["Тип на сателита","Настройване на сателитна антена","Избор на сателит"];
var chSatEidtOptions= ["Име на сателит","Позиция","LNB мощност","LNB честота (MHz)","Вход от DISEQC",
						"Тон 22KHz","пакетен тон","Честота (KHz)","Скорост:символи (Ksym/s)","Поляризация",
						"Сила на сигнала","Качество на сигнала","Състояние на сателита"];
var chSatAutoPromt	= [["Всички","Мрежа"],
						["Всички","Безплатен"]];
var chSatAutoScanOptions=["Избор на сателит","Режим на сканиране","Канали"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Универсален",];
var chSatDiSEqCInput= ["Деактивиране","A","B","C","D"];
var chSatTone22KHz	= ["Автоматично","Вкл.","Изкл."];
var chSatToneBurst	= ["Деактивиране","пакетен тон A","пакетен тон B"];
var chSatPolarization= ["Хоризонтала","Вертикала"];
var chSatSetupOptions=["Тип на антената","Тунер","Честота на лентата"];
var chSatAntennaType= ["Сигнален кабел","Универсален"];
var chSatUserBands	= ["Потр. лента 1","Потр. лента 2","Потр. лента 3","Потр. лента 4","Потр. лента 5","Потр. лента 6 ","Потр. лента 7","Потр. Лента 8"];
var chSatOthers		= ["Транспондер"];
var chSatSetupOthers= ["Дефиниран от потребителя"];
var pleaseSelectSat = "Моля първо изберете сателити.";
var subOptions		= ["Субтитри","Език на субтитрите","Език на субтитрите 2-ри","Вид субтитри"];
var ttxOptionsCon      = ["Декод. ез. на стр.","Език на телетекста"];
var subType			= ["Нормален","Хора с увр. слух"];
var netIntf     	= ["Ethernet","Безжични"];
var netConnDes		= ["ТВ тества мрежовата връзка.\nМоля, изчакайте",
						"Успешен тест на мрежова връзка",
						"Неуспешен тест на мрежовата връзка!"];
var netSsidError	= "Валидната дължина на SSID e от 1 до 32 символа. Моля проверете SSID.";
var netOthers		= ["PIN код "];
var netWlessAutoDes	= ["Преди да натиснете ОК се уверете, че следният PIN код е въведен в точката за достъп.",
						"Натиснете бутона на точката за достъп в рамките на 120 секунди преди да натиснете ОК."];
var netConnRemind	= ["Грешна парола!",
						"Свързване. Моля изчакайте.",
						"Успешно свързване и получаване на IP!",
						"Отказ на връзката",
						"ТВ сканира АР\nМоля, изчакайте",
						"Към TV няма свързано безжично устройство"];
var netWireIpOptions= ["Настройка на IP","Тип на адреса","IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS","Вторичен DNS"];
var netWireConnRemind= ["Въведете стойност между 0 и 255.",
						"Свързването премина успешно.",
						"Моля въведете валиден адрес.",
						"Свързването премина успешно.",
						"Неуспешно свързване!",
						"Свързване. Моля изчакайте.",
						"Моля въведете стойност между 1 и 223."];
var netFlixOptions	= ["Деактивиране","ESN"];
var netFlixDes	 	= ["Сигурни ли сте, че желаете да деактивирате?"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Актуализиране софтуер";
var netUpdateDialogTitle = "Актуализация на софтуера";
var netBGDownloadTitle 	= "Изтегляне";
var netUpdateLoadingPrompt= ["Търсене на надстройка, моля изчакайте.",
							"Софтуерът се изтегля... Моля изчакайте.",
							"Моля НЕ изключвайте ТВ по време на надграждане на софтуера!",
                            "Задължителната актуализация на софтуера е изтеглена автоматично във фонов режим."];
var netUpdatePrompt= ["Поздравления! Разполагате с най-новата софтуерна версия!",
						"Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Неуспешно влизане!",
						"Данните не могат да бъдат получени. Моля опитайте по-късно.",
						"Отказ на актуализиране на обработващ XML!",
						"Отказ на връзката",
						"Успешно изтегляне на софтуера. Искате ли да започнете зареждане?",
						"Загуба на данни. Невъзможно изтегляне!",
						"Отказ за проверка на пакета, опитайте отново!",
						"Мрежата не работи правилно. Моля, проверете и се свържете отново…",
						"Отказ при актуализиране. Моля, рестартирайте ТВ!",
						"Неочаквано изтриване на файла за надграждане. Направете отново актуализиране от мрежата.",
						"Успешно изтегляне на софтуера във фонов режим.Желаете ли да надградите?"];
var netUpdateButtonText = ["Изтегляне", "Актуализиране", "По-късно", "Никога", "ОК","Продължение"];
var autoDetectPrompt = ["Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Намерен е нов софтуер с версия XXXX. Желаете ли да се актуализирате сега?",
						"Процесът на актуализиране от мрежата е прекъснат последния път. Трябда ва актуализирате отново.",
                        "Изтеглянето на новата версия ХХХХ на софтуера не е завършено. Желаете ли да продължите сега?",
                        "Софтуерът беше изтеглен, желаете ли да изпълните актуализация сега?"];
var sysOptions		= ["Е-наръчник","Език екр. меню","Настройка на часа","Заключен","Входни настройки",
						"Актуализиране софтуер","Местоположение","Режим HbbTV","Бисквитки","Общ интерфейс",
						"Разширени настройки","Възстановяване фабрични настройки","Светлинен индикатор"];
var sysResetDes		= "Сигурни ли сте?";
var sysMenuLangOptions=["Език","Предпочитан език на звука","Предпочитан  2-ри език "];
var sysTimerOptions	= ["Часова зона","Име на регион","Честота","Таймер за заспиване","Автоготовност", "Country region"];

var sysTimeZone		= ["Радиопредавател","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00",
						"GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00",
						"GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Изкл.","10 мин.","20 мин.","30 мин.","40 мин.","50 мин.","60 мин.","90 мин.","120 мин."];
var sysStandby		= ["Изкл.","4 часа","6 часа","8 часа"];
var sysRegionName	= ["Мадрид","Канарски острови"];
var sysClockOptions	= ["Авто синхрон","Дата","Време","Вкл. таймер","Настройка на часа",
						"Канал при включване","Изкл. таймер ","Настройка на часа"];
var sysTimer		= ["Изкл.","Ежедневно","Еднократно"];

var sysInputSet		= ["Няма етикет","DVD","Blu-ray диск","HDD","DVDR",
						"HD запис (HD rec.)","Игра","Видео","Персонален компютър","Цифров приемник",
						"HD цифров приемник","Камера","Записващо устройство","Друго"];
var sysAvVideoInput	= ["Автоматично","RGB_CVBS","RGB","CVBS","S-Video"];
var sysUpdate		= ["Чрез USB","Ид.код на мрежа","По канали"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Не може да се намери нов софтуер в ефир!",
						"Намерен е нов софтуер с версия XXXX. Желаете ли да се актуализирате сега?",
						"Моля поставете USB устройство.",
						"Отказ за проверка на пакета, опитайте отново!",
						"НЕ изключвайте USB и телевизора по време на софтуерна актуализация!!",
						"Софтуерът беше актуализиран успешно.\nТелевизорът ще се рестартира автоматично.",
						"Намерена е нова софтуерна версия XXXX. Искате ли да изтеглите сега? Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Изтегляне",
						"Успешно изтегляне на софтуера. Искате ли да започнете зареждане?",
						"Неуспех актуал!",
						"Търсене на файлове за надграждане",
						"Успешно надграждане на софтуера.\nРестартирайте ТВ."];
var sysProductInfo	= ["Текуща версия","Име на продукт","Име на производителя","Име на шасито"];
var sysCiDes		= ["Няма CI карта."];
var sysAdOptions	= ["Регистриране на DivX(R)","Дерегистрация на DivX(R)","T-Link","Authorization Error","Потвърждение за отмяна на регистрирането",
						"Потвърждение за наемане","Изтичане срок наем","ИД на Bluetooth декларация"];
var sysRegistDes	= ["За да гледате защитено от DivX видео, е необходимо да регистрирате устройството.",
						"Регистрационен код:",
						"Регистрирайте на http://vod.divx.com"];
var sysDregistDes	= ["Код за дерегистриране:",
						"Можете да дерегистрирате на http://vod.divx.com",
						"Ще продължите ли с регистрацията?"];
var mediaAuthorization = ["Устройството няма пълномощия да възпроизведе този защитен от DivX(R) видеоклип."];
var deregistrationConfrimation = ["Устройството вече е регистрирано.","Сигурни ли сте, че желаете отмяна на регистрацията?"];
var rentalConfirmation = "Наемането на DivX(R) е използвало XXXX от YYYY прегледа. Продължение?";
var rentalExpired 	= "На DivX(R) rental са извършени ХХХХ от YYYY гледания. DivX rental е с изтекъл срок.";
						
						
var sysLockOptions	= ["Каналът е блокиран","Времеви интервал за закл.","Блокир. прогр.","Блокиран вх. сигнал","Заключване на преден панел","Инсталиране на заключване",
						"Пром. Парола","Максимална сила на звука","Изчистване на всички"];
var sysTimeIntervals= ["Тип заключване","Стартово време","Време на спиране"];
var sysRatingOptions= ["Няма","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Програма, подходяща единствено за възрастни (Испания)"];
var changePass		= ["Пром. Парола","Нова парола","Потв. Парола"];
var changePassDes	= ["Грешна парола.\nОпитайте отново!",
						"Паролата не е същата.\nМоля, опитайте отново!",
						"Успешно установяване парола!",
						"Този код е твърде елементарен, за да се зададе като парола.\nМоля, въведете отново!"];
var sysPowerOnChOptions= "Режим на избор";
var sysPowerOnCh	= ["Последно състояние","Избор от потребителя"];
var netWlessSecu    = ["Отвори","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Няма","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ","Не се поддържа"];
var netWlessSecu3	= ["Няма","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","Не се поддържа"];
var netOptions		= ["Интернет връзка","интерфейс","Безжични настройки","IP настройки","информация",
						"Тест на връзката","DLNA","TV romote","Настройки за Netflix","Телевизионна WiFi връзка",
						"Тип на адреса","IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS",
						"Вторичен DNS","SSID","BSSID","Въведете SSID:","Потребителско име"];
var chEditDes		= ["Дублиран номер на канал!","Натиснете червения бутон за изтриване на текущия знак.","Невалиден номер на канала."];
var chEpgNoProgram	= "В момента няма информация за програми, моля потърсете канали.";
var chEpgWords		= ["Напътствия за програми","Няма данни за програмата.","Каналът е заключен!","Няма подробности за програмата.","Програмата няма заглавие."];
var chEpgBooking	= ["График за информация", "Номер на канала","Начална дата","Стартово време","Време на спиране",
						"Тип на повторение","Тип на графиците","Добавяне","Заменяне","Промяна",
						"Добави/промени"];
var epgHotKey		= ["Предишния ден","Следващия ден","Филтър","Запланувани записи","Добавяне на план"];
var chEpgBookRemind	= ["Неправилно време за начало","Неправилно време за край","Дублиран график","Успешен запис","Изтриването беше успешно."];
var chSchePara		= ["Запланувани записи","Стартово време","Начална дата","Заглавие на програма","Име на канала",
						"Продължителност","Повторение","График","Редактиране","Изтриване"];
var dateTimer		= ["Еднократно","Ежедневно","Седмично"];
var scheduleDeleteReminds="Желаете ли да изтриете този график?";
var scheduleNoLists	= "Няма наличен списък с графици. Натиснете червения бутон, за да добавите такъв.";
var chListWords		= ["Списък на каналите","Списък за избор","Режим на тунер","Добави към предпочитани","Премахване",
						"Избран списък с канали","Изберете режим на настройка","Обмен"];
var chListType		= ["Всички","Цифрови","Аналогови","Радио","Безплатен","Предпочитани"];
var chAutoScanOptions=["Избор на оператор","канал тип","Автоматично търсене"];
var souSoundType	= ["Невалиден","Моно","Моно","Стерео","Стерео",
						"Моно","Стерео","Dual1","Dual2","Dual2",
						"Nicam моно","Nicam стерео","Nicam двоен1","Nicam двоен2","Nicam двучестотно",
						"Моно","LL","RR","LR"];
var souPreset		= ["Музика","Кино","Ясен глас","Cтандарт","Лични данни"];
var picAdRgbMode	= ["Изкл.","Само червено","Само зелено","Само синьо"];
var picAdOptions	= ["Намаляване на шума","MPEG NR филтър","RGB mode","Динамичният контраст","LED яснота на движението",
						"Тон на кожата","Режим на филм ","Режим на игри","Цветова температура","баланс на бялото",
						"Замръзяване","Черно Stretch","Сканиране нагоре","Гама","Режим HDMI","10 позиции баланс на бялото","Обогатяване на цветовете",
						"Намаляване на размазването","Намаляване на трептенето","Цветово пространство","Яснота на движенията"];
var pic10Pwhite     = ["Интервал","Червено","Зелено","Синьо","Възстановяване","Цвят","Жълто","Циан","Магента"];
var picMotionClarity = ["Режим Движение","Интерполация на движението","LED яснота на движението","Намаляване на размазването","Намаляване на трептенето","Възстановяване"];
var picMotionMode   = ["Автоматично","Филм","Меко","Изтриване","Спорт","Клиентски"];
var picResetDes		= "Всички персонални настройки ще бъдат върнати към фабричния им вид. Сигурни ли сте, че искате да изпълните избраното действие?";
var pic10PReset     = "Сигурни ли сте, че искате да върнете белият 10Р баланс към фабрично зададената му стойност?";
var picMotionReset  = "Желаете ли да върнете яснотата на движение към фабрично зададената й стойност?";
var picColorSpaceReset    = "Сигурни ли сте, че искате да върнете цветовото пространство към фабрично зададения му вид?";
var picOptions		= ["Предв. настройка на образа",
						"Подсвека","Яркост","Контраст","Наситеност","Цветови тон","Острота","Цветова температура","Режим на екрана:","Автоматичен формат",
						"Подобряване на картината за спорт","3D","3D навигация","ECO Настройки","Геометрия",
						"Разширени настройки","Приложи режим на картина","Възстановяване на началните настройки на картината"];
var picSize			= ["Формат 16:9", "формат 4:3", "Формат 14:9", "Bredbild",
						"16:9 zoom", "16:9 zooma upp","14:9 zoom","Utsträckt zoom","Bredzoom",
						"Zoom 2","Bredzoom 2","Автоматично нагласяне на размера на картината","Punkt för punkt","Оригинал","Панорама"];
var others			= ["Сила на звука","Излъчващ","Парола","Състояние","Запис","Заменяне","Стартиране","Изход","Търсене","Изтриване",
						"Няма","Автоматично","Сканиране","Защита","Свързване","Опресняване","Опитай пак","Cтоп","Настройки","Канали",
						"Редактиране","Постави","Cигнал!","Край","Стерео","Аудио","Източник","Няма звук","Съвети","Възстановяване",
						"Клиентски","Настройка","Запазване","Потребителски","Затваряне на клавиатурата","Режим за сигурност","Ежедневно","PVR списък"];
var direction		= ["Ляв","Десен","Нагоре","Надолу"];
var audioType 		= ["MPEG","Dolby D"/*"AC3"*/,"MPEG4","AAC", "Dolby D+"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Неидентифициран"];
var soundChannels   = ["Неидентифициран","Моно","Второстепенен","Двойно моно","Стерео","Стерео съб","Стерео Dolby съраунд","Surround 2CH","Surround звук","3.0Ch","4.0Ch","5.0Ch","Моно Lfe","Двучестотен моно Lfe","Стерео Lfe","Съраунд 2Ch Lfe","Съраунд Lfe","3.1Ch","4.1Ch","5.1CH","7.1CH","Обединено стерео","Fmrdo моно","Fmrdo стерео","Fm моно Nicam моно","Fm моно Nicam стерео","Fm моно Nicam двучестотно","Ляв","Десен","Други"];
var prompts			= ["Регулирайте настройките на картината, така че да отговаря най-добре на средата Ви на гледане.",
						"Регулиране на нивата на яркост. Колкото стойността е по-близка до 100, толкова по-ярка е картината.",
						"Регулиране на нивата на контраст. Колкото стойността е по-близка до 100, толкова по-големи са тъмно-светлите разлики.",
						"Регулиране на нивата на наситеност. Колкото стойността е по-близка до 100, толкова по-силни са цветовете.",
						"Регулиране на нивата на острота. Колкото стойността е по-близка до 100, толкова по-ясни са детайлите.",
						"Регулиране на нивата на фоново осветление. Колкото стойността е по-близка до 100, толкова по-ярък е екрана.",
						"Регулиране на нюансите. Тази настройка променя цветовите тонове.",
						"Изберете формат на картината, който отговаря най-добре на гледаната програма.",
						"Конфигурирайте настройки за енергоспестяване.",
						"Регулиране на настройките за размер на екрана при свързване с компютър.",
						"Изберете още разширени настройки за картина.",
						"Възстановяване на всички настройки на картината на стандартните.",
						"Изберете режим на звук, който подхожда най-добре на личните ви предпочитания.",
						"Регулирайте баланса на силата на звука между левия и десния канал.",
						"Системата за звуково извличане TruSurround HD Ви предлага богат, наситен и ясен звук във високите и ниските честоти.",
						"Формат за цифров интерфейс за свързване между изхода за цифров звук на телевизора и системата за домашно кино.",
						"Изберете език на аудио според предпочитанията си.",
						"Дава възможност на хората с увредено зрение да се наслаждават на телевизионни програми.",
						"Тест на картината, звука и сигнала на телевизора.",
						"Изберете тип на списъка с канали, който е най-подходящ за телевизионния сигнал.",
						"Избор на език за субтитрите на програмата, които се показват в долната част на екрана.",
						"Преглед на текста и снимките на текущия канал.",
						"Digital Living Network Alliance (DLNA). Наслаждавайте се на музика, снимки и видеоклипове от други устройства, като например компютър, чрез домашна мрежа.",
						"Показване на съдържание от смарт устройства на телевизионния екран. Използване на смартфон като дистанционно управление за телевизора.",
						"Показване на съдържание от Miracast-съвместими Android устройства на телевизионния екран.",
						"Заключете телевизора.",
						"Изберете име за устройството.",
						"Изберете зрителна среда.",
						"Възстановяване на всички системни настройки на стандартните."];
var initialTitle	= ["Добре дошли","Начални настройки"];
var initialPrompt	= ["Направете първоначалната си настройка сега, очаква Ви един Свят на вълнуващи преживявания!",
						"Моля изберете език:",
						"Изберете страна:",
						"Моля, изберете местоположението си:",
						"Изберете тип на свързване с мрежата:",
						"Изберете режим на свързване с кабелна мрежа:",
						"Свързването към xxxxxxxxx беше неуспешно! Моля свържете устройството съгласно следната диаграма или натиснете стрелка наляво за възстановяване на настройката до заводския й вид.",
						"Свързан към xxxxxxxxx! Моля изберете стрелка надясно, за да продължите.",
						"1) Вашият телевизор може да съдържа вграден безжичен адаптер\n 2)В случай че имате предоставен безжичен USB адаптер, свържете го към телевизора.  След това изберете режим за свързване към безжична мрежа:",
						"Сканиране. Моля изчакайте...",
						"Към TV няма свързано безжично устройство",
						"Моля, преди да натиснете бутона \"Напред\", се уверете, че е инсталиран следния PIN код",
						"Моля натиснете бутона на АР в рамките на 120 секунди, преди да натиснете стрелка надясно.",
						"WPS (Настройка на защитен Wi-Fi )",
						"PIN (персонален идентификационен номер)",
						"PBC (конфигурация Push Button)",
						"Следното съдържание може да бъде достъпно единствено при наличие на мрежова връзка. Желаете ли да прескочите настройката на мрежата?",
						"Има налични нови актуализации на софтуера, които можете да изтеглите. Това може да отнеме известно време в зависимост от състоянието на мрежата.",
						"Актуализирането на софтуера на телевизора позволява да се възползвате от последните функции и услуги.",
						"Няма да можете да се насладите на най-новите функции и услуги. Желаете ли да прескочите актуализация на софтуера?",
						"Натиснете Десен бутон, за да продължите.",
						"Не изключвайте захранването по време на актуализирането. Възможно е това да причини повреда в телевизора.",
						"Моля натиснете NO, в случай че не желаете да изпълните актуализация.",
						"Актуализиране, моля изчакайте.",
						"Можете да актуализирате софтуера в СИСТЕМНО МЕНЮ / АКТУАЛИЗАЦИЯ НА СОФТУЕРА.",
						"Избраната страна изисква задаване на парола.\nМоля, задайте код за ТВ и го потвърдете.",
						"This code is too simple.\nPlease use different digits.",
						"Поздравления! Първоначалната настройка беше завършена. Можете да промените конфигурацията си чрез главното меню и свързаните с него подменюта.",
						"Изберете режима на защита:",
						"Моля изберете режим за свързване към безжична мрежа:",
						"Мрежа"];
var initNetCabAndDonRe = ["Няма свързан мрежов кабел. Моля свържете такъв!","Няма вграден безжичен адаптер или безжичен USB адаптер."];
var initChPrompt = ["Инсталиране на телевизионни канали","Моля изберете антенно сканиране.","Обработка на автоматичното настройване...","Бяха открити следните антенни канали:","Изберете тип на кабелно сканиране.","Моля изберете оператор от следния списък:","Конфигурирайте информацията за сканиране","Намерени са следните кабелни канали:","Изберете един оператор от следващия списък","Изберете сателити за сканиране или редактиране на избрани сателити","Задайте параметрите на сателитите","Бяха открити следните канали. Сканирането за канали може да бъде изпълнено отново в Канал/Сканиране за канали."];
var initClockPrompt = ["Използване на дата и час, предоставени от мрежата.",
						"Моля задайте дата и час:"];
var initialOptions	= ["Среда","Мрежова настройка","Актуализиране софтуер","Инсталиране на канал","Честота"];
var initialHotkeys	= ["Назад","Избор","Следващ"];
var initLocations	= ["У дома","В магазин","Магазин с демо"];
var initNets		= ["Кабелна","Безжични","Нямам мрежова връзка"];
var initWireManuals	= ["IP адрес","Маска на подмрежата","Стандартен шлюз","Първичен DNS","Вторичен DNS"];
var initSoftUpdates = ["Актуализирай сега","Актуализирай по-късно"];
var initChannelIns	= ["Продължение","Не желая да инсталирам канали."];
var initChScanTypes	= ["Цифрови & Аналогов","Цифрови","Аналогови","Не желая да сканирам"];
var initChDvbts		= ["Аналогови антенни канали:","Цифрови антенни канали:"];
var initChDvbcs		= ["Кабелни ATV канали:","Кабелни DTV канали:"];
var initChDvbss		= ["Сателитни канали:"];
var initChDvbSOther	= ["Не желая да сканирам сателити"];
var initEndConnectedStatus= ["Връзката е прекъсната","Свързано към безжична мрежа","Свързано към кабелна мрежа"];
var initEndInstallations= "XXXX канали бяха инсталирани";
var initEndUpdate	= ["Актуализирано"];

var audioScenes 	= ["Монтаж на плот","Монтаж на стена"];			
var screenSavers	= ["В момента няма информация за програми, моля потърсете канали.",
						"Няма сигнал!",
						"Кодиран",
						"Само данни",
						"Аудио програма",
						"Няма звук и видео",
						"Няма",
						"Няма телетекст",
						"Няма данни за програмата.",
						"Програмата е заключена!",
						"Програмата е заключена!\nНатиснете OK и въведете код.",
						"Няма подробности за програмата.",
						"Програма, неподходяща за деца.\nНатиснете OK и въведете своя код.",
						"Каналът е заключен!",
						"Каналът е заключен!\nНатиснете OK и въведете код.",
						"Входът е заключен!\nНатиснете OK и въведете код.",
						"Не се поддържа!",
						"Тази услуга не е достъпна",
						"Блок въвеждане!",
						"Програмата няма заглавие.",
						"Няма функция"
						];
var chBookingPromt	= ["В графика на текущия канал има зададен запис. Телевизорът ще започне да записва.",
						"Намерен е планира запис.\n Превключете на XXXX за запис",
						"За настоящия канал има напомняне.",
						"Намерено е планирано напомняне.\n Превключете на XXXX"];
var timeUnit		= ["Сек.","мин."];
var ciPromt			= ["Данните на мрежата са променени. Изпълнете сканиране за актуализации, за да актуализирате софтуера. ",];
var othersPromt		= ["Моля, изчакайте...",];
var menuOptions		= ["Видео","Звук","Kанал","Мрежа","Система"];
var optionOptions	= ["Предв. настройка на образа","Предварително зададен звук","Замръзяване","T-Link","времеотместване","PVR","Запланувани записи","Настройки"];
var optionTLinkPromt= [["Автоматично включване","Автоготовност","Меню напътствия"],
						["Включване","Готовност","Сила на звука на усилвателя"]];
var powerPromt		= ["Телевизорът скоро ще се изключи! Натиснете произволен бутон за отказ."];
var ttxLanguage		= ["ЗАПАДНА ЕВРОПА","ИЗТОЧНА ЕВРОПА","Руски","Арабски/Иврит","Фарси","Арабски","Bjeloruski","Гръцки","Турски"];
var ttxOptions		= ["Показване","Превключване между подстраници","Език","Предупредителен текст","Кратки новини"];
var weekday         = ["неделя","понеделник","вторник","сряда","четвъртък","петък","събота"];
var lcnConfflict	= "Проблем при приемане на тази програма. Има друга версия на канал %d.";
var inShopMode		= "Вашият телевизор е в режим магазин. За да включите домашен режим, изберете системното меню и променете местоположението в него.";
var nitRefresh		= "Променени данни за мрежата. Искате ли да извършите сканиране за актуализация?";
var picHDMIMode     = ["Автоматично","Графичен","Видео"];

var glassRemind    	= ["Моля сдвоете 3D очилата си с телевизора\n(задръжте бутон POWER на 3D очилата).","3D очилата Ви са свързани към телевизора. ",""];
var pvrRemind 		= ["Не изваждайте USB устройството и не прекъсвайте захранването."];
var pvrConName   	= ["PVR","Информация за програмата:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Записаното видео е запазено в папка \"pvr\"."],"Cтоп","Запис","час","Минута","Продължителност","Съвети","Използвайте стрелките, за да зададете продължителността на записване."];
var pvrDisRemind 	= "Поставете USB памет за запис.";
var pvrRemindWords  = ["Желаете ли да излезете?",
							"Желаете ли да спрете да записвате и да видите записаните файлове?",
							"Изваден диск",
							"Няма достатъчно свободно място.",
							"Няма записани файлове. Стартиране на запис.",
							"PVR не може да стартира в кодиран канал.",
							"Функцията не се предлага",
							"Успешен запис",
							"Желаете ли да спрете записа и да смените източника на въвеждане?",
							"Телевизорът ще преустанови текущия запис. Желаете ли да излезете?",
							"За записването на PVR е необходим добър телевизионен сигнал, моля проверете сигнала си."];
var pvrChangeCh 	= ["Желаете ли да превключите канала?",
							"Желаете ли да спрете процеса на запис и да въведете ММР?"];
var pvrChangeToPIN8	= ["Желаете ли да замените източника с устройство, свързано към вход SCART?",
				    		"Желаете ли да преустановите процеса на запис и да замените източника с устройство, свързано към вход SCART?"];
var pvrChangeToCEC  = ["Желаете ли да замените източника с устройство, свързано към вход HDMI?",
				  			 "Желаете ли да преустановите процеса на запис и да замените източника с устройство, свързано към вход HDMI?"];
var pvrGuideJump    = ["Желаете ли да влезете в Електронния програмен справочник (EPG)?",
							"Желаете ли да спрете процеса на запис и да въведете ЕPG?"];
var pvrMediaJump    = ["Желаете ли да поставите носител?",
							"Желаете ли да спрете процеса на запис и да въведете Media?"];
var timeshiftExtra	= ["Да спре ли последващия запис и да се смени режима да се смени ли канала?",
						"Желаете ли да прекратите изместването на времето и да замените източника с устройство, свързано към вход SCART?",
						"Желаете ли да прекратите изместването на времето и да замените източника с устройство, свързано към вход HDMI?",
						"Отлагането не може да старитра в кодиран канал.",
						"Желаете ли да прекратите изместването на времето и да влезете в EPG?",
						"Да спре ли последващия запис и да се смени режима от TV на USB ?",
						"Да спре ли последващия запис и да се смени режима да се смени ли входящия източник?",
						"Поставете USB памет за запис.",
						"Дисковото пространство е недостатъчно.",
						"Телевизорът ще преустанови текущото изместване на времето. Желаете ли да излезете?"];
var timeshiftStatus	= ["Бързо превъртане назад","Cтоп","Начало","Пауза","Бързо превъртане напред"];
var pvrPowerOffRemind= ["Готовност за запис","Готовност","В момента телевизорът записва. Желаете ли записът да продължи и при режим на готовност?"];
var timeshiftInitTitle= "Настройка на диска";
var timeshiftInitReminds= ["Менюто се използва за настройка на USB диска за последващ запис. Моля, изберете режим на настройка.",
						 "За по-добро изпълнение препоръчваме форматиране на диска. Това ще изтрие всички данни.",
						 "Моля, изберете размера на файла за запис.",
						 "форматиране",
						 "Няма достатъчно свободно място.",
						 "Създаване на файл за последващ запис",
						 "Тест на скоростта",
						 "Дискът е твърде бавен (< %f MB/sec), за да позволи функцията последващ запис!",
						 "Дискът е готов за последващ запис. Но предлагаме да се смени с диск (със скорост > %f MB/sec) за по-добро изпълнение.",
						 "Дискът е готов за последващ запис. "];
var timeshiftInitButtons= ["Формат","Пропусни","Отказ","ОК","Край","Изход"];
var timeshiftInitOther=["Скорост:","МБ/сек"];

var selectChoice	= "Сигурни ли сте?";
var chAtvStore		= "Съхрани като ХХХХ";
var chEpgFirstGenreUK= ["Кино","Новини и факти","РАЗВЛЕЧЕНИЕ","Спорт","За децата","Образование","Стил на живот","Драма"];
var homePageTitleList = ["ПРИЛОЖЕНИЯ","TV","ВИДЕОКЛИПОВЕ","Начална страница"];
var homePageFavAndAllName  = ["Любими приложения","Всички приложения"];
var homePageBackUp = ["Е-наръчник","GuideOn"];
var homePageRemind   = ["Всички функции са достъпни единствено след свързване към мрежата.","Във Вашия телевизор все още няма запаметени канали. Програмите ще бъдат достъпни след сканиране на каналите.","Няма програма","Търсене на канали сега?"];
var homePageHistory = ["Хронология"];
var miracastTitle = ["Телевизионна WiFi връзка","TCL устройство"];
var miracastRemind=["WiFi TV позволява да споделяте екран и звук от устройства, като смартфон или таблет, безжично на телевизора (т.е. без кабели). Това дава възможност да гледате на телевизора онова, което показва смартфона или таблета. Например можете да стартирате видеоклип на смартфона и да го показвате едновременно на телевизора или да използвате таблета като гейм контролер, а съдържанието да се отразява на големия телевизионен екран.","WiFi TV връзката на телевизора е в готовност. Стартирайте, за да споделите екрана на устройството с телевизора.","Свързване. Моля изчакайте.","Неуспешно свързване!","Свързването беше неуспешно. Моля проверете."];
var homePageLittleWin = ["Настройки","Медия","Любими канали","Smart TV","EPG"];

var hbbtvStopRemind  = ["Желаете ли да прекратите възпроизвеждането?"];
var colorSystem = ["Автоматично","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "За повече информация натиснете OPTION.";
var emptyListInfo = "Към ТВ няма свързано устройство!";
var optionVideoListArray_1 = ["Предв. настройка на образа", "Предварително зададен звук", "Режим на възпроизвеждане", "Режим на екрана:", "3D режим", 
							  "L-R бутон", "Дълбочина на рязкост", "Субтитри", "Саундтрак", "Заглавие", "Глава", "Инфо"];
var optionVideoListArray_2 = ["Предв. настройка на образа", "Предварително зададен звук", "Режим на възпроизвеждане", "Режим на екрана:", 
							  "Субтитри", "Саундтрак", "Заглавие", "Глава", "Инфо"];
var bottomTipsText = ["Възпр./пауза", "Бързо превъртане назад", "Бързо превъртане напред", "Плейлиста", "Настройки"];
var picturePresetArray = ["Cтандарт", "Динамичният", "Естествен", "Кино", "Лични данни"];
var videoPlayModeArray = ["Повтори всички", "Повтори веднъж", "Нормален"];
var screenModeHDArray = ["16:9", "4:3", "Bredbild", "Bredzoom", "Zoom 2", "Bredzoom 2", "Utsträckt zoom", "Автоматично"];
var screenModeSDArray = ["16:9", "4:3", "Bredbild", "14:9 zoom", "16:9 zoom", "16:9 zooma upp", "Автоматично"];
var Mode3DArray = ["Изкл.", "2D-към-3D", "Един до друг", "Горе и долу", "Паралелна работа"];
var videoOptionListArray = ["Изкл.", "Писта", "Субтитри", "Заглавие", "Глава"];
var subMenuTitleText = "Субтитри";
var langMenuTitleText = "Език на звука";
var titleMenuTitleText = "Заглавие";
var mode3DMenuTitleText = "3D режим";
var langInfoText = "Писта";
var STOP_RESUME_INFO = "Стоп-възстан.";
var playListName = "име";
var eb_tips = "Съвети";
var ok_button = "ОК";
var eb_info = ["Грешка при аудио декодиране.", "Грешка при видео декодиране.", "Аудио форматът не се поддържа.", 
			   "Видео формат не се поддържа.", "Файлът не може да бъде отворен.", "Грешка във възпроизвеждането, моля опитайте отново.",
			   "Форматът на файла не се поддържа.", "Момент! Плеърът прекрати възпроизвеждането.",
			   "Пътят към файла не съществува или е невалиден.\n Поставете наново устройството за съхранение и опитайте още веднъж.",
			   "Да продължи ли възпроизвеждането от предишния му\n статус?"];
var frameTitleText = "Ново устройство";
var eb_quit_info = "Сигурни ли сте, че искате да излезете?";
var eb_yes = "ДА";
var eb_no = "НЕ";
var offinfo = "Изкл.";
var naInfo = "нула";
var consoleInfoArray = ["Бързо превъртане назад", "Бързо превъртане напред", "Възпр./пауза", "Плейлиста"];
var cantOperateText = ["Функцията не се поддържа."];
var chapterChangeInfo = "Достъпни са единствено сериите от 1 до ХХХХ.";
var metaDataArray = ["Метаданни на заглавие/издание: ", "Метаданни на серия: ", "Метаданни на аудио: ", "Метаданни на субтитри: "];
var metaTitleInfo = "Заглавие";
var metaChapterInfo = "Глава";
var videoLoadingInfo = "Анализиране...";
var listLoadingInfo = "Зареждане...";
var pgInfo = "Законово право: ";
var fileNameText = "име";
var fileDateText = "Дата";
var fileSizeText = "Размер";
var fileDurationText = "Продължителност";
var fileDirectorText = "Режисьор";
var fileCopyrightText = "Авторско право";
var fileArtistText = "Изпълнител";
var fileAlbumText = "Албум";
var fileGenreText = "Жанр";
var fileYearText = "Година";
var fileGenreText = "Жанр";
var mainListArray = ["Всички", "Видео", "Видео", "Музика"];
var sortArray = ["име", "Дата"];
var parserArray = ["Нормален", "Рекурсивно  "];
var emptyTipsInfo = "Момент! Не е открит поддържан файл.";
var emptyFolderInfo = "Момент! Не е открит поддържан файл.";
var sortName = "Сортиране по";
var parserName = "Парсер";
var divx_str1 = "Регистриране на DivX(R)";
var divx_str2 = "Дерегистрация на DivX(R)";
var infor_str = "Инфо";
var quickMenuEmptyText = "Няма налични опции.";

var musicSoundPresetArray = ["Cтандарт", "Кино", "Музика", "Ясен глас", "Лични данни"];
var musicInformationArray = ["име", "Изпълнител", "Албум", "Жанр:", "Година:", "Продължителност:"];
var playListName = "име";
var playTipsInfo = ["Възпроизвеждате първия файл.", "Възпроизвеждате последния файл."]
var musicNameInfo = "Name";
var musicArtistInfo = "Изпълнител";
var musicAlbumInfo = "Инфо";
var optionSoundPresetInfo = "Предварително зададен звук";
var optionBGMInfo = "Възпроизвеждане във фонов режим";
var optionAudioOnlyInfo = "Само звук";
var optionInfoText = "Инфо";

var remotePhoneConnecte = "XXXX е свързан към телевизора.";
var tvRemoteTitle		= "TV romote";
var tvRemoteDeveloper	= "Приложението е разработено от TCL";
var tvRemoteDeviceTitle	= "Наименование на устройството";
var remoteOption		= ["Медийно споделяне","Дистанционно управление","Помощ","Относно","Smart Connect"];
var remotebottom		= " Моля изтеглете \"TCL nScreen\" на смартфона си. ";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Споделяне на снимки, видеоклипове и музика с телевизора през телефона.",
							"Стъпки: \n   1. Щракнете върху \"TCL nScreen\" на телефона. Свържете телефона с телевизора посредством същата WiFi мрежа;\n   2. Щракнете върху \"Media Sharing\", за да преглеждате мултимедийни файлове;\n   3. Изпращане на сигнал от носител към телевизора с цел възпроизвеждане (с една от следните опции)",
							"       a) Плъзнете и поставете папката/файла в иконата на телевизора в горната част на екрана;\n      б) Насочете телефона към телевизора, за да стартирате първия файл;\n      в) Възпроизведете медията на телефона и щракнете върху иконата за споделяне с телевизора;",
							"   4. По време на възпроизвеждането на телевизора разклатете телефона, за да възпроизведете предишен или следващ файл."];
var controlReminds		= ["Използвайте телефона като дистанционно управление за работа с телевизора.",
							" ",
							"Стъпки: \n   1. Щракнете върху \"TCL nScreen\" на телефона. Свържете телефона с телевизора посредством същата WiFi мрежа;\n   2. Щракнете върху \"Remote Control\" за да управлявате телевизора."];
var helpDeviceWords		= "Взаимодействие с мулти-екрани";
var helpBottom			= " В ерата на технологията за интернет съхранение интелигентните устройства, като телефони и телевизори, са взаимосвързани. Споделяйте медии на много екрани със семейството и управлявайте телевизора с телефон! ";
var helpReminds			= ["Подготвителни действия\n   1. Изтеглете и инсталирайте \"TCL nScreen\" от Google Play или Apple Store.\n   2. Свържете телефона с телевизора посредством същата WiFi мрежа.",
							" ",
							"Препоръчвани телефони\n   1. CPU: kdo 800MHz\n   2. Съхранение: поне 80MB свободно дисково пространство",
							" ",
							"Отказ от отговорност\n   В случай че \"TCL nScreen\" не е достъпна за Вашия телефон, моля свържете се с производителя на телефона. "];
var helpButtons			= ["Предишен","Следващ"];
var aboutReminds		= ["TV romote","Приложението е разработено от TCL"];
var aboutExit			= "Изход";
var smartReminds		= ["Бърза и интелигентна връзка между телевизора и телефона.",
							" ",
							"Стъпки \n   1. Свържете телефона и телевизора към една и съща локална мрежа. Щракнете върху \"TCL nScreen\" на смартфона.\n   2. Щракнете върху \"Smart Connect\" за сканиране на QR кода.\n   3. Когато телевизорът е в режим на гледане на излъчвани програми, натиснете клавиш INFO върху дистанционното управление и го задръжте за 4 секунди. QR кодът ще се появи върху целия екран.",];
var smartQRReminds		= ["След това щракнете върху \"Smart Connect\" в TCL nScreen на Вашия телефон и сканирайте QR кода за незабавно свързване на телевизора с телефона.",
							"QR кодът съдържа информация за локалната мрежа. Пазете го старателно!"];
							

var consoleTipArray = ["Предишен","Следващ","Конзола","Плейлиста"];							
var optionInfoArray = ["Предв. настройка на образа","Режим на възпроизвеждане","Продължителност","Ефект","Инфо"];

var playModeArray = ["Нормален","Случаен избор","Повторение"];
var durationArray = ["Къса (5 сек)", "Средна (10 сек)", "Дълга (15 сек)"];
var effectArray = ["Няма", "Разтваряне", "Изтриване надясно", "Изтриване наляво", "Изтриване нагоре", "Изтриване надолу", "В каре", "Извън каре", "Произволен"];
var infoArray = ["Име:","Размер:","Дата:","Местоположение"];

var picturePresetBarTitleInfo = "Предв. настройка на образа";
var picturePresetBarArray = ["Cтандарт","Динамичният","Студио","Кино","Лични данни"];
var upTipsInfo = "Преместване на картината"; //add yums 2014-10-10
var consoleTipsArray = ["Конзола","Предишен","Следващ","Плейлиста","Настройки"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Натиснете отново ДЯСНА стрелка за показване на следващата снимка","Натиснете отново ЛЯВА стрелка за показване на предишната снимка","Натиснете отново стрелка НАДОЛУ за показване на плейлиста"]; //add yums 2014-10-10

var optionPvrListArray = ["Предв. настройка на образа","Предварително зададен звук", "Режим на екрана:", "3D режим", "Субтитри", "Саундтрак", "Инфо"];							
	
var titleSpanFirstArray = ["Управление и свързване","Основни правила при употреба","ПРИЛОЖЕНИЯ","TV","Настройки","Често задавани въпроси"];
var titleSpanSecondArray = [["Дистанционно управление","Бутони на панела","Лесно управление","Телевизионна връзка","Телевизионна връзка","Телевизионна връзка","Безжични"],["Стартираща програма","Лента на състоянието","Източник"],["Възпроизвеждане на приложения","Медия","TV romote"],["Настройка на канала и силата на звука","Списък на каналите","EPG","Канали","Любими канали"],["Регулиране на картината","Регулиране на звука","Регулиране на канала","Актуализиране софтуер","Език","Родителски контрол"],["Често задавани въпроси","Често задавани въпроси","Отстраняване на неизправности","Отстраняване на неизправности","Правила и условия"]];
var contentSpan1_1Array = [["СПИСЪК:","INFO:","МЕНЮ:","ЗАХРАНВАНЕ:","ИЗТОЧНИК:","СПРАВОЧНИК:","СМАРТ ТЕЛЕВИЗОР:"],["Показва списък с канали","Показва информация за програмата","Прехвърля Ви на началната страница","Включва захранването или режим на готовност","Избор на източник на входен сигнал","Показва информацията от EPG (Електронен програмен справочник)","Преминаване към страница Смарт телевизор"]];
var contentSpan1_2Array = ["Предишен канал","Следващ канал","Увеличаване на силата на звука","Намаляване на силата на звука","Прехвърля Ви на началната страница","Потвърждаване на избраната опция","Режим на готовност / Включване"];
var contentSpan1_3Array = ["OK/Справочник","Канал нагоре","Канал надолу","Намаляване на звука","Увеличаване на звука","В някои функции под формата на бутони-стрелки."];
var contentSpan1_4Array = ["Локална мрежа","HDMI ( MHL )","HDMI","HDMI ( ARC )","AV OUT адаптер","Локална мрежа","Смартфон","PC / цифрова приставка / DVD","Аудио усилвател","Аудио усилвател / монитор","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_5Array = ["USB 2.0","USB 3.0","Слушалки","AV IN адаптер","SPDIF","CMP AUDIO IN адаптер","CMP IN (YPbPr) адаптер","USB устройства","USB устройства","Слушалки","DVC / конзола за игри / цифрова приставка / DVD","Аудио усилвател","DVC / конзола за игри / цифрова приставка / DVD","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_6Array = ["Общ интерфейс","SD","VGA","SCART","Мини SCART","ANTENNA IN","PCMCIA карта","SD карта","Персонален компютър","Цифрова приставка / DVD","Антена / Кабел / Сателит","Възможно е телевизорът Ви да не съдържа всички гнезда"];
var contentSpan1_7Array = ["Таблет","Персонален компютър","Маршрутизатор","Телефон","TV"];

var contentSpan2Array = [["Натиснете стрелките, за да видите началната страница.","След това натиснете OK, за да гледате някоя от програмите или да влезете в приложението."],["Показване на дата, мрежи, устройства и т.н. в горния десен ъгъл на екрана."],["Изберете входящия сигнал от устройствата, свързани към телевизора посредством различни портове, като TV, AV, HDMI и т.н."]];

var contentSpan3Array = ["Вижте и се наслаждавайте на любимите си приложения чрез страница Смарт телевизор","Разглеждайте снимки и слушайте музика от USB устройство за съхранение.","Свържете телевизора със смартфон или таблет към една и съща локална мрежа","Щракнете върху TCL nScreen или TCL nScreen на смартфона или таблета си","Споделяйте снимки, видеоклипове и музика със семейството си върху мулти-екрани. Управлявайте своя телевизор със смартфона си."];

var contentSpan4Array = [["За превключване на каналите, натиснете стрелка НАГОРЕ / НАДОЛУ","За регулиране нивото на звука, натиснете стрелка НАЛЯВО / НАДЯСНО"],["За да разгледате каналите, натиснете LIST върху дистанционното управление","За да изберете желания канал, натиснете стрелка НАГОРЕ / НАДОЛУ"],["EPG представлява екранно ръководство, показващо програмата на цифровите телевизионни канали. Можете да управлявате, избирате, разглеждате и записвате програми."],["Търсене и инсталиране на канали"],["Добавяне или редактиране на любими канали в списъка с канали"]];

var contentSpan5Array = ["Наслаждавайте се на любимите си програми чрез видео приложения"];

var contentSpan6Array = [["Натиснете MENU за показване на опциите за настройка на системата","Влезте в настройките на картината, за да регулирате стойностите"],["Натиснете MENU за показване на опциите за настройка на системата","Влезте в настройките на звука, за да зададете опциите"],["Натиснете MENU за показване на опциите за настройка на системата","Влезте в настройките на каналите, за да зададете опциите"],["Изпълнете актуализация на своя телевизор при наличие на нова версия на софтуера"],["Можете да изберете предпочитания от Вас език за менюто"],["Позволява на родителите да блокират канали или програми, които не са подходящи за деца"]];

var contentSpan7_1Array = [["Липсват изображение и звук","Проверете предпазителя и прекъсвача.","Включете друг електрически уред в същия контакт, за да проверите дали работи, и дали е бил включен.","Съприкосновението на захранващия щепсел с електрическия контакт е лошо","Проверете източника на сигнала."],["Картината е нормална, липсва звук","Натиснете бутона за увеличаване на силата на звука.","Настройката на звука е неправилна.","Грешка при излъчването на сигнала."],["Звукът е нормален, липсва картина","Регулирайте настройките за яркост и контраст.","Грешка при излъчването на сигнала.","Проверете дали не е включен режим само аудио."]];
var contentSpan7_2Array = [["Радиосмущения","Причиняват движещи се вълни или диагонални ивици, а в някои случаи и загуба на контраст в картината. Намерете и премахнете източника на радиосмущенията."],["Липсва цвят","Регулирайте настройките на цветовете.","Проверете другите канали. Възможно е да се приема черно-бяла програма."],["Дистанционното управление не работи","Заменете батериите.","Батериите не са поставени правилно. Основното захранване на телевизора не е свързано."]];
var contentSpan7_3Array = [["Съдържанието на USB устройството не се показва","Проверете дали USB устройството за съхранение на данни е съвместимо с телевизора.","Уверете се, че форматите за аудио и видео се поддържат от телевизора."],["Възпроизвеждане без звук","Аудиоформатът на видеоклипа не се поддържа от телевизионния плеър."],["Файловете не се възпроизвеждат плавно","Ефективността на прехвърляне на USB устройството за съхранение може да ограничи скоростта на прехвърляне на данни към телевизора."]];
var contentSpan7_4Array = [["На какво трябва да се обърне внимание при актуализиране на софтуера","Захранването не бива да бъде прекъсвано по време на актуализацията на софтуера.","Избягвайте всякакви действия с дистанционно управление по време на актуализацията на софтуера.","Проявете търпение, процесът на актуализация може да отнеме известно време."],["След приключване на актуализацията на софтуера няма явни промени в интерфейса на телевизора.","При определени условия, актуализацията на софтуера може да доведе не само до обновяване или добавяне на нови функции, но също и до подобряване на работата на телевизора, без явни промени в интерфейса. Освен това, понякога интерфейсът на телевизора може да остане незасегнат."]];
var termsTitle = "Правила и условия";
var termsConditions = ["Правна декларация на TCL, производител на този телевизор. ","Поради различните възможности на продукта във връзка с услугите за Smart TV, както и ограниченията в предлаганото съдържание, някои функции, приложения и услуги е възможно да не бъдат достъпни на всички устройства и на всички места. Някои функции на Smart TV е възможно да изискват допълнителни периферни устройства или членски такси, които се предлагат отделно. Вижте нашия уебсайт за повече информация относно конкретните устройства и предлагано съдържание. Услугата и съдържанието предлагано чрез Smart TV могат да бъдат променяни без предварително предизвестие. \n   Цялото съдържание и услуги, предлагани през това устройство, принадлежат на трети страни и са защитени от авторски права, патенти, търговски марки и/или други закони за интелектуална собственост. Подобно съдържание и услуги се предлагат само за лично ползване, а не за търговски цели. Не се разрешава използване на съдържание или услуги по начин, който не е разрешен от собственика на съдържанието или доставчика на услугите. Без ограничения на казаното по-горе, освен с изричното упълномощаване от съответния собственик на съдържанието или доставчик на услугата, не се разрешава промяна, копиране, повторно публикуване, зареждане, публикуване, предаване, превод, продажба, създаване на производни работи, експлоатиране или разпространение по какъвто и да е начин на съдържание или услуги, предлагани през това устройство. \n   С НАСТОЯЩОТО ИЗРИЧНО ПРИЕМАТЕ, ЧЕ ИЗПОЛЗВАНЕТО НА УСТРОЙСТВОТО Е НА ВАШ СОБСТВЕН РИСК И ЧЕ ЦЕЛИЯТ РИСК ПО ОТНОШЕНИЕ НА УДОВЛЕТВОРЕНИЕТО ОТ КАЧЕСТВОТО, РАБОТАТА И ТОЧНОСТТА НА УСТРОЙСТВОТО Е ИЗЦЯЛО ВАШ. УСТРОЙСТВОТО, КАКТО И ЦЯЛОТО СЪДЪРЖАНИЕ И ВСИЧКИ УСЛУГИ НА ТРЕТИ СТРАНИ СЕ ПРЕДЛАГАТ \"КАКТО СА\", БЕЗ КАКВИТО И ДА Е ГАРАНЦИИ - ПРЕКИ ИЛИ КОСВЕНИ. TCL ИЗРИЧНО ОТМЕНЯ ОТГОВОРНОСТТА И ВСИЧКИ ГАРАНЦИИ И УСЛОВИЯ ПО ОТНОШЕНИЕ НА УСТРОЙСТВОТО И ВСЯКО СЪДЪРЖАНИЕ И УСЛУГИ, ПРЕКИ ИЛИ КОСВЕНИ, ВКЛЮЧИТЕЛНО, НО НЕ САМО, ГАРАНЦИИ ЗА ПРОДАВАЕМОСТ ИЛИ ЗАДОВОЛИТЕЛНО КАЧЕСТВО, ПРИГОДНОСТ ЗА ДАДЕНА ЦЕЛ ИЛИ ТОЧНОСТ, ИЛИ ЗА СВОБОДНО И БЕЗПРЕПЯТСТВЕНО ПОЛЗВАНЕ, И НЕНАРУШАВАНЕ НА ПРАВАТА НА ТРЕТИ СТРАНИ. TCL НЕ ГАРАНТИРА ТОЧНОСТТА, ВАЛИДНОСТТА, НАВРЕМЕННОСТТА, ЗАКОННОСТТА ИЛИ ЗАВЪРШЕНОСТТА НА СЪДЪРЖАНИЕТО ИЛИ УСЛУГИТЕ, ПРЕДЛАГАНИ ПРЕЗ ТОВА УСТРОЙСТВО И НЕ ГАРАНТИРА, ЧЕ УСТРОЙСТВОТО, СЪДЪРЖАНИЕТО ИЛИ УСЛУГИТЕ ЩЕ УДОВЛЕТВОРЯТ ВАШИТЕ ИЗИСКВАНИЯ, ИЛИ ЧЕ РАБОТАТА НА УСТРОЙСТВОТО ИЛИ УСЛУГИТЕ ЩЕ БЪДАТ НЕПРЕКЪСНАТИ И БЕЗ НЕИЗПРАВНОСТИ. TLC НЕ НОСИ ОТГОВОРНОСТ, ПРИ НИКАКВИ ОБСТОЯТЕЛСТВА, ВКЛЮЧИТЕЛНО И ПОРАДИ НЕБРЕЖНОСТ, НЕЗАВИСИМО ДАЛИ ПО СИЛАТА НА ДОГОВОР ИЛИ ЗАКОНОНАРУШЕНИЕ, ЗА КАКВИТО ДА Е ДИРЕКТНИ, ИНДИРЕКТНИ, СЛУЧАЙНИ, ПРЕКИ ИЛИ КОСВЕНИ ЩЕТИ, ПРАВНИ РАЗНОСКИ, РАЗХОДИ ИЛИ ДРУГИ ЩЕТИ, ПРОИЗТИЧАЩИ ОТ ИЛИ ВЪВ ВРЪЗКА С ИНФОРМАЦИЯ СЪДЪРЖАЩА СЕ ИЛИ ПРОИЗТИЧАЩА ОТ ИЗПОЛЗВАНЕТО НА УСТРОЙСТВОТО, ИЛИ НА СЪДЪРЖАНИЕ ИЛИ УСЛУГА, ДО КОЯТО ВИЕ ИЛИ ТРЕТА СТРАНА Е ИМАЛА ДОСТЪП, ДОРИ АКО СТЕ БИЛИ ПРЕДУПРЕДЕНИ ЗА ВЪЗМОЖНОСТТА ОТ ПОДОБНИ ЩЕТИ. \n   Услугите на трети страни могат да се променят, прекъсват, отстраняват, преустановяват или спират, или достъпът до тях да бъде деактивиран по всяко време и без предупреждение, и TCL (производител на телевизорите с марка Thomson) не поема отговорност или не гарантира, че каквито и да е съдържание или услуги ще останат достъпни за какъвто и да е период от време. Съдържанието и услугите се разпространяват от трети страни с помощта на мрежи и съоръжения за излъчване, над които TCL няма контрол. Без да ограничава общия характер на настоящия отказ от отговорност, TCL изрично отказва всякаква отговорност за промени, прекъсвания, деактивирания, отстранявания или спирания на съдържание или услуги, които се предлагат чрез това устройство. TCL може да наложи ограничения за достъпа до определени услуги или съдържание по всякакви причини и без предварително предизвестие или отговорност. TCL не носи отговорност за обслужване на клиентите, свързано със съдържанието и услугите. Всички въпроси или заявки за обслужване по отношение на съдържанието и услугите трябва да се отправят директно към съответните доставчици на съдържание и услуги."];

var noChannelListRemind        = ["Няма намерени канали. Списъкът с канали е наличен след сканиране за канали.","Сканиране на канали"];
var closeSubtitleRemind   = "Функцията ще бъде достъпна при изключване на субтитрите. Желаете ли да зададете сега?";

var estickerTitles = ["Високо реалистични изображения","Живи цветове","Реализъм на движенията","Динамично качество на картината","SR UHD мащабиране","Истински 3D свят","По-бързо функциониране","Бъдещо 4К съдържание","Наслаждавайте се на света на интернет","Достъп до допълнително съдържание","Вградени цифрови тунери","Свързване на всички устройства","Различни 4К източници","USB съдържание","Ултра-бърз безжичен интернет","Мобилно съдържание в телевизора","Съдържание на мобилни устройства","Местно съдържание","Одобрено от DivX","Безупречна картина","Canal Ready","TDT Premium"];

var estickerDescriptions = ["Невероятно изживяване при гледане, благодарение на четири пъти по-детайлни Full HD изображения върху UHD екран","Широката цветова гама поражда вълнение във всяка сцена с ярки червени и изумрудени зелени цветове","4K интерполацията на кадрите и фоновото осветление се справят ефективно с размазването на движенията","Яркостта на оригиналното изображение се подсилва за истинска динамична експресия с блестящ контраст","Наслаждавайте се на по-отчетливи телевизионни предавания и Blu-Ray дискове, благодарение на технологията Супер резолюция","Изпитайте удоволствието от 3D TV Ready и гледайте разнообразно 3D съдържание","Приятни изживявания с Quad Core за плавно взаимодействие и подобрена ефективност","HEVC (H.265) кодек поддръжка за бъдещия стандарт за видео разпространение 4K","Изобилие от онлайн приложения, услуги тип видео-при-поискване, телевизионно и интернет сърфиране","Вижте повече допълнителни услуги и съдържание от любимите си телевизионни оператори","Достъп до телевизионни канали с висока разделителна способност, без допълнителна цифрова приставка","Лесен за свързване с различните цифрови източници в дома Ви","Телевизор готов за бъдещето, способен да възпроизвежда 4K 50/60Hz чрез HDMI 2.0 с HDCP 2.2","Изобразяване на видеоклипове или снимки на голям екран директно от USB устройство, твърд диск или камера в резолюция 4К","Последно поколение 2x2 MIMO и AC стандарти предоставят несравнима скорост за интернет достъп","Наслаждавайте се на снимки, видеоклипове, приложения от мобилни устройства върху голям екран, благодарение на технологията за симетрично отразяване","Снимки, видеоклипове, приложения от смартфон или таблет могат да бъдат показвани върху голям екран ","Показване на местно съдържание (като снимки и видеоклипове от устройства, свързани към локална мрежа) върху голям екран","Възпроизвеждане на собствени или наети филми, защитени от DivX","Изключително тесен панел и супер тънък дизайн","Изпробван и одобрен от Canal +","Изпробван и одобрен от TDT Premium"];							

var eManualTextArray = ["Е-наръчник","Всички графики служат единствено за цветово представяне."];
var frontPanelRemind = "Блокиран преден панел";
var eRPRemind		 = "Режим \"Магазин\" не може да отговори на изискванията за ПСЕ. Сигурни ли сте?";	
var noRelatedChannel = "Няма сходен канал";
var option0624Name          = ["BOP","BFS","Събитие по събитие","GetUserID","BGM","Reset all","Възстановяване фабрични настройки","NRM","Избор на DVB-T2 и държава","Режим HbbTV"];
var DVBT2AndChoice = ["Вкл.","Избор на държава:","Изкл."];
var hbbtvServiceRemind = "Скоро услуга HbbTV.";
var insertWord = "Постави";
var viewDetail = "Детайлен изглед";			

var remindOAD  = "Актуализиращ софтуера. Може да има нов препоръчителен софтуер за актуализация на друг канал. Ако изберете да го заредите, може да превключи автоматично на този канал. Искате ли да го направите сега?";

var LEDStatus = ["Примигване", "Нормален"];
var netFlixRemind = "Тази функция прекратява достъпа до услугите на Netflix до следващото ви влизане.";
var ESNExplanation = "Електронен сериен номер";
var resetShopRemind = "Системата се връща в начално състояние. Не изключвайте телевизора";
var initialSelectOption = "Изберете опция:";
var databaseRemind   = "Системата разпознава базата данни като повредна поради неизвестна причина и я реизгражда автоматично. Натиснете Ок, за да продължите.";
var Deactivation = "Деактивиране";
var oadFutureRemind = "Актуализиране на софтуера. На %s ще предложим препоръчвана софтуерна актуализация. Актуализирането може да отнеме известно време и екранът да стане черен. Не изключвайте приемника по време на актуализиране. Ако приемете актуализирането, моля, оставете приемника включен или в режим на готовност в планираното време. Желаете ли да приемете актуализацията?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Звуков изход";
var bt_soundOutPutTV = "Телевизионни говорители";
var bt_soundOutPutBT = "Bluetooth устройство";
var bt_soundOutPutBT_TV = "Bluetooth и ТВ";
var bt_refreshBarName = "Устройства";
var bt_settingTips_On = "Включване на функцията Bluetooth и сканиране за устройства.";
var bt_settingTips_Finding = "Откриване на налични устройства...";
var bt_settingTips_NoDevice = "Няма налични устройства.";
var bt_deviceList_State_NoConnect = "Няма връзка";
var bt_deviceList_State_Connecting = "Свързване...";
var bt_deviceList_State_Connected = "Свързани";
var bt_deviceList_State_Paired = "Сдвоени";
var bt_deviceList_Conncect_Failed_Tips1 = "Връзката се разпадна.";
var bt_deviceList_Conncect_Failed_Tips2 = "Моля потвърдете, че Bluetooth функцията на ХХХ е включена.";
var bt_deviceList_Conncect_Success = "Свързано към Bluetooth устройство.";
var bt_deviceList_Disconncect_Success = "Връзката с Bluetooth устройството е прекъсната.";
var bt_deviceList_Disconnect = "Сигурни ли сте, че искате да прекъснете връзката с ХХХ?";
var bt_tipsTitle = "Пояснение";
var bt_bluetooth_Pairing_Title = "Bluetooth сдвояване";
var bt_bluetooth_Input_Pin = "Моля въведете PIN код:";
var bt_bluetooth_Output_Pin_Tip = "Въведете PIN код XXXX посредством клавиатурата.";
var bt_bluetooth_Pin_Wrong_Tip = "Грешен PIN код";
var bt_bluetooth_Remove_Pair_Title = "Заявка";
var bt_bluetooth_Remove_Pair_Ask = "Забравяне на устройството?";							
var bt_bluetooth_module_error = "Грешка Bluetooth модул!";		
		
var netflixDialogOptions = ["OK","По-късно","Никога не показвай отново"];
var netflixDialogContent = "Netflix предлага хиляди филми, включване сега?";
var netflixRemoteDialogContent = "Вече можете да закупите дистанционно управление с бутон Netflix. Повече информация има на следния уебсайт.\nhttps://store.tcleu.com";
							
var applyPictureModeSwitchValue	 = ["Настоящия източник","Всички източници"];
var audioDescriptionName = ["Звуково описание","Говориел","Сила звук говорител","Слушалка","Сила звук слушалка","Сила звук AD","BT устройство","Сила на звука на BT устройство"];
var audioDescriptionOptions = ["Изкл.","Нормален","Звуково описание"];				
var volumeOffRemind = 'Задайте настройка "Вкл." (On) на XXX в Меню за настройки.';	
var switchSourceRemind   = " поставени. Искате ли да включите сега?";								

var mEPSRemind		 = "Shop mode does not meet the MEPS requirements. Are you sure you want to select it?";		
var parentRatingAUOptions = ["No block", "Block G and above(optional)", "Block PG and above",
							 "Block M and above", "Block MA and above", "Block AV and above", 
							 "Block R and above", "Block all"];	
var mEPSTips		= ["The current picture mode does not meet the MEPS\nrequirements, standard mode is recommended.", 
					   "Your TV is in shop mode.\nFor home mode, please see Settings menu."];

var footballModeName = "Режим на спорт";
var resetStadium = "Стадион";							
var netflix = "NETFLIX";
var golive = "GOLIVE";	
//以下数组是虚拟遥控器的html中所有span的文字，要一一对应
var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9","Изход","0","Увеличение+",
                       	   "Изход",
                       	   "Списък","0","Текст","Напътствия","Вход","Изход","Меню","Субтитри","Информация",
                       	   "Стоп",
                       	   "Информация","Меню","Изход"
                       	   ];			
var nscreenTips = "GuideOn помага на потребителите да се придвижват в огромния обем съдържание.";
var nscreenContent = 'Стъпки: 1.Щракнете върху „TCL nScreen“ на телефона.  Свържете телефона към телевизор в същата LAN; 2.Щракнете върху „GuideOn“, за да влезете в приложението GuideOn; 3.GuideOn осигурява функции, подобни на отпечатан програмен наръчник, информирайки потребителите за наличното телевизионно съдържание; '
var singalBrokenoffTips = "Прекъсване на сигнала. Системата не може да завърши изтеглянето.";
var contentSpan1_1Array_AU = [["ЗАХРАНВАНЕ:","ИЗТОЧНИК:","МЕНЮ:","BACK:","INFO:","HOME:","EXIT:","СПИСЪК:"],
                           ["Turns power on or standby mode","Select the input source",
                            "Show TV settings menu","Go back to the Previous menu or exit a running APP","Показва информация за програмата",
                            "Прехвърля Ви на началната страница", "Go back to the Previous menu or exit a running APP","Показва списък с канали"]];
var guideDescriptionWords ="Сканирайте QR кода, за да изтеглите приложението GuideOn на телефона.";
var settingNoticeSourceName ="Автоматичен източник";