
var all_country 	= ["Αυστραλία","Αυστρία ","Βέλγιο","Βουλγαρία","Κροατία","Τσεχία","Δανία","Φινλανδία","Γαλλία","Γερμανία",
						"Ελλάδα","Ουγγαρία","Ιταλία","Λουξεμβούργο ","Ολλανδία","Νορβηγία","Πολωνία","Πορτογαλία","Ρουμανία","Ρωσία",
						"Σερβία","Σλοβενία","Ισπανία","Σουηδία","Ελβετία ","Ηνωμένο Βασίλειο","Νέα Ζηλανδία"," "/*Arab*/,"Εσθονία"," "/*Hebrew*/,
						"Λετονία","Σλοβακία","Τουρκία","Ιρλανδία","*","Φιλιππίνες","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"Κίνα","*","*","*","*","*","*","Άλλα","Λιθουανία"/*新添加的，底层结构体中没有*/,"Ουκρανία"/*新添加的，底层结构体中没有*/,
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","Iceland","Belarus","*","Λιθουανία"];								
				
var all_language 	= ["Τσέχικα","*","Δανέζικα","*","*","Γερμανικά","Αγγλικά","Γαλλικά","Ελληνικά","Ισπανικά",
						"Κροατικά","*","Ιταλικά","Ουγγαρέζικα","Ολλανδικά","Νορβηγικά","Πολωνικά","Πορτογαλικά","Ρώσικα","Ρουμανικά",
						"Σλοβένικα","Σερβικά","Φινλανδικά","Σουηδικά","Βουλγαρικά","Σλοβάκικα","*","*","Κέλτικα","*",
						"Ουαλικά","Αραβικά ","Irský","Latvian","*","Τούρκικα","Estonian","Ολλανδικά"/*Netherlands*/,"*","*",
						"*","*","*","*","*","*","Αρχικός ήχος"/*Qaa*/,"Μη προσδιορισμένο "/*Undetermined*/,"*","Άγνωστο",
						"Μη προσδιορισμένο ","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Βασκικά","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","bělorusky","*","*","Καταλανικά","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Γαλικιακά","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Ισλανδικά","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Lithuanian",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Αισθηματικό","*","*","*","*",
						"*","*","*","Σάμη","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Teletext",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Ukrainian","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*"];
var offOn			= ["Εκτός Λειτουρ.","Εντός Λειτουρ."];
var okCancel		= ["ΟΚ","Ακύρωση"];
var yesNo			= ["ΝΑΙ","ΟΧΙ"];
var level			= ["Εκτός Λειτουρ.","Χαμηλό","Υψηλός","Μεσαίο"];
var manualAuto		= ["Εγχειρίδιο","Αυτόματος"];
var homeShop		= ["Σπίτι","Κατάστημα"];
var picPreset		= ["Πρότυπο","Dynamic","Φυσική","Κινηματογράφος","Ψηφιακός κινηματογράφος","Προσωπική"];
var picColorTemp	= ["Ψυχρό","Κανονικά","Θερμό","Θερμό2","Χρήστης"];
var pic3dNavig		= ["Εγχειρίδιο","Αυτόματος","Ημιαυτόματα"];
var _3dOptions		= ["Λειτουργία 3D","3D σε 2D","Διακόπτης Α-Δ","Βάθος πεδίου"];
var pic3DMode       = ["Εκτός Λειτουρ.","2D σε 3D","Σε παράθεση","Μισό πάνω-Μισό κάτω","Εναλλαγή γραμμών"];
var picEcoOptions	= ["Εξοικονόμηση ενέργειας","Αισθητ. Φωτός","Τοπική βαθμ. εξασθένιση","Μικτή μείωση φωτεινότητας"];
var picGeoOptions	= ["Γεωμετρία","Ο. Θέση","Κ. Θέση","Ρολόι","Φάση"];//Geometry 无翻译
var picAdWhiteBal	= ["Έμφαση R","Έμφαση G","Έμφαση B","Αντιστάθ. R","Αντιστάθ. G","Αντιστάθ. B"];
var souOptions		= ["Επαναφορά ηχητ. Ρυθμίσεων","Ισορροπία","Καθυστέρηση ήχου","SRS TSHD","Αυτόμ. ρύθμ. έντασ.",
						"Τύπος SPDIF","SPDIF Καθυστέρηση","Τοποθέτηση τηλεόρασης","Γλώσσα ήχου","Ηχητικό κανάλι",
						"Ηχητική περιγραφή","Τύπος εξόδου ψηφιακού ήχου","Επαγγελματική ρύθμιση Dolby"];
var soundOutputoptions =["Έξοδος DAP ηχείου τηλεόρασης","Εξωτερική έξοδος κωδικοποίησης AVR"];
var inteligenteqoptions 	=["Εστιασμένος","Πλούσιος"];						
var souSpdifType	= ["Αυτόματος"/*Dolby*/,"PCM","Εκτός Λειτουρ."];
var colorSpace      = ["Αυτόματος","Εγγενής","Χρήστης","DCIP3"];
var souPresetPara	= ["100Hz","300Hz","1KHz","3KHz","10KHz","Virtualizer περιβάλλοντος","Ενίσχυση συνομιλίας ","Ενίσχυση μπάσων","Έξυπνος ήχος","Έξυπνα πολυμέσα","Γραφικός ισοσταθμιστής","Προηγμένο EQ"];
var chOptions		= ["Σάρωση Καναλιού","Λίστα καναλιών","EPG","Οργανωτής","Διαγνωστικός έλεγχος καναλιού",
						"χρον. μετατόπιση","Υπότιτλοι","Teletext","Τύπος λίστας καναλιών"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Ισχύς Σήματος","Ποιότητα Σήματος","Συχνότητα (KHz)","ID Συντήρησης","ID Δικτύου","Όνομα Δικτύου"];
var chScanOptions	= ["Χώρα","Κατάσταση συντονισμού","Αυτόματη αναζήτηση","Αυτόματη ενημέρωση","Αναλ. χειροκ. σάρ.",
						["Χειροκίν. σάρωση καλωδ.","Χειροκ. Σάρωση Κεραίας","Μη αυτόμ. συντονισμός δορυφόρου"],"Ρύθμιση δορυφορικής κεραίας","Επιλογή αγαπημένου δικτύου","Εκκαθαρίστε τη λίστα καναλιών",];
var favNetDes		= "Επιλέξετε το αγαπημένο σας δίκτυο";
var tuner			= ["Καλώδιο","κεραία","Δορυφόρος"];//Satelite 无翻译
var passError		= "Λάθος κωδικός πρόσβασης.\nΕισάγετε ξανά!";
var chType			= ["Αναλογ. κανάλια: ","Ψηφιακά κανάλια: "];
var chScanStatus	= ["Κατάσταση: Σάρωση","Κατάσταση: Σάρωση ολοκληρώθηκε","Κατάσταση: Η σάρωση ακυρώθηκε","Κατάσταση: Σφάλμα σάρωσης"];
var chScanPara		= ["Συχνότητα (KHz)","Διαμόρφωση","Ρυθμός Μετάδ.  (Ksym/s)","ID Δικτύου","Σύστημα",
						"Μικρορύθμιση","Ισχύς Σήματος","Ποιότητα Σήματος","Λειτουρ. Σάρωσης","Αναγνωριστικό καναλιού"];
var chScanParaMHZ      = ["Συχνότητα (MHz)"];
var chAtvManSys		= ["ΔΥΤ. ΕΥΡ.","ΑΝΑΤ. ΕΥΡ.","ΗΒ","Γαλλία"];
var modulation		= ["16QAM","32QAM","64QAM","128QAM","256QAM","Αυτόματος"];
var chCleanDes		= "Θέλετε να καθαρίσετε τη λίστα καναλιών;";
var chDeletDes		= "Θέλετε να  διαγράψετε το κανάλι;";
var chOperator		= ["Ziggo","UPC","Άλλα"];
var chScanType		= ["Ψηφιακά & Αναλογικό","Ψηφιακά","Αναλογικά"];
var chScanMode		= ["Πλήρης","Μπροστά","Γρήγορο"];
var bookingModes	= ["Εγγραφή","Υπενθύμιση"];
var dayName			= ["Κυρ","Δευτ","Τρίτ","Τετ","Πέμ","Παρ","Σάβ"];
var monthName		= ["Ιαν.", "Φεβ.","Μάρ.","Απρ.","Μάιος","Ιούν.","Ιούλ.","Αύγ.","Σεπ.","Οκτ.","Νοέμ.","Δεκ."];
var filter			= ["Suodin","Τύπος","Υποκατηγορία"];
var chEpgFirstGenre	= ["Κινηματογράφος","News","Σόου","Σπορ","Παιδικά","Μουσική","Τέχνες","Κοινωνικά","Εκπαίδευση","Χόμπυ","ΕΙΔΙΚΟ"];
var chEpgSecondGenre= [["Δράμα","Αστυνομικό","Περιπέτεια","Επιστημονική φαντασία","Κωμωδία","Σαπουνόπερα","Αισθηματικό","Σοβαρό","Ταινία μόνο για ενηλίκους"," "," "," "],
						["Επικαιρότητα","Πρόβλεψη καιρού","Μαγκαζίνο επικαιρότητας","Ντοκιμαντέρ","Συζήτηση"," "," "," "," "," "," "," "],
						["Σόου","Τηλεπαιχνίδι","Βαριετέ","Τοκ σόου"," "," "," "," "," "," "," "," "],
						["Σπορ","Ειδικά συμβάντα","Αθλητικό μαγκαζίνο","Ποδόσφαιρο","Τένις",
							"Ομαδικά σπορ","Αθλητικά","Μοτοσικλέτα","Σπορ του νερού","Χειμερινά σπορ",
							"Ιππασία","Πολεμικά σπορ"],
						["Παιδικά","Παιδικό προσχολικής ηλικίας","Ψυχαγωγικό από 6 έως 14 ετών","Ψυχαγωγικό από 10 έως 16 ετών","Ενημερωτικό","Κινούμενα σχέδια"," "," "," "," "," "," "," "],
						["Μουσική","Rock","Σοβαρό","Παραδοσιακή","Τζαζ","Μιούζικαλ","Μπαλέτο"," "," "," "," "," "],
						["Τέχνες","Θεατρικές τέχνες","Καλές τέχνες","Θρησκεία","Λαϊκός πολιτισμός",
							"Λογοτεχνία","Ταινίες","Πειραματικό","Μετάδοσης (Broadcast)","Νέα μέσα επικοινωνίας",
							"Καλλιτεχνικό Μαγκαζίνο","Μόδα"],
						["Κοινωνικά","Περιοδικά","Οικονομικά","Αξιοσημείωτοι άνθρωποι"," "," "," "," "," "," "," "," "],
						["Εκπαίδευση","Φύση","Τεχνολογία","Ιατρική","Ξένες χώρες","Κοινωνικές επιστήμες","Συνεχή εκπαίδευση","Γλώσσες"," "," "," "," "],
						["Χόμπι","Τουρισμός","Χειροτεχνία","Αυτοκίνητα-μοτοσυκλέτες","Καλοζωία και υγεία","Μαγειρική","Διαφήμιση","Κηπουρική"," "," "," "," "],
						["Γλώσσα πρωτότυπου","Ασπρόμαυρο","Αδημοσίευτο","Ζωντανή μετάδοση"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Παράλειψη καναλιού","Ταξινόμηση καναλιών","Επεξεργ. καναλιού","Διαγραφή καναλιού","ανταλλαγής κανάλι","κανάλι ένθετο"];
var chEditPara 		= ["Όνομα Δικτύου","Αριθμός καναλιού","Όνομα καναλιού","Συχνότητα","Σύστημα χρωμάτων","Σύστημα ήχου"];
var chSatTitles		= ["Τύπος δορυφόρου","Ρύθμιση δορυφορικής κεραίας","Επιλογή δορυφόρου"];
var chSatEidtOptions= ["Όνομα δορυφόρου","Θέση","LNB ισχύς","Συχνότητα LNB (MHz)","Είσοδος Diseqc",
						"Τόνος 22KHz","ριπή τόνου","Συχνότητα (KHz)","Ρυθμός Μετάδ.  (Ksym/s)","Πόλωση",
						"Ισχύς Σήματος","Ποιότητα Σήματος","Κατάσταση δορυφόρου"];
var chSatAutoPromt	= [["Όλα","Δίκτυο"],
						["Όλα","Δωρεάν"]];
var chSatAutoScanOptions=["Επιλογή δορυφόρου","Λειτουρ. Σάρωσης","Кανάλια"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Καθολικό",];
var chSatDiSEqCInput= ["Απενεργοποίηση","A","B","C","D"];
var chSatTone22KHz	= ["Αυτόματος","Εντός Λειτουρ.","Εκτός Λειτουρ."];
var chSatToneBurst	= ["Απενεργοποίηση","ριπή τόνου A","ριπή τόνου B"];
var chSatPolarization= ["Οριζόντια","Κατακόρυφη"];
var chSatSetupOptions=["Τύπος κεραίας","Τιούνερ","Ζώνη συχνοτήτων"];
var chSatAntennaType= ["Απλό καλώδιο","Καθολικό"];
var chSatUserBands	= ["Ζώνη χρήστη 1","Ζώνη χρήστη 2","Ζώνη χρήστη 3","Ζώνη χρήστη 4","Ζώνη χρήστη 5","Ζώνη χρήστη 6","Ζώνη χρήστη 7","Ζώνη χρήστη 8"];
var chSatOthers		= ["Αναμεταδότης"];
var chSatSetupOthers= ["Ορίζεται από το χρήστη"];
var pleaseSelectSat = "Επιλέξτε δορυφόρους πρώτα!";
var subOptions		= ["Υπότιτλοι","Γλώσσα ψηφ. υπότιτλων","2η Γλώσσα ψηφ. Υπότιτλων ","Τύπος υπότιτλων"];
var ttxOptionsCon      = ["Αποκωδ. Γλώσσας σελίδας ","Γλώσσα ψηφ. Teletext"];
var subType			= ["Κανονικά","Ασθενή Ακοή"];
var netIntf     	= ["Ethernet ","Ασύρματη"];
var netConnDes		= ["Η τηλεόραση δοκιμάζει τη σύνδεση δικτύου.\nΠεριμένετε",
						"Η δοκιμή σύνδεσης δικτύου ολοκληρώθηκε!",
						"Η δοκιμή σύνδεσης δικτύου απέτυχε."];
var netSsidError	= "Ένα έγκυρο όνομα SSID αποτελείται από 1 έως 32 χαρακτήρες. Ελέγξτε το SSID.";
var netOthers		= ["Κωδικός PIN   "];
var netWlessAutoDes	= ["Βεβαιωθείτε ότι ο παρακάτω κωδικός PIN είναι εγκατεστημένος στο Σημείο Πρόσβασης, πριν επιλέξετε OK.",
						"Πατήστε το κουμπί στο Σημείο Πρόσβασης εντός 120 δευτερολέπτων, πριν επιλέξετε OK."];
var netConnRemind	= ["Λάθος κωδικός πρόσβασης.",
						"Σύνδεση. Παρακαλώ περιμένετε!",
						"Επιτυχία σύνδεσης. Αποκτήθηκε IP!",
						"Αποτυχία συνδέσμου",
						"Η TV σαρώνει για ΣΠ. Παρακαλώ περιμένετε!",
						"Δεν υπάρχουν ασύρματες συσκευές συνδεμένες στην TV σας!"];
var netWireIpOptions= ["Ρύθμιση IP","Τύπος διεύθυνσης","Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS","Δευτερεύων DNS"];
var netWireConnRemind= ["Εισάγετε μια τιμή μεταξύ 0 και 255.",
						"Συνδέθηκε με επιτυχία!",
						"Πληκτρολογήστε μια έγκυρη διεύθυνση",
						"Συνδέθηκε με επιτυχία!",
						"Αποτυχία σύνδεσης!",
						"Σύνδεση. Παρακαλώ περιμένετε!",
						"Πληκτρολογήστε μια τιμή μεταξύ 1 και 223."];
var netFlixOptions	= ["Απενεργοποίηση","ESN"];
var netFlixDes	 	= ["Είστε βέβαιοι ότι θέλετε απενεργοποίηση;"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Ενημέρωση Λογισμ.";
var netUpdateDialogTitle = "Ενημέρωση λογισμικού";
var netBGDownloadTitle 	= "Γίνεται λήψη";
var netUpdateLoadingPrompt= ["Γίνεται αναζήτηση για αναβαθμίσεις. Παρακαλώ περιμένετε!",
							"Γίνεται λήψη λογισμικού... Παρακαλώ περιμένετε!",
							"ΜΗΝ απενεργοποιείτε την τηλεόραση κατά την αναβάθμιση του λογισμικού!",
                            "Οι σημαντικές ενημερώσεις λογισμικού εγκαθίστανται αυτόματα παρασκηνιακά!"];
var netUpdatePrompt= ["Συγχαρητήρια, η έκδοση του λογισμικού σας είναι η πιο πρόσφατη!",
						"Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Αποτυχία σύνδεσης!",
						"Η λήψη δεδομένων απέτυχε. Προσπαθήστε ξανά αργότερα!",
						"Αποτυχία XML ενημέρωσης ανάλυσης!",
						"Αποτυχία συνδέσμου",
						"Η λήψη του λογισμικού ήταν επιτυχής. Θέλετε να ξεκινήσετε την αναβάθμιση;",
						"Απώλεια δεδομένων!Αποτυχία λήψης!",
						"Αποτυχία ελέγχου του πακέτου, δοκιμάστε ξανά!",
						"Το δίκτυο δεν λειτουργεί κανονικά. Ελέγξτε το και επανασυνδεθείτε ξανά…",
						"Αποτυχία ενημέρωσης. Επανεκκινήστε την τηλεόραση!",
						"Το αρχείο αναβάθμισης διαγράφηκε απροσδόκητα. Επαναλάβετε την αναβάθμιση μέσω δικτύου.",
						"Η λήψη του λογισμικού ολοκληρώθηκε με επιτυχία στο παρασκήνιο. Θέλετε να γίνει αναβάθμιση;"];
var netUpdateButtonText = ["Λήψη", "Ενημέρωση", "Αργότερα", "Ποτέ", "ΟΚ","Συνέχεια"];
var autoDetectPrompt = ["Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Βρέθηκε η νέα έκδοση του λογισμικού XXXX. Θέλετε να κάνετε ενημέρωση τώρα;",
						"Η διαδικασία αναβάθμισης μέσω δικτύου ματαιώθηκε την τελευταία φορά. Θα πορέπει να επαναλάβετε την αναβάθμιση.",
                        "Η λήψη της νέας ενημέρωσης λογισμικού XXXX δεν ολοκληρώθηκε. Θέλετε να συνεχίσετε;",
                        "Έγινε λήψη λογισμικού. Θέλετε να κάνετε ενημέρωση τώρα;"];
var sysOptions		= ["Ηλεκ. Εγχειρίδιο","Γλώσσα μενού ","Χρονοδιακόπτης","Κλείδωμα","Ρυθμίσεις Εισαγωγής",
						"Ενημέρωση Λογισμ.","Τοποθεσία","Λειτουργία HbbTV","Cookies","Κοινή διεπαφή",
						"Ρυθμίσεις για προχωρημένους","Επαναφορά shop","Ένδειξη LED"];
var sysResetDes		= "Είστε σίγουρος;";
var sysMenuLangOptions=["Γλώσσα","Προτιμώμενη γλώσσα ήχου","2η προτιμώμενη γλώσσα ήχου"];
var sysTimerOptions	= ["Ζώνη ώρας","Όνομα περιοχής","Ρολόι","Χρον/πτης ύπνου","Αυτόματη αναμονή", "Country region"];

var sysTimeZone		= ["Ως παρουσιαστής","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:01","GMT +8:01",
						"GMT +9:00","GMT +9:30","GMT +10:01","GMT +11:01","GMT +12:00",
						"GMT +12:45","GMT +13:01","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Εκτός Λειτουρ.","10 λεπτά","20 λεπτά","30 λεπτά","40 λεπτά","50 λεπτά","60 λεπτά","90 λεπτά","120 λεπτά"];
var sysStandby		= ["Εκτός Λειτουρ.","4 Ώρες","6 Ώρες","8 Ώρες"];
var sysRegionName	= ["Μαδρίτη","Κανάρια"];
var sysClockOptions	= ["Αυτόμ. συγχρονισμός","Ημερομηνία","Ώρα","Χρονοδιακ. ενεργ.","Χρονοδιακόπτης",
						"Ενεργοποίηση καναλιού","Χρονοδιακ. απενερ.","Χρονοδιακόπτης"];
var sysTimer		= ["Εκτός Λειτουρ.","Καθημερινά","Μια φορά"];

var sysInputSet		= ["Χωρίς Ετικέτα","DVD","Blu-ray","HDD","DVDR",
						"HD rec.","Παιχνίδι","VCR","PC","Ψηφιακό STB",
						"HD ψηφ STB","Κάμερα","Συσκ. Εγγραφ.","Άλλο"];
var sysAvVideoInput	= ["Αυτόματος","RGB_CVBS","RGB","CVBS","S-Video"];
var sysUpdate		= ["Μέσω USB","Μέσω Δικτύου","Ανά κανάλι"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Δεν είναι δυνατή η εύρεση νέου λογισμικού στον αέρα!",
						"Βρέθηκε η νέα έκδοση του λογισμικού XXXX. Θέλετε να κάνετε ενημέρωση τώρα;",
						"Τοποθετήστε την κάρτα μνήμης USB.",
						"Αποτυχία ελέγχου του πακέτου, δοκιμάστε ξανά!",
						"ΜΗΝ αποσυν. το USB dongle και μην απεν. την TV κατά την ενημέρ. του υλ/κού!!",
						"Το λογισμικό ενημερώθηκε με επιτυχία.\nΘα γίνει επανεκκίνηση της τηλεόρασης!",
						"Βρέθηκε η νέα έκδοση λογισμικού XXXX. Θέλετε να κάνετε λήψη τώρα; Αυτό μπορεί να διαρκέσει λίγο διάστημα, ανάλογα με την κατάσταση του δικτύου σας.",
						"Γίνεται λήψη",
						"Η λήψη του λογισμικού ήταν επιτυχής. Θέλετε να ξεκινήσετε την αναβάθμιση;",
						"Αποτυχ ενημέρ!",
						"Αναζήτηση αρχείων αναβάθμισης",
						"Η ενημέρωση του λογισμικού ολοκληρώθηκε.\nΕπανεκκινήστε την τηλεόραση τώρα."];
var sysProductInfo	= ["Τρέχουσα Έκδοση","Όνομα προϊόντος","Όνομα κατασκευαστή","Όνομα πλαισίου"];
var sysCiDes		= ["Δεν εμφαν. κάρτα CI."];
var sysAdOptions	= ["Εγγραφή σε DivX(R)","Απενεργοποίηση DivX(R)","T-Link","Authorization Error","Επιβεβαίωση κατάργησης καταχώρησης",
						"Επιβεβαίωση ενοικίασης","Η ενοικίαση έληξε","Αναγνωριστικό δήλωσης Bluetooth"];
var sysRegistDes	= ["Θα πρέπει να δηλώσετε τη συσκευή σας για την προβολή προστατευμένων βίντεο DivX",
						"Κωδικός εγγραφής:",
						"Εγγραφείτε στο http://vod.divx.com"];
var sysDregistDes	= ["Κωδικός απενεργοποίησης:",
						"Για απενεργοποίηση μπείτε στο http://vod.divx.com",
						"Θέλετε να συνεχίσετε με την εγγραφή σας;"];
var mediaAuthorization = ["Η συσκευή σας δεν είναι εξουσιοδοτημένη να αναπαράγει αυτό το βίντεο με προστασία DivX(R)."];
var deregistrationConfrimation = ["Έχετε ήδη δηλώσει τη συσκευή σας.","Είστε σίγουρος/η ότι επιθυμείτε να διαγραφείτε;"];
var rentalConfirmation = "Χρησιμοποιήθηκαν XXXX από τις YYYY προβολές στην ενοικίαση DivX(R). Συνέχεια;";
var rentalExpired 	= "Η ενοικίαση DivX(R) έχει χρησιμοποιηθεί XXXX από τις YYYY φορές. Η ενοικίαση DivX έχει λήξει.";
						
						
var sysLockOptions	= ["Φραγή καναλιού","Κλείδωμα χρον. διαστήματος","Γονική διαβάθμιση","Φραγή εισόδου","Κλείδωμα μπροστινού πίνακα","Κλείδ. Εγκατ.",
						"Αλλαγή κωδ. πρόσβ.","Μεγ. Ένταση","Καθάρισε όλα"];
var sysTimeIntervals= ["Τύπος κλειδώμ.","Ώρα έναρξης","Ώρα λήξης"];
var sysRatingOptions= ["Κανένα","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Ακατάλληλο (Ισπανία)"];
var changePass		= ["Αλλαγή κωδ. πρόσβ.","Νέος κωδ. πρόσβ.","Επιβ. κωδ. πρόσβ."];
var changePassDes	= ["Λάθος κωδικός πρόσβασης.\nΕισάγετε ξανά!",
						"Ο κωδικός πρόσβασης δεν ταιριάζει.\nΕισάγετε ξανά!",
						"Η ρύθμιση κωδ. πρόσβασης ολοκληρώθηκε!",
						"Η ρύθμιση αυτού του κωδικού ως κωδικό πρόσβασης είναι πολύ απλή.\nΠληκτρολογήστε ξανά!"];
var sysPowerOnChOptions= "Επιλογή λειτουργίας";
var sysPowerOnCh	= ["Τελευταία κατάσταση","Επιλογή χρήστη"];
var netWlessSecu    = ["Άνοιγμα","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Κανένα","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ","Δεν υποστηρίζεται"];
var netWlessSecu3	= ["Κανένα","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)","Δεν υποστηρίζεται"];
var netOptions		= ["Σύνδεση Διαδικτύου","Διασύνδεση","Ασύρματες ρυθμίσεις","Ρυθμίσεις IP","Πληροφορίες",
						"Δοκιμή σύνδεσης","DLNA","Τηλεχειριστήριο","Ρυθμίσεις Netflix","Σύνδεση WiFi TV  ",
						"Τύπος διεύθυνσης","Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS",
						"Δευτερεύων DNS","SSID","BSSID","Εισάγετε SSID:","Αναγνωριστικό χρήστη"];
var chEditDes		= ["Διπλός αριθμός καναλιού!","Πατήστε το κόκκινο πλήκτρο για να διαγράψετε τον τρέχοντα χαρακτήρα!","Μη έγκυροι αριθμοί καναλιών."];
var chEpgNoProgram	= "Δεν υπάρχουν πληροφορίες προγράμματος. Επιλέξτε κανάλια πρώτα!";
var chEpgWords		= ["Οδηγός Προγράμματος","Δεν υπάρχουν δεδομένα προγράμματος.","Το κανάλι είναι κλειδωμένο!","Δεν υπάρχουν λεπτομέρειες για το πρόγραμμα.","Δεν υπάρχει τίτλος προγράμματος."];
var chEpgBooking	= ["Programarea meciului", "Αριθμός καναλιού","Ημερομηνία Έναρξης","Ώρα έναρξης","Ώρα λήξης",
						"Τύπος Επανάληψης","Τύπος προγράμματος","Προσθ.","Αντικατάσταση","Αλλαγή",
						"Προσθήκη/Τροποποίηση"];
var epgHotKey		= ["Προηγ. μέρα","Επόμενη μέρα","Suodin","Λίστα προγράμματος","Προσθ. προγράμματος"];
var chEpgBookRemind	= ["Εσφαλμένη ώρα έναρξης","Εσφαλμένος χρόνος λήξης","Διπλός προγραμματισμός","Αποθηκεύθηκε Επιτυχώς.","Διαγράφηκε με επιτυχία."];
var chSchePara		= ["Λίστα προγράμματος","Ώρα έναρξης","Ημερομηνία Έναρξης","Τίτλος προγράμματος","Όνομα καναλιού",
						"Διάρκεια","Επανάληψη","Προγραμματισμός","Επεξεργασία","Διαγραφή"];
var dateTimer		= ["Μια φορά","Καθημερινά","Εβδομαδιαία"];
var scheduleDeleteReminds="Θέλετε να διαγράψετε αυτό το πρόγραμμα;";
var scheduleNoLists	= "Δεν υπάρχει λίστα προγράμματος. Πατήστε το \"Κόκκινο\" πλήκτρο για να προσθέσετε ένα.";
var chListWords		= ["Λίστα καναλιών","Επιλογή λίστας","Κατάσταση συντονισμού","Προσθήκη σε Αγαπημένα","Διαγραφή  ",
						"Επιλογή λίστας καναλιών","Επιλογή λειτουργίας συντονιστή","Εναλλαγή"];
var chListType		= ["Όλα","Ψηφιακά","Αναλογικά","Ράδιο","Δωρεάν","Αγαπημένα"];
var chAutoScanOptions=["Επιλογή χειριστή","κανάλι τύπου","Αυτόματη αναζήτηση"];
var souSoundType	= ["Μη έγκυρο","Μονοφων.","Μονοφων.","Στερεοφωνικό","Στερεοφωνικό",
						"Μονοφων.","Στερεοφωνικό","Διπλό 1","Διπλό 2","Διπλό 2",
						"Nicam mono","Nicam stereo","Nicam dual1","Nicam dual2","Nicam διπλό",
						"Μονοφων.","LL","RR","LR"];
var souPreset		= ["Μουσική","Κινηματογράφος","Καθαρισμός φωνής","Πρότυπο","Προσωπική"];
var picAdRgbMode	= ["Εκτός Λειτουρ.","Κόκκινο μόνο","Πράσινο μόνο","Μπλε μόνο"];
var picAdOptions	= ["Ελάττωση Θορύβου","MPEG-Nr.","RGB mode","Dynamic Contrast","LED σαφήνειας κίνησης",
						"Τόνος δέρματος","Λειτουργία Φιλμ","Λειτουργ. Παιχνιδιού","Θερμοκρ. χρώματος","Ισορροπία λευκού",
						"Πάγωμα","Μαύρο Stretch","Υπερ-σάρωση","Gamma","Λειτουργία HDMI","10P ισορροπία λευκού","Επέκταση χρώματος",
						"Μείωση θαμπάδας","Εξάλειψη τρεμοπαίγματος ","Χρωματικό διάστημα","Σαφήνεια κίνησης "];
var pic10Pwhite     = ["Ενδιάμεσο","Κόκκινο","Πράσινο","Μπλε","Επαναφορά","Χρώμα","Κίτρινο","Κυανό","Ματζέντα"];
var picMotionClarity = ["Λειτουργία κίνησης ","Παρεμβολή κίνησης ","LED σαφήνειας κίνησης","Μείωση θαμπάδας","Εξάλειψη τρεμοπαίγματος ","Επαναφορά"];
var picMotionMode   = ["Αυτόματος","Ταινίες","Απαλή","Διαγραφή","Αθλητικά","Πελάτης"];
var picResetDes		= "Θα γίνει επαναφορά όλων των ρυθμίσεων και οι ατομικές σας ρυθμίσεις θα διαγραφούν. Θέλετε σίγουρα να εκτελέσετε την επιλεγμένη λειτουργία;";
var pic10PReset     = "Είστε βέβαιοι ότι θέλετε να επαναφέρετε τη λειτουργία 10P ισορροπία λευκού;";
var picMotionReset  = "Θέλετε να επαναφέρετε τις ρυθμίσεις της σαφήνειας κίνησης;";
var picColorSpaceReset    = "Θέλετε σίγουρα να επαναφέρετε τις ρυθμίσεις του χρωματικού διαστήματος;";
var picOptions		= ["Λειτουργία εικόνας",
						"Φωτισμός οθόνης","Φωτεινότητα","Αντίθεση","Κορεσμός","Χροιά","Ευκρίνεια","Θερμοκρ. χρώματος","Λειτουργία οθόνης","Αυτόματη μορφή",
						"Αθλητικά","3D","Πλοήγηση 3D","ECO Pυθμίσεις","Γεωμετρία",
						"Ρυθμίσεις για προχωρημένους","Εφαρμογή λειτουργίας εικόνας","Επαναφορά εικόνας"];
var picSize			= ["16:09", "Μορφή 4:3", "Μορφή 14:9  ", "Cinerama",
						"16:9-Zoomaus  ", "16:9-Zoomaus ylös","14:9-Zoomaus","Kapea zoomaus","Laaja zoomaus",
						"Zoomaus 2","Laaja zoomaus 2","Στην αρχική οθόνη","Piste pisteeltä","Αρχική","Πανοραμική"];
var others			= ["Ένταση","Μετάδοση","Κωδικός πρόσβασης","Κατάσταση","Αποθήκευση","Αντικατάσταση","Έναρξη","Έξοδος","Αναζήτηση","Διαγραφή",
						"Κανένα","Αυτόματο","Σάρωση","Ασφάλεια","Σύνδεση","Ανανέωση","Επανάληψη","Παύση","Pυθμίσεις","Кανάλια",
						"Επεξεργασία","Εισαγωγή","σήματος!","Τέλος","Στερεοφωνικό","Ήχος","Πηγή","Δεν υπάρχει ήχος","Συμβουλές","Επαναφορά",
						"Πελάτης","Ρύθμιση","Καταχώρηση","Χρήστης","Κλείσιμο πληκτρολογίου","Λειτουργία ασφαλείας","Καθημερινά","Λίστα PVR  "];
var direction		= ["Αριστερά","Δεξιά","Πάνω","Κάτω"];
var audioType 		= ["MPEG","Dolby D"/*"AC3"*/,"MPEG4","AAC", "Dolby D+"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Άγνωστο"];
var soundChannels   = ["Άγνωστο","Μονοφων.","Υπό","Διπλό μονοφωνικό","Στερεοφωνικό","Stereo Sub","Stereo Dolby Surround","Surround 2 ΚΑΝΑΛΙΩΝ","Surround","3.0Ch","4.0Ch","5.0Ch","Μονοφωνικό Lfe","Διπλό Μονοφωνικό Lfe","Στερεοφωνικό Lfe","Surround 2Ch Lfe","Surround Lfe","3.1Ch","4.1Ch","5.1ΚΑΝ","7.1ΚΑΝ","Μεικτό στερεοφωνικό  ","Fmrdo Μονοφωνικό","Fmrdo Στερεοφωνικό","Fm Μονοφωνικό Nicam Μονοφωνικό","Fm Μονοφωνικό Nicam Στερεοφωνικό","Fm Μονοφωνικό Nicam Διπλό","Αριστερά","Δεξιά","Άλλα"];
var prompts			= ["Ρυθμίστε την εικόνα που ταιριάζει καλύτερα στο περιβάλλον σας.",
						"Ρυθμίστε το επίπεδο της φωτεινότητας. Όσο πιο κοντά στην τιμή 100, τόσο φωτεινότερο.",
						"Ρυθμίστε το επίπεδο της αντίθεσης. Όσο πιο κοντά στο 100, τόσο μεγαλύτερη είναι η αντίθεση φωτεινού-σκούρου.",
						"Ρυθμίστε το επίπεδο του κορεσμού. Όσο πιο κοντά στο 100, τόσο πιο έντονο είναι το χρώμα.",
						"Ρυθμίστε το επίπεδο της οξύτητας. Όσο πιο κοντά στο 100, τόσο πιο έντονες είναι οι λεπτομέρειες.",
						"Ρυθμίστε το επίπεδο του οπίσθιου φωτισμού. Όσο πιο κοντά στο 100, τόσο πιο φωτεινή είναι η οθόνη.",
						"Ρυθμίστε το επίπεδο της απόχρωσης. Η ρύθμιση αλλάζει τους χρωματικούς τόνους.",
						"Επιλέξτε μορφή προβολής που ταιριάζει καλύτερα στο πρόγραμμα που προβάλλεται.",
						"Διαμορφώστε επιλογές εξοικονόμησης ενέργειας.",
						"Ρυθμίζει τη γεωμετρία της οθόνης όταν συνδέεται σε συσκευή υπολογιστή.                                              ",
						"Επιλέξτε περισσότερες ρυθμίσεις εικόνας για προχωρημένους.",
						"Επαναφέρετε όλες τις ρυθμίσεις εικόνας στις προεπιλογές.",
						"Επιλέξτε μια λειτουργία ήχου που ανταποκρίνεται στην προσωπική σας προτίμηση.",
						"Προσαρμόστε την εξισορρόπηση έντασης μεταξύ αριστερού και δεξιού καναλιού.",
						"Το σύστημα ήχου TruSurround HD προσφέρει πλούσιο ήχο και διαύγεια σε χαμηλές και υψηλές συχνότητες.",
						"Ψηφιακή διεπαφή για τη σύνδεση της εξόδου του ψηφιακού ήχου της τηλεόρασης στον εξοπλισμό του συστήματος οικιακού κινηματογράφου. ",
						"Επιλέξτε τη γλώσσα ήχου που ανταποκρίνεται στην προσωπική σας προτίμηση.",
						"Ενεργοποίησης λειτουργίας για άτομα με προβληματική όραση, για να μπορούν να απολαύσουν τηλεοπτικό πρόγραμμα.",
						"Ελέγξτε την εικόνα της τηλεόρασης, τον ήχο και το σήμα.",
						"Επιλέξτε τον τύπο λίστας καναλιών που ανταποκρίνεται στο τηλεοπτικό σας σήμα.",
						"Επιλογή γλώσσας υποτίτλων που εμφανίζονται στο κάτω μέρος της οθόνης.",
						"Προβολή κειμένου και εικόνων τρέχοντος καναλιού.",
						"Digital Living Network Alliance. Απολαύστε μουσική, φωτογραφίες και βίντεο μέσω του οικιακού δικτύου από άλλες συσκευές , όπως έναν υπολογιστή.",
						"Προβάλετε το περιεχόμενο από το smartphone σας στην τηλεόραση και χρησιμοποιήστε το smartphone ως τηλεχειριστήριο για την τηλεόραση.",
						"Απολαύστε περιεχόμενο από συσκευή Android συμβατή με Miracast στην οθόνη της τηλεόρασης.",
						"Εφαρμόστε ένα κλείδωμα στην τηλεόρασή σας.",
						"Επιλέξτε ένα όνομα για τη συσκευή σας.",
						"Επιλέξτε το περιβάλλον παρακολούθησης.",
						"Επαναφέρετε όλες τις Ρυθμίσεις Συστήματος στις προεπιλογές."];
var initialTitle	= ["Καλώς ήρθατε","Αρχική εγκατάσταση"];
var initialPrompt	= ["Ολοκληρώστε την Αρχική Διαμόρφωση. Σας περιμένει ένας κόσμος συναρπαστικών περιπετειών!",
						"Επιλέξτε τη γλώσσα σας:",
						"Επιλέξτε τη χώρα σας:",
						"Επιλέξτε την τοποθεσία σας:",
						"Επιλέξτε τον τύπο σύνδεσης του δικτύου:",
						"Επιλέξτε λειτουργία σύνδεσης ενσύρματου δικτύου:",
						"Η σύνδεση στο xxxxxxxxx απέτυχε! Συνδέστε τη συσκευή σύμφωνα με το παρακάτω διάγραμμα ή επιλέξτε Left (Αριστερά) για επαναφορά.",
						"Συνδέθηκε στο xxxxxxxxx! Επιλέξτε Right (Δεξιά) για να συνεχίσετε. ",
						"1)Η τηλεόρασή σας μπορεί να διαθέτει ήδη ένα ενσωματωμένο ασύρματο προσαρμογέα\n 2)Εάν παρέχεται ασύρματος προσαρμογέας USB , συνδέστε τον στην τηλεόρασή σας.Στη συνέχεια, επιλέξτε τη λειτουργία σύνδεσης σε ασύρματο δίκτυο",
						"Σάρωση. Παρακαλώ περιμένετε...",
						"Δεν υπάρχουν ασύρματες συσκευές συνδεμένες στην TV σας!",
						"Βεβαιωθείτε ότι το παρακάτω PIN έχει εγκατασταθεί στο ΣΠ πριν κάνετε κλικ στην επιλογή «Επόμενο».",
						"Πατήστε το πλήκτρο στο AP εντός 120 δευτερολέπτων πριν πατήσετε Right (δεξιά) !",
						"WPS (Ρύθμιση προστατευμένου Wi-Fi)",
						"PIN(Προσωπικός Αριθμός Αναγνώρισης)",
						"PBC(Διαμόρφωση με πάτημα κουμπιού)",
						"Το παρακάτω περιεχόμενο είναι διαθέσιμο όνο με σύνδεση στο δίκτυο. Θέλετε να παρακάμψετε τη Ρύθμιση Δικτύου;",
						"Υπάρχουν νέες ενημερώσεις λογισμικού για λήψη. Μπορεί να πάρει μερικά λεπτά ανάλογα με την κατάσταση του δικτύου.",
						"Με την ενημέρωση του λογισμικού τηλεόρασης διασφαλίζεται ότι μπορείτε να απολαμβάνετε τις πιο πρόσφατες δυνατότητες και υπηρεσίες.",
						"Δε θα έχετε την ευκαιρία να αξιοποιήσετε τις νέες λειτουργίες και τις υπηρεσίες. Θέλετε σίγουρα να παρακάμψετε την Ενημέρωση λογισμικού;",
						"Πατήστε το δεξί πλήκτρο για να συνεχίσετε.",
						"Μη σβήσετε την τηλεόραση όσο διαρκεί η ενημέρωση. Μπορεί να προκαλέσει βλάβη στην τηλεόραση. ",
						"Εάν δεν θέλετε να κάνετε ενημέρωση, επιλέξτε ΟΧΙ.",
						"Ενημέρωση, παρακαλώ περιμένετε",
						"Μπορείτε επίσης να ενημερώσετε το λογισμικό από το μενού ΣΥΣΤΗΜΑ/ΝΗΜΕΡΩΣΗ ΛΟΓΙΣΜΙΚΟΥ.",
						"Η επιλεγμένη χώρα ζητάει ρύθμιση κωδικού πρόσβασης.\nΡυθμίστε τον κωδικό για την τηλεόρασή σας και επιβεβαιώστε τον.",
						"This code is too simple.\nPlease use different digits.",
						"Συγχαρητήρια. Η διαμόρφωση ολοκληρώθηκε. Μπορείτε να αλλάξετε τη διαμόρφωση από το Κεντρικό μενού και τα αντίστοιχα υπομενού. ",
						"Επιλέξτε τη λειτουργία ασφάλειας:",
						"Επιλέξτε λειτουργία σύνδεσης ασύρματου δικτύου:",
						"Δίκτυο"];
var initNetCabAndDonRe = ["Δεν έχει συνδεθεί καλώδιο δικτύου. Συνδέστε ένα καλώδιο δικτύου!","Δεν παρέχεται ασύρματος προσαρμογέας ή ασύρματος προσαρμογέας USB."];
var initChPrompt = ["Ρύθμιση τηλεοπτικού καναλιού","Επιλέξτε τύπο σάρωσης κεραίας.","Επεξεργασία αυτόματου συντονισμού...","Εντοπίστηκαν τα παρακάτω κανάλια:","Επιλέξτε τύπο σάρωσης για Καλωδιακά.","Επιλέξτε πρόγραμμα από την παρακάτω λίστα.","Διαμορφώστε τις πληροφορίες σάρωσης","Βρέθηκαν τα παρακάτω Καλωδιακά κανάλια:","Επιλέξτε έναν πάροχο υπηρεσίας από την παρακάτω λίστα","Επιλέξτε Δορυφορικά για να σαρώσετε ή να επεξεργαστείτε τα επιλεγμένα δορυφορικά κανάλια","Ρυθμίστε τις παραμέτρους των δορυφορικών καναλιών","Εντοπίστηκαν τα παρακάτω κανάλια. Μπορείτε να εκτελέσετε σάρωση ξανά από το μενού Κανάλι/Σάρωση καναλιών. "];
var initClockPrompt = ["Ρύθμιση ώρας από το δίκτυο!",
						"Ρυθμίστε την ώρα και την ημερομηνία:"];
var initialOptions	= ["Περιβάλλον","Ρύθμιση δικτύου","Ενημέρωση Λογισμ.","Εγκατάσταση καναλιών","Ρολόι"];
var initialHotkeys	= ["Επιστροφή","Επιλογή","Επόμενο"];
var initLocations	= ["Σπίτι","Κατάστημα","Επίδειξη λειτουργίας καταστήματος"];
var initNets		= ["Ενσύρματα","Ασύρματη","Δεν έχω σύνδεση δικτύου"];
var initWireManuals	= ["Διεύθυνση IP","Μάσκα υποδικτύου","Προεπιλεγμένη πύλη","Πρωτεύων DNS","Δευτερεύων DNS"];
var initSoftUpdates = ["Ενημέρωση τώρα","Ενημέρωση αργότερα"];
var initChannelIns	= ["Συνέχεια","Δεν θέλω να ρυθμίσω κανάλια "];
var initChScanTypes	= ["Ψηφιακά & Αναλογικό","Ψηφιακά","Αναλογικά","Δεν επιθυμώ να εκτελέσω σάρωση"];
var initChDvbts		= ["Κανάλια Antenna ATV:","Κανάλι Antenna DTV:"];
var initChDvbcs		= ["Καλωδιακά αναλογικά τηλεοπτικά κανάλια:","Καλωδιακά ψηφιακά τηλεοπτικά κανάλια:"];
var initChDvbss		= ["Δορυφορικά κανάλια:"];
var initChDvbSOther	= ["Δεν επιθυμώ να εκτελέσω σάρωση για δορυφορικά"];
var initEndConnectedStatus= ["Αποσυνδέθηκε","Συνδέθηκε σε WiFi  ","Συνδέθηκε ασύρματα"];
var initEndInstallations= "Ρυθμίστηκαν κανάλια XXXX ";
var initEndUpdate	= ["Έγινε ενημέρωση"];

var audioScenes 	= ["Επιφάνεια εργασίας","Επιτοίχια στήριξη"];			
var screenSavers	= ["Δεν υπάρχουν πληροφορίες προγράμματος. Επιλέξτε κανάλια πρώτα!",
						"Δεν υπάρχει σήμα!",
						"Κωδικοποιημένο",
						"Μόνο δεδομένα",
						"Ηχητικό πρόγραμμα",
						"Δεν υπάρχει ούτε ήχος ούτε εικόνα",
						"Μη διαθέσιμη",
						"Χωρίς teletext",
						"Δεν υπάρχουν δεδομένα προγράμματος.",
						"Το πρόγραμμα είναι κλειδωμένο!",
						"Το πρόγραμμα είναι κλειδωμένο!\nΠιέστε ΟΚ και εισάγετε τον κωδικό σας.",
						"Δεν υπάρχουν λεπτομέρειες για το πρόγραμμα.",
						"Το πρόγραμμα είναι ακατάλληλο για ανηλίκους.\nΠατήστε OK και πληκτρολογήστε τον κωδικό σας.",
						"Το κανάλι είναι κλειδωμένο!",
						"Κλειδωμένο Κανάλι!\nΠιέστε OK και εισάγετε τον κωδικό σας.",
						"Είσοδος Κλειδωμένη!\nΠιέστε ΟΚ και εισάγετε τον κωδικό σας.",
						"Δεν υποστηρίζεται!",
						"Η υπηρεσία αυτή δεν είναι διαθέσιμη αυτή τη στιγμή",
						"Κλειδ είσοδος!",
						"Δεν υπάρχει τίτλος προγράμματος.",
						"Χωρίς Λειτουργία"
						];
var chBookingPromt	= ["Έχει προγραμματιστεί να γίνει εγγραφή από το συγκεκριμένο κανάλι. Η τηλεόραση  θα ξεκινήσει να κάνει εγγραφή. ",
						"Βρέθηκε μια προγραμματισμένη εγγραφή.\n Μεταβείτε στο XXXX για να πραγματοποιήσετε εγγραφή",
						"Το τρέχον κανάλι έχει μια υπενθύμιση.",
						"Βρέθηκε μια προγραμματισμένη υπενθύμιση.\n Μεταβείτε στο XXXX"];
var timeUnit		= ["δευτ.","ελάχ"];
var ciPromt			= ["Οι ρυθμίσεις του δικτύου έχουν αλλάξει. Για να κάνετε ενημέρωση, εκτελέστε σάρωση ξανά. ",];
var othersPromt		= ["Περιμένετε...",];
var menuOptions		= ["Εικόνα","Ήχος","Kανάλι","Δίκτυο","Σύστημα"];
var optionOptions	= ["Λειτουργία εικόνας","Επαναφορά ηχητ. Ρυθμίσεων","Πάγωμα","T-Link","χρον. μετατόπιση","PVR","Λίστα προγράμματος","Pυθμίσεις"];
var optionTLinkPromt= [["Αυτόματη ενεργοποίηση","Αυτόματη αναμονή","Μενού οδηγού"],
						["Ενεργοποίηση","Αναμονή","Τόμος Ενισχυτή"]];
var powerPromt		= ["Η τηλεόραση θα απενεργοποιηθεί σύντομα! Πατήστε οποιοδήποτε πλήκτρο για ακύρωση."];
var ttxLanguage		= ["ΔΥΤ. ΕΥΡ.","ΑΝΑΤ. ΕΥΡ.","Ρώσικα","Αραβικά/Εβραϊκά","Περσικά","Αραβικά ","bělorusky","Ελληνικά","Τούρκικα"];
var ttxOptions		= ["Εμφάνιση","Κυκλική κίνηση Υποσελίδων","Γλώσσα","Ξυπνητήρι","Σύντομα Νέα"];
var weekday         = ["Κυριακή","Δευτέρα","Τρίτη","Τετάρτη","Πέμπτη","Παρασκευή","Σάββατο"];
var lcnConfflict	= "Προβληματική λήψη προγράμματος. Υπάρχει άλλη έκδοση διαθέσιμη στο κανάλι %d";
var inShopMode		= "Η τηλεόρασή σας είναι στη λειτουργία Αγορών. Για να επιστρέψετε την Κεντρική λειτουργία, επιλέξτε ‘Σύστημα’ και αλλάξτε ‘Τοποθεσία’ από το μενού. ";
var nitRefresh		= "Τα στοιχεία του δικτύου άλλαξαν. Να γίνει ενημέρωση σάρωσης;";
var picHDMIMode     = ["Αυτόματος","γραφικών","Εικόνα"];

var glassRemind    	= ["Συνδέστε τα γυαλιά σας 3D με την τηλεόραση\n(Πατήστε το κουμπί της τροφοδοσίας στα γυαλιά 3D).","Τα γυαλιά σας 3D έχουν συνδεθεί με την τηλεόραση",""];
var pvrRemind 		= ["Μην αποσυνδέετε τη συσκευή USB και μην το βγάλετε από την πρίζα"];
var pvrConName   	= ["PVR","Πληροφορίες προγράμματος:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Εγγραφέν βίντεο αποθηκεύθηκε στον \"PVR\" φάκελο."],"Παύση","Εγγραφή","ώρα","Λεπτό","Διάρκεια","Συμβουλές","Χρησιμοποιήστε τα βελάκια για να ρυθμίσετε τη διάρκεια της εγγραφής."];
var pvrDisRemind 	= "Συνδέστε USB stick για εγγραφή.";
var pvrRemindWords  = ["Θέλετε να βγείτε από το πρόγραμμα;",
							"Θέλετε να σταματήσετε την εγγραφή και να εξερευνήσετε τα αρχεία που έχουν εγγραφεί;",
							"Έχει γίνει εξαγωγή του δίσκου.",
							"Δεν υπάρχει αρκετός ελεύθερος χώρος.",
							"Δεν υπάρχουν εγγραφές. Ξεκινήστε εγγραφή. ",
							"Η λειτουργία PVR δεν ξεκινά σε κρυπτογρ κανάλι",
							"Λειτουργία μη διαθέσιμη",
							"Αποθηκεύθηκε Επιτυχώς.",
							"Να διακοπεί η διαδικασία εγγραφής και να αλλάξετε πηγή εισόδου;",
							"Η εγγραφή του τηλεοπτικού προγράμματος θα σταματήσει. Θέλετε σίγουρα να βγείτε από το πρόγραμμα;",
							"Η εγγραφή PVR λειτουργεί μόνο με καλό τηλεοπτικό σήμα. Ελέγξτε τη δύναμη του σήματος."];
var pvrChangeCh 	= ["Θέλετε να αλλάξετε κανάλι;",
							"Θέλετε να διακόψετε τη διαδικασία εγγραφής και να αλλάξετε κανάλι;"];
var pvrChangeToPIN8	= ["Θέλετε να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή SCART;",
				    		"Θέλετε να διακόψετε την εγγραφή και να αλλάξετε την πηγή εισόδου στην υποδοχή SCART;"];
var pvrChangeToCEC  = ["Θέλετε να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή HDMI;",
				  			 "Θέλετε να διακόψετε την εγγραφή και να αλλάξετε την πηγή εισόδου στην υποδοχή HDMI;"];
var pvrGuideJump    = ["Θέλετε να μπείτε στη λειτουργία EPG;",
							"Να διακοπεί η διαδικασία εγγραφής και να μπείτε στο EPG;"];
var pvrMediaJump    = ["Θέλετε να μπείτε στη λειτουργία Media;",
							"Να διακοπεί η διαδικασία εγγραφής και να μπείτε στο Media;"];
var timeshiftExtra	= ["Θέλετε παύση αλλαγής ώρας,αλλαγή καναλιού;",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή SCART;",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να αλλάξετε την πηγή εισόδου στη συσκευή που είναι συνδεδεμένη στην υποδοχή HDMI;",
						"Η λειτ μετατόπισης χρον δεν ξεκινά σε κρυπτ κανάλι",
						"Θέλετε να σταματήσετε τον προγραμματισμό, και να μπείτε στη λειτουργία EPG;",
						"Θέλετε παύση αλλαγής ώρας, και αλλαγή από τύπο τηλεόρασης σε USB;",
						"Θέλετε παύση αλλαγής ώρας,αλλαγή πηγής τροφοδοσίας;",
						"Συνδέστε USB stick για εγγραφή.",
						"Το μέγεθος του δίσκου δεν είναι αρκετό.",
						"Ο προγραμματισμός της τηλεόρασης θα σταματήσει. Θέλετε να βγείτε από το πρόγραμμα;"];
var timeshiftStatus	= ["Γρήγορη κίνηση προς τα πίσω","Παύση","παίζω","Παύση  ","Γρήγορη κίνηση μπροστά"];
var pvrPowerOffRemind= ["Αναμονή για εγγραφή","Αναμονή","Η τηλεόραση κάνει εγγραφή τηλεοπτικού προγράμματος. Θέλετε να συνεχίσει να γίνεται εγγραφή όταν η τηλεόραση είναι σε κατάσταση αναμονής;"];
var timeshiftInitTitle= "Εγκατάσταση Δίσκου";
var timeshiftInitReminds= ["Χρήση αυτού του οδηγού για εγκατάσταση δίσκου USB για αλλαγή ώρας. Επιλέξτε τύπο εγκατάστασης.",
						 "Για καλύτερη απόδοση, συνιστούμε να διαμορφώσετε το USB δίσκο. Θα διαγράψει όλα τα δεδομένα.",
						 "Επιλέξτε το μέγεθος αρχείου για αλλαγή ώρας.",
						 "Μορφοποίηση",
						 "Δεν υπάρχει αρκετός ελεύθερος χώρος.",
						 "Δημιουργία αρχείου αλλαγής ώρας",
						 "Δοκιμή ταχύτητας",
						 "Η ταχύτητα δίσκου είναι πολύ αργή (<%f MB/sec) για ενεργοποίηση λειτουργίας αλλαγής ώρας!",
						 "Ο δίσκος είναι έτοιμος για αλλαγή ώρας. Αλλά προτείνουμε να αλλάξετε δίσκο (ταχύτητας>%f MB/sec) για καλύτερη απόδοση.",
						 "Ο δίσκος είναι έτοιμος για αλλαγή ώρας. "];
var timeshiftInitButtons= ["Μορφή","Προσπέραση","Ακύρωση","ΟΚ","Τέλος","Έξοδος"];
var timeshiftInitOther=["Ταχύτ. Δίσκου:","MB/sec"];

var selectChoice	= "Είστε σίγουρος;";
var chAtvStore		= "Αποθήκευση ως XXXX";
var chEpgFirstGenreUK= ["Κινηματογράφος","Νέα και Ειδήσεις","ΨΥΧΑΓΩΓΙΚΑ","Αθλητικά","Παιδικά","Εκπαίδευση","Κοινωνικά","Δράμα"];
var homePageTitleList = ["ΕΦΑΡΜΟΓΕΣ","TV","ΒΙΝΤΕΟ","Αρχική σελίδα"];
var homePageFavAndAllName  = ["Αγαπημένες εφαρμογές","Όλες οι εφαρμογές"];
var homePageBackUp = ["Ηλεκ. Εγχειρίδιο","Λειτουργία GuideOn"];
var homePageRemind   = ["Η πλήρης λειτουργικότητα θα είναι διαθέσιμη μετά τη σύνδεση στο δίκτυο","Η τηλεόρασή σας δεν έχει αποθηκευμένα κανάλια. Τα προγράμματα θα είναι διαθέσιμα μετά την σάρωση των καναλιών. ","Κανένα πρόγραμμα","Να γίνει αναζήτηση καναλιών τώρα;"];
var homePageHistory = ["Ιστορικό"];
var miracastTitle = ["Σύνδεση WiFi TV  ","Συσκευή TCL  "];
var miracastRemind=["Το Σύνδεση WiFi TV σας επιτρέπει να μοιράζεστε ασύρματα την οθόνη και τον ήχο της συσκευής σας, όπως ένα smartphone ή tablet, με την τηλεόρασή σας (δηλ. χωρίς καλώδια). Αυτό καθιστά εφικτό να προβάλλετε στην τηλεόρασή σας, ταυτόχρονα, ό,τι εμφανίζεται στο smartphone ή το tablet. Για παράδειγμα, μπορείτε να ξεκινήσετε ένα βίντεο στο smartphone και να το εμφανίσετε ταυτόχρονα στην τηλεόρασή σας ή να χρησιμοποιήσετε το tablet ως χειριστήριο παιχνιδιού, προβάλλοντας περιεχόμενο στη μεγάλη οθόνη της τηλεόρασή σας.","Η ασύρματη σύνδεση τηλεόρασης στην τηλεοπτική συσκευή είναι έτοιμη. Ξεκινήστε την κοινή χρήση της οθόνης της συσκευής σας με την τηλεόραση τώρα.","Σύνδεση. Παρακαλώ περιμένετε!","Αποτυχία σύνδεσης!","Η σύνδεση απέτυχε. Ελέγξτε ξανά!"];
var homePageLittleWin = ["Pυθμίσεις","Πολυμέσα","Αγαπ. Κανάλια","Smart TV","EPG"];

var hbbtvStopRemind  = ["Θέλετε να  σταματήσετε την αναπαραγωγή;"];
var colorSystem = ["Αυτόματος","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "Πατήστε ΕΠΙΛΟΓΗ για περισσότερες πληροφορίες. ";
var emptyListInfo = "Καμία συνδεδεμένη συσκευή στην τηλεόραση !";
var optionVideoListArray_1 = ["Λειτουργία εικόνας", "Επαναφορά ηχητ. Ρυθμίσεων", "Κατάσταση αναπαραγωγής", "Λειτουργία οθόνης", "Λειτουργία 3D", 
							  "Διακόπτης Α-Δ", "Βάθος πεδίου", "Υπότιτλοι", "Μουσική υπόκρουση", "Τίτλος", "Κεφάλαιο", "Πληροφορίες"];
var optionVideoListArray_2 = ["Λειτουργία εικόνας", "Επαναφορά ηχητ. Ρυθμίσεων", "Κατάσταση αναπαραγωγής", "Λειτουργία οθόνης", 
							  "Υπότιτλοι", "Μουσική υπόκρουση", "Τίτλος", "Κεφάλαιο", "Πληροφορίες"];
var bottomTipsText = ["Αναπαρ/Παύση", "Γρήγορη κίνηση προς τα πίσω", "Γρήγορη κίνηση μπροστά", "Λίστα αναπαραγωγής", "Pυθμίσεις"];
var picturePresetArray = ["Πρότυπο", "Dynamic", "Φυσική", "Κινηματογράφος", "Προσωπική"];
var videoPlayModeArray = ["Επανάληψη όλων", "Επανάληψη ενός", "Κανονικά"];
var screenModeHDArray = ["16:9", "4:3", "Cinerama", "Laaja zoomaus", "Zoomaus 2", "Laaja zoomaus 2", "Kapea zoomaus", "Αυτόματο"];
var screenModeSDArray = ["16:9", "4:3", "Cinerama", "14:9-Zoomaus", "16:9-Zoomaus  ", "16:9-Zoomaus ylös", "Αυτόματο"];
var Mode3DArray = ["Εκτός Λειτουρ.", "2D σε 3D", "Σε παράθεση", "Μισό πάνω-Μισό κάτω", "Εναλλαγή γραμμών"];
var videoOptionListArray = ["Εκτός Λειτουρ.", "Κομμάτι", "Υπότιτλοι", "Τίτλος", "Κεφάλαιο"];
var subMenuTitleText = "Υπότιτλοι";
var langMenuTitleText = "Γλώσσα ήχου";
var titleMenuTitleText = "Τίτλος";
var mode3DMenuTitleText = "Λειτουργία 3D";
var langInfoText = "Κομμάτι";
var STOP_RESUME_INFO = "Διακοπ-Συνέχιση";
var playListName = "όνομα  ";
var eb_tips = "Συμβουλές";
var ok_button = "ΟΚ";
var eb_info = ["Σφάλμα κωδικοποίησης ήχου.", "Σφάλμα κωδικοποίησης βίντεο. ", "Το αρχείο ήχου δεν υποστηρίζεται. ", 
			   "Μορφή βίντεο δεν υποστηρίζονται.", "Δε μπορεί να ανοίξει αυτό το αρχείο.", "Σφάλμα αναπαραγωγής. Δοκιμάστε ξανά.",
			   "Η μορφή του αρχείου δεν υποστηρίζεται.", "Ωχ! Η μονάδα αναπαραγωγής σταμάτησε να λειτουργεί. ",
			   "Η διαδρομή του αρχείου δεν υπάρχει ή δεν είναι έγκυρη.\n Τοποθετήστε ξανά το αποθηκευτικό μέσο και δοκιμάστε ξανά.",
			   "Συνέχεια αναπαραγωγής από την προηγούμενη\n κατάσταση αναπαραγωγής;"];
var frameTitleText = "Νέα συσκευή";
var eb_quit_info = "Είστε βέβαιοι ότι θέλετε να κλείσετε το πρόγραμμα;";
var eb_yes = "ΝΑΙ";
var eb_no = "ΟΧΙ";
var offinfo = "Εκτός Λειτουρ.";
var naInfo = "Κενό";
var consoleInfoArray = ["Γρήγορη κίνηση προς τα πίσω", "Γρήγορη κίνηση μπροστά", "Αναπαρ/Παύση", "Λίστα αναπαραγωγής"];
var cantOperateText = ["Η λειτουργία δεν υποστηρίζεται."];
var chapterChangeInfo = "Μόνο οι ενότητες από το 1 έως το XXXX είναι διαθέσιμες.";
var metaDataArray = ["Μεταδεδομένα Τίτλου/΄Εκδοσης: ", "Μεταδεδομένα ενότητας: ", "Μεταδεδομένα ήχου: ", "Μεταδεδομένα υποτίτλων: "];
var metaTitleInfo = "Τίτλος";
var metaChapterInfo = "Κεφάλαιο";
var videoLoadingInfo = "Ανάλυση...";
var listLoadingInfo = "Φόρτωση...";
var pgInfo = "Καταλληλότητα περιεχομένου: ";
var fileNameText = "όνομα  ";
var fileDateText = "Ημερομηνία";
var fileSizeText = "Μέγεθος";
var fileDurationText = "Διάρκεια";
var fileDirectorText = "Σκηνοθέτης";
var fileCopyrightText = "Πνευμ. Δικαιώματα";
var fileArtistText = "Καλλιτέχνης";
var fileAlbumText = "Άλμπουμ";
var fileGenreText = "Είδος";
var fileYearText = "Έτος";
var fileGenreText = "Είδος";
var mainListArray = ["Όλα", "Εικόνα", "Εικόνα", "Μουσική"];
var sortArray = ["όνομα  ", "Ημερομηνία"];
var parserArray = ["Κανονικά", "Αναδρομικά"];
var emptyTipsInfo = "Ωχ. Δε βρέθηκε υποστηριζόμενο αρχείο. ";
var emptyFolderInfo = "Ωχ. Δε βρέθηκε υποστηριζόμενο αρχείο. ";
var sortName = "Ταξινόμηση κατά";
var parserName = "Αναλυτής";
var divx_str1 = "Εγγραφή σε DivX(R)";
var divx_str2 = "Απενεργοποίηση DivX(R)";
var infor_str = "Πληροφορίες";
var quickMenuEmptyText = "Δεν υπάρχουν διαθέσιμες επιλογές.";

var musicSoundPresetArray = ["Πρότυπο", "Κινηματογράφος", "Μουσική", "Καθαρισμός φωνής", "Προσωπική"];
var musicInformationArray = ["όνομα  ", "Καλλιτέχνης", "Άλμπουμ", "Είδος:", "Έτος:", "Διάρκεια:"];
var playListName = "όνομα  ";
var playTipsInfo = ["Αναπαράγετε το πρώτο αρχείο.", "Αναπαράγετε το τελευταίο αρχείο."]
var musicNameInfo = "Name";
var musicArtistInfo = "Καλλιτέχνης";
var musicAlbumInfo = "Πληροφορίες";
var optionSoundPresetInfo = "Επαναφορά ηχητ. Ρυθμίσεων";
var optionBGMInfo = "Αναπαραγωγή στο παρασκήνιο";
var optionAudioOnlyInfo = "Μόνο ήχος";
var optionInfoText = "Πληροφορίες";

var remotePhoneConnecte = "Η συσκευή XXXX συνδέθηκε στην τηλεόραση!";
var tvRemoteTitle		= "Τηλεχειριστήριο";
var tvRemoteDeveloper	= "Η εφαρμογή αναπτύχθηκε από την TCL";
var tvRemoteDeviceTitle	= "Όνομα συσκευής:";
var remoteOption		= ["Κοινή χρήση πολυμέσων","Τηλεχειριστήριο","Βοήθεια","Σχετικά με","Έξυπνη σύνδεση"];
var remotebottom		= "Κατεβάστε την εφαρμογή \"TCL nScreen\" στο smartphone σας";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Μπορείτε να προβάλετε φωτογραφίες, βίντεο και μουσική στην τηλεόραση από το τηλέφωνό σας.",
							"Βήματα: \n   1. Ξεκινήστε την εφαρμογή \"TCL nScreen\" στο τηλέφωνο. Συνδέστε το τηλέφωνό σας με την τηλεόραση στο ίδιο δίκτυο WiFi.\n   2. Ξεκινήστε την εφαρμογή \"Media Sharing\" για να εξερευνήσετε τα αρχεία πολυμέσων.\n   3. Στείλτε τα αρχεία πολυμέσων στην τηλεόραση για αναπαραγωγή (με μία από τις παρακάτω επιλογές)",
							"      α) Σύρετε το φάκελο/αρχείο στο εικον TV στο πάνω μέρος της οθόν.\n      β) Κουν το τηλ προς την TV για να ανοίξει το 1ο αρχ.\n      γ) Αναπ αρχ μέσων σε τηλ & πατήστε εικ κοιν χρήσης με TV.",
							"   4. Κατά την αναπ από TV, κουν το τηλ για μετάβ σε προηγ ή επόμ αρχείο."];
var controlReminds		= ["Χρήση του τηλεφώνου ως τηλεχειριστήριο για το χειρισμό της τηλεόρασης.",
							" ",
							"Βήματα: \n   1. Ξεκινήστε την εφαρμογή \"TCL nScreen\" στο τηλέφωνο. Συνδέστε το τηλέφωνό σας με την τηλεόραση στο ίδιο δίκτυο WiFi.\n   2. Πατήστε \"Remote Control\" για να λειτουργήσετε την τηλεόραση. "];
var helpDeviceWords		= "Αλληλεπίδραση πολλών οθονών";
var helpBottom			= "Στην εποχή της τεχνολογίας cloud οι έξυπνες συσκευές, όπως π.χ. τα τηλέφωνα και οι τηλεοράσεις, συνδέονται μεταξύ τους. Μοιραστείτε τα περιεχόμενα πολυμέσων σας με την οικογένειά σας σε περισσότερες οθόνες και χειριστείτε την τηλεόραση από το τηλέφωνό σας! ";
var helpReminds			= ["Προετοιμασία\n   1. Κατεβάστε και εγκαταστήστε την εφαρμογή \"TCL nScreen\" από το Google Play ή το Apple Store.\n   2. Συνδέστε το τηλέφωνό σας στην τηλεόραση από το ίδιο δίκτυο WiFi.",
							" ",
							"Συνιστώμενα τηλέφωνα\n   1. CPU: πάνω από 800MHz\n   2. Μνήμη: τουλάχιστον 80MB ελεύθερος χώρος",
							" ",
							"Αποποίηση ευθυνών\n Εάν η εφαρμογή \"TCL nScreen\" δεν είναι διαθέσιμη στο τηλέφωνό σας , επικοινωνήστε με τον κατασκευαστή του τηλεφώνου."];
var helpButtons			= ["Προηγούμεν","Επόμενο"];
var aboutReminds		= ["Τηλεχειριστήριο","Η εφαρμογή αναπτύχθηκε από την TCL"];
var aboutExit			= "Έξοδος";
var smartReminds		= ["Γρήγορη και έξυπνη σύνδεση ανάμεσα στην τηλεόραση και το τηλέφωνο.",
							" ",
							"Βήματα \n   1. Συνδέστε την τηλεόραση και το smartphone στο ίδιο δίκτυο. Πατήστε \"TCL nScreen\" στο smartphone.\n   2. Πατήστε \"Smart Connect\" για να σαρώσετε κωδικό QR.\n   3. Με την τηλεόραση να βρίσκεται στη λειτουργία προβολής, πατήστε το πλήκτρο INFO στο τηλεχειριστήριο της τηλεόρασης για 4 δευτερόλεπτα. Θα εμφανιστεί ο κωδικός QR σε πλήρη οθόνη. ",];
var smartQRReminds		= ["Πατήστε την επιλογή Smart Connect στο τηλεχειριστήριο της τηλεόρασης στο τηλέφωνό σας και σαρώστε τον κωδικό QR για να συνδέσετε την τηλεόραση και το τηλέφωνο γρήγορα.",
							"Ο κωδικός QR περιέχει τις πληροφορίες του λογαριασμού LAN. Διατηρήστε τον σε καλή κατάσταση. "];
							

var consoleTipArray = ["Προηγούμεν","Επόμενο","Κονσόλα","Λίστα αναπαραγωγής"];							
var optionInfoArray = ["Λειτουργία εικόνας","Κατάσταση αναπαραγωγής","Διάρκεια","Εφέ","Πληροφορίες"];

var playModeArray = ["Κανονικά","Ανακάτεμα","Επανάληψη"];
var durationArray = ["Μικρό (5 δευτ.)", "Μεσαίο (10 δευτ.)", "Μεγάλο (15 δευτ.)"];
var effectArray = ["Κανένα", "Διάλυση", "Σκούπα Δεξιά", "Σκούπα Αριστερά", "Σκούπα πάνω", "Σκούπα κάτω", "Κουτί μέσα", "Κουτί έξω", "Τυχαία"];
var infoArray = ["Όνομα:","Μέγεθος:","Ημερομηνία:","Τοποθεσία"];

var picturePresetBarTitleInfo = "Λειτουργία εικόνας";
var picturePresetBarArray = ["Πρότυπο","Dynamic","Σινεμά","Κινηματογράφος","Προσωπική"];
var upTipsInfo = "Μετακίνηση εικόνας"; //add yums 2014-10-10
var consoleTipsArray = ["Κονσόλα","Προηγούμεν","Επόμενο","Λίστα αναπαραγωγής","Pυθμίσεις"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Πατήστε το βελάκι προς τα ΔΕΞΙΑ ξανά για αναπαραγωγή της επόμενης εικόνας ","Πατήστε το βελάκι προς τα ΑΡΙΣΤΕΡΑ ξανά για αναπαραγωγή της προηγούμενης εικόνας ","Πατήστε το βελάκι ΚΑΤΩ ξανά για να εμφανίσετε τη λίστα αναπαραγωγής"]; //add yums 2014-10-10

var optionPvrListArray = ["Λειτουργία εικόνας","Επαναφορά ηχητ. Ρυθμίσεων", "Λειτουργία οθόνης", "Λειτουργία 3D", "Υπότιτλοι", "Μουσική υπόκρουση", "Πληροφορίες"];							
	
var titleSpanFirstArray = ["Έλεγχος & σύνδεση","Βασικές λειτουργίες","ΕΦΑΡΜΟΓΕΣ","TV","Pυθμίσεις","Συχνά ρωτήσω ερώτηση"];
var titleSpanSecondArray = [["Τηλεχειριστήριο","Πλήκτρα πίνακα ελέγχου","Εύκολη Πλοήγηση","Σύνδεση τηλεόρασης","Σύνδεση τηλεόρασης","Σύνδεση τηλεόρασης","Ασύρματη"],["Εκκίνηση","Γραμμή κατάστασης","Πηγή"],["Αναπαραγωγή εφαρμογών","Πολυμέσα","Τηλεχειριστήριο"],["Ρύθμιση καναλιού και έντασης ήχου ","Λίστα καναλιών","EPG","Κανάλια εγκατ.","Αγαπημένα κανάλια"],["Ρύθμιση εικόνας","Ρύθμιση ήχου","Ρύθμιση καναλιών","Ενημέρωση Λογισμ.","Γλώσσα","Κλείδωμα από τους γονείς"],["Συχνές Ερωτήσεις","Συχνές Ερωτήσεις","Αντιμετώπιση προβλημάτων","Αντιμετώπιση προβλημάτων","Όροι και προϋποθέσεις"]];
var contentSpan1_1Array = [["ΛΙΣΤΑ:","ΠΛΗΡΟΦΟΡΙΕΣ:","ΜΕΝΟΥ:","ΙΣΧΥΣ:","ΠΗΓΗ:","ΟΔΗΓΟΣ:","SMART TV:"],["Εμφανίζει τη λίστα με τα κανάλια","Εμφανίζει πληροφορίες προγράμματος","Μετάβαση στην αρχική σελίδα","Βάζε σε λειτουργία ή σε κατάσταση αναμονής τη συσκευή","Επιλέγει πηγή εισόδου","Εμφανίζει τις πληροφορίες EPG (Ηλεκτρονικός Οδηγός Προγράμματος)","Μετάβαση στη σελίδα Smart TV"]];
var contentSpan1_2Array = ["Προηγούμενο κανάλι","Επόμενο κανάλι","Αύξηση έντασης ήχου","Μείωση έντασης ήχου","Μετάβαση στην αρχική σελίδα","Επιβεβαίωση επιλογής","Αναμονή/Ενεργοποίηση"];
var contentSpan1_3Array = ["OK/Οδηγός","Επόμενο κανάλι","Προηγούμενο κανάλι","Μείωση έντασης ήχου","Αύξηση έντασης ήχου","Διαθέσιμα με τα βελάκια σε ορισμένες λειτουργίες."];
var contentSpan1_4Array = ["LAN","HDMI ( MHL )","HDMI","HDMI ( ARC )","Προσαρμογέας AV OUT  ","LAN","Smartphone","Υπολογιστής/ Αποκωδικοποιητής/ DVD","Ενισχυτής ήχου","Ενισχυτής ήχου/Οθόνη","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_5Array = ["USB 2.0","USB 3.0","Ακουστικά","Προσαρμογέας AV IN  ","SPDIF","Προσαρμογέας CMP AUDIO IN  ","Προσαρμογέας CMP IN (YPbPr)  ","Συσκευές USB  ","Συσκευές USB  ","Ακουστικά","DVC/Κονσόλα παιχνιδιών/ Αποκωδικοποιητής/DVD","Ενισχυτής ήχου","DVC/Κονσόλα παιχνιδιών/ Αποκωδικοποιητής/DVD","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_6Array = ["Κοινή διεπαφή","SD","VGA","SCART","Mini SCART","ANTENNA IN","PCMCIA Card","SD Card","PC","Set-top box/DVD","Κεραία/Καλώδιο/Δορυφόρος","Η τηλεόρασή σας μπορεί να μη διαθέτει όλες τις υποδοχές."];
var contentSpan1_7Array = ["Δισκίο","PC","Δρομολογητή","Τηλέφωνο","TV"];

var contentSpan2Array = [["Πατήστε τα βελάκια για να εμφανίσετε την Αρχική Σελίδα.","Στη συνέχεια πατήστε ΟΚ για να παρακολουθήσετε ένα από τα προτεινόμενα προγράμματα ή για να μπείτε στην εφαρμογή. "],["Εμφανίζει την ημερομηνία, το δίκτυο, τις συσκευές, κλπ στην πάνω δεξιά γωνία της οθόνης. "],["Επιλέγει πηγή εισόδου από τις συσκευές που είναι συνδεδεμένες στην τηλεόραση μέσω διαφορετικών θυρών, όπως TV, AV, HDMI, κλπ"]];

var contentSpan3Array = ["Δείτε και απολαύστε τις αγαπημένες σας εφαρμογές από τη σελίδα Smart TV","Δείτε φωτογραφίες, παρακολουθήστε βίντεο και αναπαράγετε μουσική από συσκευή αποθήκευσης USB.","Συνδέστε την τηλεόραση και το smartphone ή το tablet σας στο ίδιο LAN","Κάντε κλικ στο TCL nScreen ή στην εφαρμογή TCL nScreen σε smartphone ή σε tablet","Μοιραστείτε φωτογραφίες, βίντεο και μουσική σε πολλαπλές οθόνες με την οικογένειά  και χειριστείτε την τηλεόραση  από το smartphone σας "];

var contentSpan4Array = [["Πατήστε τα βελάκια ΠΑΝΩ/ΚΑΤΩ για να αλλάξετε κανάλι. ","Πατήστε τα βελάκια ΑΡΙΣΤΕΡΑ/ΔΕΞΙΑ για να ρυθμίσετε την ένταση του ήχου. "],["Πατήστε LIST στο τηλεχειριστήριο για να εμφανίσετε τη λίστα με τα κανάλια. ","Πατήστε τα βελάκια ΠΑΝΩ/ΚΑΤΩ για να επιλέξετε κανάλι"],["Η λειτουργία EPG είναι ένας οδηγός στην οθόνη που εμφανίζει τα προγραμματισμένα τηλεοπτικά προγράμματα. Μπορείτε να εξερευνήσετε, να επιλέξετε, να προβάλετε και κάνετε εγγραφή προγραμμάτων. "],["Αναζήτηση και αποθήκευση καναλιών "],["Προσθέστε ή αλλάξτε τα αγαπημένα σας κανάλια στη Λίστα καναλιών "]];

var contentSpan5Array = ["Απολαύστε τα αγαπημένα σας προγράμματα από την εφαρμογή βίντεο "];

var contentSpan6Array = [["Πατήστε ΜΕΝΟΥ για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στο μενού των ρυθμίσεων εικόνας για να αλλάξετε τις τιμές"],["Πατήστε ΜΕΝΟΥ για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στις Ρυθμίσεις Ήχου για να δείτε τις επιλογές"],["Πατήστε ΜΕΝΟΥ για να εμφανίσετε τις επιλογές ρύθμισης του συστήματος ","Μπείτε στις ρυθμίσεις καναλιών για να ρυθμίσετε τις επιλογές"],["Ενημέρωση της τηλεόρασης όταν υπάρχει διαθέσιμη ενημέρωση λογισμικού"],["Μπορείτε να επιλέξετε την προτιμώμενη γλώσσα μενού"],["Επιτρέπει στους γονείς να κλειδώσουν  κανάλια ή προγράμματα τα οποία είναι ακατάλληλα για τα παιδιά"]];

var contentSpan7_1Array = [["Δεν εμφανίζεται εικόνα, και δεν ακούγεται ήχος","Ελέγξτε εάν δουλεύουν οι ασφάλειες και τα κυκλώματα ","Συνδέστε μια άλλη ηλεκτρική συσκευή στην πρίζα για να εξακριβώσετε εάν έχει ρεύμα ή αν είναι συνδεδεμένη στο ρεύμα ή συσκευή.","Το βύσμα δεν κάνει καλή επαφή με την πρίζα","Ελέγξτε την πηγή σήματος."],["Υπάρχει εικόνα αλλά όχι ήχος","Πατήστε το βελάκι ΠΑΝΩ για να αυξήσετε την ένταση ήχου","Λάθος ρύθμιση ήχου.","Κακό σήμα από το σταθμό μετάδοσης."],["Ακούγεται ήχος, αλλά δεν υπάρχει εικόνα.","Ρύθμιση της φωτεινότητας και της αντίθεσης.","Κακό σήμα από το σταθμό μετάδοσης.","Ελέγξτε ένα έχει ρυθμιστεί στη λειτουργία μόνο ήχου. "]];
var contentSpan7_2Array = [["Παρεμβολή ραδιοσυχνοτήτων","Αυτή η παρεμβολή παράγει κινούμενα κύματα ή διαγώνιες ραβδώσεις, και σε μερικές περιπτώσεις, απώλεια της αντίθεσης στην εικόνα. Βρείτε και αφαιρέστε την εστία ραδιοφωνικών παρεμβολών."],["Δεν εμφανίζεται χρώμα","Διαμόρφωση ρυθμίσεων χρώματος.","Δοκιμάστε άλλο κανάλι. Μπορεί να γίνει λήψη ασπρόμαυρου προγράμματος. "],["Το τηλεχειριστήριο δεν λειτουργεί","Αντικαταστήστε τις μπαταρίες.","Οι μπαταρίες δεν έχουν τοποθετηθεί σωστά. Δεν έχει συνδεθεί το τροφοδοτικό της τηλεόρασης. "]];
var contentSpan7_3Array = [["Το περιεχόμενο της συσκευής USB δεν εμφανίζεται ","Ελέγξτε εάν η συσκευή USB είναι συμβατή με την τηλεόραση.","Ελέγξτε εάν τα αρχεία ήχου και εικόνας υποστηρίζονται από την τηλεόραση. "],["Αναπαραγωγή χωρίς ήχο ","Η ήχος στο βίντεο δεν υποστηρίζεται από την τηλεόραση."],["Τα αρχεία δεν αναπαράγονται σωστά. ","Η μετάδοση δεδομένων του αποθηκευτικού μέσου USB μπορεί να περιορίσει το ρυθμό μετάδοσης στην τηλεόραση. "]];
var contentSpan7_4Array = [["Τι πρέπει να προσέξω; Πότε πρέπει να κάνω ενημέρωση λογισμικού;","Μη διακόπτετε την τροφοδοσία όταν γίνεται ενημέρωση λογισμικού. ","Μη χρησιμοποιείτε το τηλεχειριστήριο όταν κάνετε ενημέρωση λογισμικού. ","Η ενημέρωση λογισμικού μπορεί να διαρκέσει λίγο περισσότερο. "],["Δεν αλλάζει η διεπαφή της τηλεόρασης μετά την ενημέρωση του λογισμικού. ","Σε συγκεκριμένες περιπτώσεις, η ενημέρωση του λογισμικού, εκτός από την ενημέρωση και την προσθήκη λειτουργιών, μπορεί επίσης να βελτιώσει την απόδοση της τηλεόρασης, χωρίς σημαντικές αλλαγές στην επιφάνεια εργασίας. Επίσης, η διεπαφή στην τηλεόραση μπορεί να παγώσει μερικές φορές."]];
var termsTitle = "Όροι και προϋποθέσεις";
var termsConditions = ["(Νομική δήλωση) της TCL - κατασκευαστής αυτής της τηλεόρασης.","Λόγω των διαφορετικών δυνατοτήτων των προϊόντων με υποστήριξη υπηρεσιών SmartTV και των περιορισμών ως προς τα διαθέσιμα περιεχόμενα, ενδέχεται ορισμένα χαρακτηριστικά, εφαρμογές και υπηρεσίες να μην προσφέρονται από όλες τις συσκευές ή σε όλες τις περιοχές. Επίσης, ορισμένα χαρακτηριστικά SmartTV ενδέχεται να προϋποθέτουν τη χρήση πρόσθετων περιφερειακών συσκευών ή την πληρωμή συνδρομής, τα οποία δεν περιλαμβάνονται στην αγορά του προϊόντος. Παρακαλούμε επισκεφτείτε τη διαδικτυακή μας τοποθεσία για περισσότερες πληροφορίες σχετικά με συγκεκριμένες συσκευές και τη διαθεσιμότητα περιεχομένων. Οι υπηρεσίες και η διαθεσιμότητα περιεχομένων SmartTV υπόκεινται σε αλλαγή χωρίς προηγούμενη ειδοποίηση. \n   Το σύνολο του περιεχομένου και των υπηρεσιών που είναι προσβάσιμα μέσω αυτής της συσκευής ανήκουν σε τρίτους κατασκευαστές και προστατεύονται με πνευματικά δικαιώματα (copyright), ευρεσιτεχνίες, εμπορικά σήματα ή/και άλλους νόμους περί πνευματικής ιδιοκτησίας. Αυτά τα περιεχόμενα και οι υπηρεσίες προσφέρονται αποκλειστικά για προσωπική μη εμπορική χρήση. Απαγορεύεται η χρήση οποιουδήποτε περιεχομένου ή οποιασδήποτε υπηρεσίας με τρόπο που δεν έχει εγκριθεί από τον κάτοχο του περιεχομένου ή τον πάροχο της υπηρεσίας. Χωρίς περιορισμό των ανωτέρω και εφόσον δεν επιτρέπεται ρητά από τον εκάστοτε κάτοχο του περιεχομένου ή πάροχο της υπηρεσίας, απαγορεύεται η τροποποίηση, αντιγραφή, επανέκδοση, φόρτωση, δημοσίευση, μετάδοση, μετάφραση, πώληση, δημιουργία παράγωγων έργων, εκμετάλλευση ή διανομή με οποιονδήποτε τρόπο και οποιοδήποτε μέσο των περιεχομένων και υπηρεσιών που προσφέρονται μέσω αυτής της συσκευής. \n   ΑΝΑΓΝΩΡΙΖΕΤΕ ΡΗΤΑ ΚΑΙ ΣΥΜΦΩΝΕΙΤΕ ΟΤΙ Η ΧΡΗΣΗ ΤΗΣ ΣΥΣΚΕΥΗΣ ΓΙΝΕΤΑΙ ΑΠΟΚΛΕΙΣΤΙΚΑ ΥΠ’ ΕΥΘΥΝΗ ΣΑΣ ΚΑΙ ΟΤΙ ΑΝΑΛΑΜΒΑΝΕΤΕ ΤΟ ΣΥΝΟΛΟ ΤΟΥ ΚΙΝΔΥΝΟΥ ΩΣ ΠΡΟΣ ΤΗΝ ΙΚΑΝΟΠΟΙΗΤΙΚΗ ΠΟΙΟΤΗΤΑ, ΑΠΟΔΟΣΗ ΚΑΙ ΑΚΡΙΒΕΙΑ. Η ΣΥΣΚΕΥΗ ΚΑΙ ΟΛΑ ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ ΚΑΙ ΟΙ ΥΠΗΡΕΣΙΕΣ ΤΡΙΤΩΝ ΜΕΡΩΝ ΠΡΟΣΦΕΡΟΝΤΑΙ «ΩΣ ΕΧΟΥΝ», ΧΩΡΙΣ ΚΑΜΙΑ ΕΓΓΥΣΗ, ΡΗΤΗ Ή ΣΙΩΠΗΡΗ. Η TCL ΑΠΟΠΟΙΕΙΤΑΙ ΡΗΤΑ ΟΠΟΙΑΣΔΗΠΟΤΕ ΕΓΓΥΗΣΗΣ ΚΑΙ ΠΡΟΫΠΟΘΕΣΕΩΝ, ΡΗΤΩΝ Ή ΣΙΩΠΗΡΩΝ, ΟΣΟΝ ΑΦΟΡΑ ΤΗ ΣΥΣΚΕΥΗ, ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ ΚΑΙ ΤΙΣ ΥΠΗΡΕΣΙΕΣ, ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΩΝ ΧΩΡΙΣ ΠΕΡΙΟΡΙΣΜΟ ΤΩΝ ΕΓΓΥΗΣΕΩΝ ΕΜΠΟΡΕΥΣΙΜΟΤΗΤΑΣ, ΙΚΑΝΟΠΟΙΗΤΙΚΗΣ ΠΟΙΟΤΗΤΑΣ, ΚΑΤΑΛΛΗΛΟΤΗΤΑΣ ΓΙΑ ΣΥΓΚΕΚΡΙΜΕΝΟ ΣΚΟΠΟ, ΑΚΡΙΒΕΙΑΣ, ΑΠΡΟΣΚΟΠΤΗΣ ΑΠΟΛΑΥΣΗΣ ΚΑΙ ΜΗ ΠΑΡΑΒΙΑΣΗΣ ΤΩΝ ΔΙΚΑΙΩΜΑΤΩΝ ΤΡΙΤΩΝ ΜΕΡΩΝ. Η TCL ΔΕΝ ΕΓΓΥΑΤΑΙ ΤΗΝ ΑΚΡΙΒΕΙΑ, ΕΓΚΥΡΟΤΗΤΑ, ΕΠΙΚΑΙΡΟΤΗΤΑ, ΝΟΜΙΜΟΤΗΤΑ Ή ΠΛΗΡΟΤΗΤΑ ΤΩΝ ΠΕΡΙΕΧΟΜΕΝΩΝ ΚΑΙ ΥΠΗΡΕΣΙΩΝ ΠΟΥ ΔΙΑΤΙΘΕΝΤΑΙ ΜΕΣΩ ΑΥΤΗΣ ΤΗΣ ΣΥΣΚΕΥΗΣ ΚΑΙ ΔΕΝ ΕΓΓΥΑΤΑΙ, ΕΠΙΣΗΣ, ΟΤΙ Η ΣΥΣΚΕΥΗ, ΤΑ ΠΕΡΙΕΧΟΜΕΝΑ Ή ΟΙ ΥΠΗΡΕΣΙΕΣ ΘΑ ΑΝΤΑΠΟΚΡΙΝΟΝΤΑΙ ΣΤΙΣ ΑΠΑΙΤΗΣΕΙΣ ΣΑΣ Ή ΟΤΙ Η ΛΕΙΤΟΥΡΓΙΑ ΤΗΣ ΣΥΣΚΕΥΗΣ Ή ΤΩΝ ΥΠΗΡΕΣΙΩΝ ΘΑ ΠΡΑΓΜΑΤΟΠΟΙΕΙΤΑΙ ΧΩΡΙΣ ΔΙΑΚΟΠΕΣ Ή ΣΦΑΛΜΑΤΑ. ΣΕ ΚΑΜΙΑ ΠΕΡΙΠΤΩΣΗ, ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΗΣ ΤΗΣ ΑΜΕΛΕΙΑΣ, Η TCL ΔΕΝ ΦΕΡΕΙ ΚΑΜΙΑ ΕΥΘΥΝΗ -ΣΥΜΒΑΤΙΚΗ Ή ΑΔΙΚΟΠΡΑΞΙΑΣ - ΓΙΑ ΟΠΟΙΑΔΗΠΟΤΕ ΑΜΕΣΗ, ΕΜΜΕΣΗ, ΘΕΤΙΚΗ, ΕΙΔΙΚΗ Ή ΑΠΟΘΕΤΙΚΗ ΖΗΜΙΑ, ΔΙΚΗΓΟΡΙΚΗ ΑΜΟΙΒΗ, ΔΑΠΑΝΕΣ Ή ΆΛΛΟΥ ΕΊΔΟΥΣ ΖΗΜΙΕΣ ΠΟΥ ΕΝΔΕΧΕΤΑΙ ΝΑ ΠΡΟΚΥΨΟΥΝ ΑΠΟ Ή ΣΕ ΣΧΕΣΗ ΜΕ ΟΠΟΙΕΣΔΗΠΟΤΕ ΠΛΗΡΟΦΟΡΙΕΣ ΟΙ ΟΠΟΙΕΣ ΠΕΡΙΛΑΜΒΑΝΟΝΤΑΙ ΣΕ Ή ΠΡΟΚΥΠΤΟΥΝ ΩΣ ΑΠΟΤΕΛΕΣΜΑ ΤΗΣ ΧΡΗΣΗΣ ΤΗΣ ΣΥΣΚΕΥΗΣ Ή ΟΠΟΙΟΥΔΗΠΟΤΕ ΠΕΡΙΕΧΟΜΕΝΟΥ Ή ΥΠΗΡΕΣΙΑΣ ΣΤΗΝ ΟΠΟΙΑ ΕΧΕΤΕ ΠΡΟΣΒΑΣΗ ΕΣΕΙΣ Ή ΟΠΟΙΟΔΗΠΟΤΕ ΤΡΙΤΟ ΜΕΡΟΣ, ΑΚΟΜΗ ΚΑΙ ΑΝ ΕΧΕΙ ΕΝΗΜΕΡΩΘΕΙ ΓΙΑ ΤΗΝ ΠΙΘΑΝΟΤΗΤΑ ΠΡΟΚΛΗΣΗΣ ΤΕΤΟΙΩΝ ΖΗΜΙΩΝ. \n   Οι υπηρεσίες τρίτων μερών υπόκεινται ανά πάσα στιγμή σε αλλαγή, αναστολή, κατάργηση, λήξη, διακοπή, ή απενεργοποίηση της πρόσβασης χωρίς προειδοποίηση. Η TCL (κατασκευάστρια εταιρία των τηλεοράσεων Thomson) δεν υπόσχεται και δεν εγγυάται ότι τα περιεχόμενα και οι υπηρεσίες θα διατίθενται για οποιοδήποτε χρονικό διάστημα. Τα περιεχόμενα και οι υπηρεσίες διανέμονται από τρίτα μέρη μέσω δικτύων και εγκαταστάσεων μετάδοσης σε σχέση με τα οποία η TCL δεν ασκεί κανέναν έλεγχο. Χωρίς περιορισμό του γενικού χαρακτήρα της παρούσας αποποίησης ευθυνών, η TCL αποποιείται ρητά οποιασδήποτε ευθύνης ή υπευθυνότητας σχετικά με οποιαδήποτε αλλαγή, διακοπή, απενεργοποίηση, κατάργηση ή αναστολή των περιεχομένων ή υπηρεσιών που προσφέρονται μέσω αυτής της συσκευής. Η TCL μπορεί σε οποιαδήποτε περίπτωση να επιβάλει όρια στη χρήση ή την πρόσβαση σε ορισμένες υπηρεσίες ή περιεχόμενα χωρίς προειδοποίηση και χωρίς να φέρει καμία ευθύνη. Η TCL δεν φέρει καμία ευθύνη ή υπευθυνότητα ως προς την εξυπηρέτηση πελατών σε σχέση με τα περιεχόμενα και τις υπηρεσίες. Οποιεσδήποτε ερωτήσεις ή αιτήματα εξυπηρέτησης σε σχέση με τα περιεχόμενα ή τις υπηρεσίες θα πρέπει να υποβάλλονται απευθείας στον εκάστοτε πάροχο των περιεχομένων ή υπηρεσιών."];

var noChannelListRemind        = ["Δε βρέθηκαν κανάλια. Η λίστα με τα κανάλια θα είναι διαθέσιμη μετά τη σάρωση των καναλιών. ","Σάρωση Καναλιού"];
var closeSubtitleRemind   = "Η λειτουργία θα είναι διαθέσιμη μόλις απενεργοποιηθούν οι υπότιτλοι. Θέλετε να κάνετε τη ρύθμιση τώρα;";

var estickerTitles = ["Μοναδικά ρεαλιστική εικόνα","Ζωντανά χρώματα","Ρεαλιστική αναπαράσταση κίνησης","Δυναμική ποιότητα εικόνας","Υποστηρίζει ανάλυση SR UHD  ","Δείτε τον κόσμο τρισδιάστατα","Μεγαλύτερη απόδοση","Υποστηρίζει περιεχόμενο με ανάλυση 4K","Απολαύστε την περιήγηση στο Ίντερνετ","Πρόσβαση σε επιπλέον περιεχόμενο ","Ολοκληρωμένοι ψηφιακοί δέκτες","Συνδέστε όλες τις συσκευές","Διάφορες πηγές 4K","Περιεχόμενο USB  ","Πάρα πολύ γρήγορο WIFI","Περιεχόμενο από κινητές συσκευές στην τηλεόραση","Περιεχόμενο κινητής συσκευής","Τοπικό περιεχόμενο","Έχει εγκριθεί από την DivX","Απίθανη εικόνα","Υποστηρίζει Canal  ","TDT Premium"];
var estickerDescriptions = ["Μια μοναδική εμπειρία προβολής με εικόνες τετραπλάσιας ανάλυσης Full HD σε οθόνη UHD  ","Το ευρύ χρωματικό πεδίο δίνει ατμόσφαιρα στις σκηνές με ζωηρές κόκκινες και σμαραγδένιες πράσινες αποχρώσεις","Η λειτουργία παρεμβολής καρέ 4K και ο οπίσθιος φωτισμός εξαλείφει τη θαμπάδα από την κινούμενη εικόνα","Η ζωντάνια της εικόνας ενισχύεται και δημιουργείται μια πραγματικά δυναμική απεικόνιση με λαμπερή αντίθεση","Απολαύστε τηλεοπτικά προγράμματα και δίσκους Blu-Ray με μοναδική κρυστάλλινη διαύγεια χάρις στην τεχνολογία Super Resolution","Παρακολουθήστε τηλεόραση και μια μεγάλη γκάμα περιεχομένου σε αληθινή τρισδιάστατη εικόνα 3D TV","Ο επεξεργαστής τετραπλού πυρήνα προσφέρει ομαλές διαδραστικές λειτουργίες, ενισχυμένη απόδοση για μια μοναδική εμπειρία ψυχαγωγίας","Υποστηρίζει το πρότυπο codec HEVC (H.265) για τη μελλοντική διάθεση περιεχομένου σε ανάλυση 4K","Τεράστια γκάμα εφαρμογών, υπηρεσιών VOD, τηλεοπτικού προγράμματος και δυνατότητα περιήγησης στο Ίντερνετ. ","Απολαύστε περισσότερες υπηρεσίες και περιεχόμενο από τα αγαπημένα σας κανάλια ","Παρακολουθήστε τηλεοπτικά κανάλια σε υψηλή ανάλυση, χωρίς αποκωδικοποιητή","Μπορείτε να συνδέσετε εύκολα  τις ψηφιακές συσκευές του σπιτιού σας","Η τηλεόραση που είναι κατάλληλη για μελλοντικές χρήσεις. Υποστηρίζει αναπαραγωγή 4K 50/60Hz μέσω HDMI 2.0 με HDCP 2.2","Εμφανίστε φωτογραφίες ή βίντεο απευθείας από μονάδα USB, σκληρό δίσκο κάμερα, σε οθόνη με ανάλυση 4K","Η τελευταία λέξη της τεχνολογίας 2x2 MIMO και AC προσθέτει μοναδικές ταχύτητες πρόσβασης στο Ίντερνετ","Απολαύστε φωτογραφίες, βίντεο, και εφαρμογές από φορητές συσκευές στη μεγάλη οθόνη, χάρη στην οθόνη τεχνολογία δημιουργίας ειδώλου οθόνης","Μπορείτε να εμφανίσετε φωτογραφίες, βίντεο και εφαρμογές από smartphone ή tablet στη μεγάλη οθόνη","Εμφανίστε σε μεγάλη οθόνη περιεχόμενο όπως φωτογραφίες και βίντεο από συσκευές που είναι συνδεδεμένες στο τοπικό δίκτυο","Αναπαράγετε ταινίες που σας ανήκουν ή έχετε ενοικιάσει μέσω DivX","Εξαιρετικά μικρή πρόσοψη και λεπτή σχεδίαση","Έχει δοκιμαστεί και εγκριθεί από την Canal+","Έχει δοκιμαστεί και εγκριθεί από την TDT Premium"];							

var eManualTextArray = ["Ηλεκ. Εγχειρίδιο","Όλες οι εικόνες είναι ενδεικτικές."];
var frontPanelRemind = "Μπροστ. ταμπλό κλειδωμ";
var eRPRemind		 = "Η λειτουργία του καταστήματος δεν ικανοποιεί την αίτηση ERP. Είστε σίγουρος?";	
var noRelatedChannel = "Δεν υπάρχει σχετικό κανάλι";
var option0624Name          = ["BOP","BFS","Συμβάν ανά Συμβάν","GetUserID","BGM","Reset all","Επαναφορά shop","NRM","DVB-T2 και επιλογή χώρας","Λειτουργία HbbTV"];
var DVBT2AndChoice = ["Εντός Λειτουρ.","Ανά χώρα","Εκτός Λειτουρ."];
var hbbtvServiceRemind = "Υπηρεσία HbbTV σύντομα κοντά σας.";
var insertWord = "Εισαγωγή";		
var viewDetail = "Λεπτομέρειες";							

var remindOAD  = "Ενημέρωση λογισμικού. Μια νέα συνιστώμενη ενημέρωση λογισμικού ίσως υπάρχει σε ένα άλλο κανάλι. Αν δέχεστε να το κατεβάσετε, μπορεί να αλλάξει προς το κανάλι αυτόματα. Θα θέλατε να το κάνετε τώρα;";

var LEDStatus = ["Αναβοσβήνει", "Κανονικά"];
var netFlixRemind = "Η λειτουργία αυτή θα διακόψει την πρόσβαση στις υπηρεσίες Netflix, μέχρι να συνδεθείτε ξανά.";
var ESNExplanation = "Ηλεκτρονικός σειριακός αριθμός";
var resetShopRemind = "Αυτή τη στιγμή εκτελείται επαναφορά συστήματος, μην απενεργοποιήσετε την τηλεόρασή σας";
var initialSelectOption = "Πραγματοποιήστε μία επιλογή:";
var databaseRemind   = "Το σύστημα αναγνώρισε τη βάση δεδομένων ως κατεστραμμένη για κάποιον άγνωστο λόγο και την αναδημιούργησε αυτόματα, πατήστε ΟΚ για να συνεχίσετε";
var Deactivation = "Απενεργοποίηση";
var oadFutureRemind = "Ενημέρωση λογισμικού. Ένα νέο συνιστώμενο λογισμικό θα είναι διαθέσιμο στις %s. Η ενημέρωση ενδέχεται να διαρκέσει λίγα λεπτά και η οθόνη να γίνει μαύρη. Μην απενεργοποιήσετε τον δέκτη κατά τη διάρκεια της ενημέρωσης. Αν δεχτείτε αυτή την ενημέρωση, αφήστε τον δέκτη ενεργοποιημένο ή στην κατάσταση αναμονής τον προγραμματισμένο χρόνο. Θέλετε να λαμβάνετε αυτή την ενημέρωση?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Έξοδος ήχου";
var bt_soundOutPutTV = "Ηχεία τηλεόρ.";
var bt_soundOutPutBT = "Συσκευή Bluetooth  ";
var bt_soundOutPutBT_TV = "Bluetooth και Τηλεόρ.";
var bt_refreshBarName = "Συσκευές";
var bt_settingTips_On = "Ενεργοποιήστε το Bluetooth και σαρώστε συσκευές. ";
var bt_settingTips_Finding = "Ανεύρεση διαθέσιμων συσκευών…";
var bt_settingTips_NoDevice = "Δεν υπάρχ. διαθέσ. συσκευή.";
var bt_deviceList_State_NoConnect = "Δε συνδέθηκε";
var bt_deviceList_State_Connecting = "Σύνδεση...";
var bt_deviceList_State_Connected = "Συνδέθηκε";
var bt_deviceList_State_Paired = "Έγινε ζεύξη";
var bt_deviceList_Conncect_Failed_Tips1 = "Σύνδεση απέτυχε.";
var bt_deviceList_Conncect_Failed_Tips2 = "Ελέγξτε ότι το Bluetooth XXX είναι ενεργοπ.";
var bt_deviceList_Conncect_Success = "Συνδέθηκε σε συσκευή Bluetooth.";
var bt_deviceList_Disconncect_Success = "Αποσυνδέθηκε από συσκευή Bluetooth.";
var bt_deviceList_Disconnect = "Θέλετε σίγουρα να αποσυνδεθείτε από το XXX;";
var bt_tipsTitle = "Συμβουλή";
var bt_bluetooth_Pairing_Title = "Ζεύξη Bluetooth";
var bt_bluetooth_Input_Pin = "Εισάγετε το PIN:";
var bt_bluetooth_Output_Pin_Tip = "Πληκτρολογήστε το PIN XXXX.";
var bt_bluetooth_Pin_Wrong_Tip = "Λάθος PIN";
var bt_bluetooth_Remove_Pair_Title = "Ερώτημα";
var bt_bluetooth_Remove_Pair_Ask = "Να μη θυμάται τη συσκευή;";
var bt_bluetooth_module_error = "Bluetooth λάθος ενότητα!";		
		
var netflixDialogOptions = ["OK","Αργότερα","Να μην εμφανιστεί ξανά"];
var netflixDialogContent = "Στο Netflix θα βρείτε πολλές ταινίες για προβολή, μετάβαση τώρα;";
var netflixRemoteDialogContent = "Τώρα μπορείτε να αγοράσετε το τηλεχειριστήριο με κουμπί Netflix. Επισκεφτείτε την παρακάτω τοποθεσία web για περισσότερες πληροφορίες.\nhttps://store.tcleu.com";
							
var applyPictureModeSwitchValue	 = ["Τρέχουσα πηγή","Όλες οι πηγές"];
var audioDescriptionName = ["Ηχητική περιγραφή","Ηχείο","Ένταση ηχείου","Ακουστικά","Ένταση ακουστικών","AD volume","Συσκευή Bluetooth","Ένταση συσκευής Bluetooth"];
var audioDescriptionOptions = ["Εκτός Λειτουρ.","Κανονικά","Ηχητική περιγραφή"];							
var volumeOffRemind = 'Ρυθμίστε XXX σε “Ενεργό” στο μενού Ρυθμίσεων.';
var switchSourceRemind   = " Εισήχθησαν. Θέλετε να κάνετε εναλλαγή τώρα?";							

var mEPSRemind		 = "Shop mode does not meet the MEPS requirements. Are you sure you want to select it?";		
var parentRatingAUOptions = ["No block", "Block G and above(optional)", "Block PG and above",
							 "Block M and above", "Block MA and above", "Block AV and above", 
							 "Block R and above", "Block all"];	
var mEPSTips		= ["The current picture mode does not meet the MEPS\nrequirements, standard mode is recommended.", 
					   "Your TV is in shop mode.\nFor home mode, please see Settings menu."];

var footballModeName = "Λειτουργία αθλητικών";
var resetStadium = "Στάδιο";					
var netflix = "NETFLIX";
var golive = "GOLIVE";								
							
//以下数组是虚拟遥控器的html中所有span的文字，要一一对应

var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9","Έξοδος","0","Μεγέθυνση+",
                       	   "Έξοδος",
                       	   "Λίστα","0","Κείμενο","Οδηγός","Είσοδος","Έξοδος","Μενού","Υπότιτλοι","Πληροφ.",
                       	   "Διακοπή",
                       	   "Πληροφ.","Μενού","Έξοδος"
                       	   ];
var nscreenTips = "Η εφαρμογή GuideOn βοηθά τους χρήστες να πλοηγηθούν μέσα σε αυτό τον τεράστιο όγκο περιεχομένων.";
var nscreenContent = 'Βήματα: 1.Κάντε κλικ στην επιλογή «TCL nScreen» (TCL nΟθόνη) στο τηλέφωνο.  Συνδέστε το τηλέφωνο με την τηλεόραση μέσω του ίδιου τοπικού ασύρματου δικτύου (LAN). 2.Κάντε κλικ στην επιλογή «GuideOn» για να εισέλθετε στην εφαρμογή GuideOn. 3.Η εφαρμογή GuideOn παρέχει λειτουργικότητα παρόμοια με έναν έντυπο οδηγό προγράμματος, ενημερώνοντας τους χρήστες σχετικά με το τηλεοπτικό περιεχόμενο που είναι διαθέσιμο. ';
var singalBrokenoffTips = "Το σήμα διακόπηκε. Το σύστημα δεν μπορεί να ολοκληρώσει τη λήψη.";
var contentSpan1_1Array_AU =  [["ΙΣΧΥΣ:","ΠΗΓΗ:","ΜΕΝΟΥ:","BACK:","ΠΛΗΡΟΦΟΡΙΕΣ:","HOME:","EXIT:","ΛΙΣΤΑ:"],
                             ["Turns power on or standby mode","Select the input source",
                              "Show TV settings menu","Go back to the Previous menu or exit a running APP","Εμφανίζει πληροφορίες προγράμματος",
                            "Μετάβαση στην αρχική σελίδα","Go back to the Previous menu or exit a running APP","Εμφανίζει τη λίστα με τα κανάλια"]];
var guideDescriptionWords ="Σαρώστε τον κωδικό QR για να κατεβάσετε την εφαρμογή GuideOn στο τηλέφωνό σας.";			    
var settingNoticeSourceName ="Αυτόματη προέλευση";