
var all_country 	= ["Австралія","Австрія","Бельгія","Болгарія","Хорватія","Чеська республіка","Данія","Фінляндія","Франція","Німеччина",
						"Греція","Угорщина","Італія","Люксембург","Нідерланди","Норвегія","Польща","Португалія","Румунія","Росія",
						"Сербія","Словенія","Іспанія","Швеція","Швейцарія","Велика Британія","Нова Зеландія"," "/*Arab*/,"Естонія"," "/*Hebrew*/,
						"Латвія","Словаччина","Туреччина","Ірландія","*","Філіппіни","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"Китай","*","*","*","*","*","*","Інше","Литва"/*新添加的，底层结构体中没有*/,"Україна"/*新添加的，底层结构体中没有*/,
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","Iceland","Belarus","*","Литва"];						
				
var all_language 	= ["Чеська","*","Датська","*","*","Німецька","Англійська","Іспанська","Грецька","Французька",
						"Хорватська","*","Італійська","Угорська","Голландська","Норвезька","Польська","Португальська","Російська","Румунська",
						"Словенська","Сербська","Фінська","Шведська","Болгарська","Словацька","*","*","Гальска","*",
						"Уельська","Арабська","Ірландія","Латвійська","*","Турецька","Естонська","Голландська"/*Netherlands*/,"*","*",
						"*","*","*","*","*","*","V.O."/*Qaa*/,"Не визначено"/*Undetermined*/,"*","Невідомий",
						"Не визначено","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","Баскська","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Білоруська","*","*","Каталонська","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Галісійська","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","Ісландська","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Литовська",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","Романтика","*","*","*","*",
						"*","*","*","Sami","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","Телетекст",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","Українська","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","*",
						"*","*","*","*","*","*","*","*","*","ChineseTraditional","*" ];
var offOn			= ["Вимкнути","Увімкнути"];
var okCancel		= ["ОК","Скасувати"];
var yesNo			= ["ТАК","НІ"];
var level			= ["Вимкнути","Низький рівень","Високий","Середній рівень"];
var manualAuto		= ["Ручний","Авто"];
var homeShop		= ["Дім","Крамниця"];
var picPreset		= ["Стандарт","динамічна","Природний","Кіно","Цифровий кінотеатр","Особистий"];
var picColorTemp	= ["Прохолодний","Нормальний","Теплий","Теплий2","Користувацький режим"];
var pic3dNavig		= ["Ручний","Авто","Напівавто"];
var _3dOptions		= ["Режим 3D","3D-у-2D","Перемикач L-R","Глибина різкості"];
var pic3DMode       = ["Вимкнути","2D-у-3D","Пліч-о-пліч","Верх і низ","Чергування стрічок"];
var picEcoOptions	= ["Енергозбереження","Датчик освітленості","Часткове затемнення","Змішане затемнення"];
var picGeoOptions	= ["Геометрія","Горизонтальне положення","Вертикальне положення","Годинник","Етап"];//Geometry 无翻译
var picAdWhiteBal	= ["Рівень червоного","Рівень зеленого","Рівень синього","Зсув червоного","Зсув зеленого","Зсув синього"];
var souOptions		= ["Попередня настройка звуку","Баланс","Затримка аудіо","SRS TSHD","Автоматичний контроль гучності",
						"Цифровий інтерфейс типу SPDIF","Затримка SPDIF","Розташування телевізора","Мова аудіо","Тип звуку",
						"Опис аудіо","Тип виходу цифрового звуку","Налаштування Dolby professional"];
var soundOutputoptions =["DAP-вихід телевізійної колонки","Вихід кодування зовнішнього AVR"];
var inteligenteqoptions 	=["Сфокусований","Багатий"];						
var souSpdifType	= ["Авто"/*Dolby*/,"PCM","Вимкнути"];
var colorSpace      = ["Авто","Рідний","Користувацький режим","DCIP3"];
var souPresetPara	= ["100Hz","300Hz","1KHz","3KHz","10KHz","Віртуалізатор об’ємного звуку","Покращення діалогів","Покращення басів","Інтелект. рівень гучності","Інтелект. мультимедіа","Графіч. еквалайзер","Інтелектуальний EQ"];
var chOptions		= ["Пошук каналів","Список каналів","EPG","Органайзер","Діагностика каналів",
						"зсув у часі","Субтитри","Телетекст","Тип списку каналів"];//Channel diagnostics 、Channel organizer 无翻译
var chDiagOptions	= ["Потужність сигналу","Якість сигналу","Частота (кГц)","Служб. ідентифік.","ID мережі","Мережне ім'я"];
var chScanOptions	= ["Країна","Режим тюнера","Автоматичний пошук","Автоматичне оновлення","Пошук вручну аналогових каналів",
						["Ручний пошук кабелю","Ручний пошук антени","Ручне налаштування супутника"],"Налаштування супутникової антени","Вибір улюбленої мережі","Очистити список каналів",];
var favNetDes		= "Виберіть уподобану мережу";
var tuner			= ["Кабель","Aнтена","Супутник"];//Satelite 无翻译
var passError		= "Пароль невірний.\nБудьласка, введіть знову!";
var chType			= ["Аналогові канали: ","Цифрові канали: "];
var chScanStatus	= ["Стан:  Сканування","Стан:  Пошук завершено","Стан:  Пошук скасовано","Стан:  Помилка пошуку"];
var chScanPara		= ["Частота (кГц)","Модуляція","Шв. перед. (тис.симв./с)","ID мережі","Система",
						"Точна настройка","Потужність сигналу","Якість сигналу","Режим сканування","Ідентифікатор каналу"];
var chScanParaMHZ      = ["Частота (MHz)"];
var chAtvManSys		= ["Західна Європа","Східна Європа","Великобританiя","Франція"];
var modulation		= ["Модуляція 16QAM","Модуляція 32QAM","Модуляція 64QAM","Модуляці. 128QAM","Модуляці. 256QAM","Авто"];
var chCleanDes		= "Бажаєте очистити список каналів?";
var chDeletDes		= "Бажаєте видалити канали?";
var chOperator		= ["Ziggo","UPC","Інше"];
var chScanType		= ["Цифровий & Аналоговий","Цифровий","Аналоговий"];
var chScanMode		= ["Повний","Вперед","Швидко"];
var bookingModes	= ["Запис","Нагадування"];
var dayName			= ["Hеділя","Понеділок","Вівторком","Cереда","четвер","п'ятниця","Субота"];
var monthName		= ["Січ.", "Лют.","Бер.","Квіт.","Травень","Черв.","Лип.","Серп.","Вер.","Жов.","Лист.","Груд."];
var filter			= ["Фільтр","Тип","Підтип"];
var chEpgFirstGenre	= ["Кіно","Новини","Шоу","Спорт","Дитячі","Музика","Мистецтво","Соціальні","Освіта","Дозвілля","SPECIAAL"];
var chEpgSecondGenre= [["Драма","Детектив","Пригоди","Наукова фантастика","Комедія","Мелодрама","Романтика","Серйозні","Фільми для дорослих"," "," "," "],
						["Поточні події","Прогноз погоди","Інформаційно-аналітичні програми","Документальні програми","Дискусії"," "," "," "," "," "," "," "],
						["Шоу","Ігрові шоу","Естрадно-розважальні шоу","Ток-шоу"," "," "," "," "," "," "," "," "],
						["Спорт","Особливі події","Спортивні журнали","Футбол","Теніс",
							"Командні види спорту","Атлетика","Мотоспорт","Водні види спорту","Зимові види спорту",
							"Кінний спорт","Єдиноборства"],
						["Дитячі","Для дошкільнят","Розважальні програми для дітей від 6 до 14 років","Розважальні програми для дітей від 10 до 16 років","Інформаційні","Мультфільми"," "," "," "," "," "," "," "],
						["Музика","Rock","Серйозні","Фольк","Джаз","Мелодійна","Балет"," "," "," "," "," "],
						["Мистецтво","Виконавче мистецтво","Образотворче мистецтво","Релігія","Поп-культура",
							"Література","Кіно","Експериментальні програми","Трансляция телепередач","Нові медіа-технології",
							"Журнали про мистецтво","Мода"],
						["Соціальні","Журнали","Економіка","Знаменитості"," "," "," "," "," "," "," "," "],
						["Освіта","Природа","Технологія","Медицина","Зарубіжні країни","Суспільні науки","Подальша освіта","Мови"," "," "," "," "],
						["Хоббі та дозвілля","Туризм","Рукоділля","Автоспорт","Фітнес та здоров’я","Кулінарія","Реклама","Садівництво"," "," "," "," "],
						["Мова оригіналу","Чорно-білий","Неопублікований","Пряма трансляція"," "," "," "," "," "," "," "," "]];
var chOrganizer		= ["Пропустити канал","Сортування каналів","Редвгування каналів","Видалити канал","канал підкачки","каналу вста"];
var chEditPara 		= ["Мережне ім'я","Номер каналу","Назва каналу","Частота","Система кольорів ","Система звуку"];
var chSatTitles		= ["Тип супутника","Налаштування супутникової антени","Вибрати супутник"];
var chSatEidtOptions= ["Ім'я супутника","Положення","LNB влада","Частота LNB (МГц)","Вхід DiSEqC",
						"Сигнал 22 КГц","тональна посилка","Частота (кГц)","Шв. перед. (тис.симв./с)","Поляризація",
						"Потужність сигналу","Якість сигналу","Стан супутника"];
var chSatAutoPromt	= [["Всі","Мережа"],
						["Всі","Безкоштовно"]];
var chSatAutoScanOptions=["Вибрати супутник","Режим сканування","Канали"];
var chSatPosition	= ["A","B"];
var chSatLNBFreq	= ["Універсальний",];
var chSatDiSEqCInput= ["Вимкнути","A","B","C","D"];
var chSatTone22KHz	= ["Авто","Увімкнути","Вимкнути"];
var chSatToneBurst	= ["Вимкнути","тональна посилка A","тональна посилка B"];
var chSatPolarization= ["Горизонтально","Вертикально"];
var chSatSetupOptions=["Тип антени","Тюнер","Частотний діапазон"];
var chSatAntennaType= ["Один кабель","Універсальний"];
var chSatUserBands	= ["Діапазон корист. 1","Діапазон корист. 2","Діапазон корист. 3","Діапазон корист. 4","Діапазон корист. 5","Діапазон корист. 6","Діапазон корист. 7","Діапазон корист. 8"];
var chSatOthers		= ["Ретранслятор"];
var chSatSetupOthers= ["Визначений користувачем"];
var pleaseSelectSat = "Спочатку виберіть супутники!";
var subOptions		= ["Субтитри","Мова субт. цифр. Мовлення","Мова субт. цифр. мовлення 2","Тип субтитрів"];
var ttxOptionsCon      = ["Мова сторінки декодування","Мова цифрового телетексту"];
var subType			= ["Нормальний","Для осіб з вадами слуху"];
var netIntf     	= ["Етернет","Бездротовий"];
var netConnDes		= ["Виконується перевірка мережного зв'язку.\nЗачекайте",
						"Перевірка з'єднання з мережею пройшла успішно.",
						"Помилка перевірки з'єднання з мережею."];
var netSsidError	= "Припустима довжина ідентифікатора SSID становить від 1 до 32 символів. Перевірте ідентифікатор SSID.";
var netOthers		= ["PIN-код "];
var netWlessAutoDes	= ["Перед тим, як клацнути ОК, упевніться, що наступний ПІН-код встановлений в точку доступу.",
						"Натисніть кнопку на точці доступу упродовж 120 секунд перед тим, як клацнути ОК."];
var netConnRemind	= ["Пароль невірний!",
						"Підключення. Зачекайте!",
						"Зв'язок встановлено, ІР отримано!",
						"Помилка каналу",
						"Сканування ТД\nЗачекайте…",
						"До ТВ не підключено жодного бездротового пристрою!"];
var netWireIpOptions= ["Налаштування ІР","Тип адреси","ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS","Допоміжний DNS"];
var netWireConnRemind= ["Введіть значення від 0 до 255.",
						"Успішне підключення!",
						"Введіть припустиму адресу",
						"Успішне підключення!",
						"Підключення не виконано!",
						"Підключення. Зачекайте!",
						"Введіть значення від 1 до 223."];
var netFlixOptions	= ["Вимкнути","ESN"];
var netFlixDes	 	= ["Вимкнути цю функцію?"," "/*Are you sure that you want to ESN?*/];
var netUpdateTitle 	= "Онов-ня пр. забез-ня";
var netUpdateDialogTitle = "Оновлення програмного забезпечення";
var netBGDownloadTitle 	= "Завантаження";
var netUpdateLoadingPrompt= ["Триває пошук оновлення. Зачекайте!",
							"Завантаження програмного забезпечення... Зачекайте!",
							"НЕ вимикайте телевізор під час оновлення ПЗ!",
                            "Обов’язкове оновлення програмного забезпечення завантажується автоматично у фоновому режимі!"];
var netUpdatePrompt= ["Вітаємо! У вас найновіша версія ПО!",
						"Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Помилка входу!",
						"Не вдалося отримати дані. Повторіть спробу пізніше!",
						"Помилка XML аналізу оновлення!",
						"Помилка каналу",
						" Завантажити програмне забезпечення. Бажаєте запустити мигання?",
						"Дані втрачені! Помилка завантаження!",
						"Помилка перевірки пакета, повторіть спробу!",
						"Помилка мережі. Перевірте та повторіть з'єднання...",
						"Помилка оновлення. Вимкніть та увімкніть ТВ!",
						"Файл оновлення несподівано видалено. Повторіть оновлення через мережу.",
						"Програмне забезпечення успішно завантажено у фоновому режимі. Виконати оновлення?"];
var netUpdateButtonText = ["Завантажити", "Оновити", "Потім", "Ніколи", "ОК","Продовжити"];
var autoDetectPrompt = ["Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Знайдено нову версію ПО XXXX. Бажаєте оновити зараз?",
						"Останнього разу процес оновлення через мережу було перервано. Оновлення треба повторити.",
                        "Завантаження нової версії програмного забезпечення XXXX ще не завершено. Продовжити завантаження?",
                        "Програмне забезпечення завантажено. Оновити зараз?"];
var sysOptions		= ["Електронний посібник","Мова меню","Таймер","Заблокувати","Налаштування входу",
						"Онов-ня пр. забез-ня","Розташування","Режим HbbTV","Файли cookie","Загальний інтерфейс ",
						"додаткові налаштування","Відновити попередні налаштування","Світлодіодний індикатор"];
var sysResetDes		= "Ви впевнені?";
var sysMenuLangOptions=["Мова","Обрана мова звучання","Переважна друга мова аудіо"];
var sysTimerOptions	= ["Часовий пояс","Назва регіону","Годинник","Таймер переходу до сплячого режиму","Автом. очікування", "Country region"];

var sysTimeZone		= ["Як у телекомпанії","GMT +0:00","GMT +1:00","GMT +2:00","GMT +3:00",
						"GMT +3:30","GMT +4:00","GMT +4:30","GMT +5:00","GMT +5:30",
						"GMT +5:45","GMT +6:00","GMT +6:30","GMT +7:00","GMT +8:00",
						"GMT +9:00","GMT +9:30","GMT +10:00","GMT +11:00","GMT +12:00",
						"GMT +12:45","GMT +13:00","GMT -12:00","GMT -11:00","GMT -10:00",
						"GMT -9:00","GMT -8:00","GMT -7:00","GMT -6:00","GMT -5:00",
						"GMT -4:00","GMT -3:30","GMT -3:00","GMT -2:00","GMT -1:00"];
var sysSleepTimer	= ["Вимкнути","10 хв","20 хв","30 хв","40 хв","50 хв","60 хв","90 хв","120 хв"];
var sysStandby		= ["Вимкнути","4 години","6 години","8 години"];
var sysRegionName	= ["Мадрид ","Канарські острови"];
var sysClockOptions	= ["Автоматична синхронізація","Дата","Час","Таймер включення","Таймер",
						"Увімкнути канал","Таймер вимкнення","Таймер"];
var sysTimer		= ["Вимкнути","Щодня","Один раз"];

var sysInputSet		= ["Без позначки ","DVD","Blu-ray","HDD","DVDR",
						"Запис HD відео","Гра","VCR","ПК","Цифровий декодер STB",
						"HD dig STB","Камера","Пристрій записування","Інше"];
var sysAvVideoInput	= ["Авто","RGB_CVBS","RGB","CVBS","S-Відео "];
var sysUpdate		= ["Через USB","Через мережі","За каналом"];
var sysUpdateDes	= [" ",
						" ",
						" ",
						"Відсутнє нове ПО для завантаження!",
						"Знайдено нову версію ПО XXXX. Бажаєте оновити зараз?",
						"Вставте USB-носій.",
						"Помилка перевірки пакета, повторіть спробу!",
						"Будь ласка, НЕ відключайте USB пристрій та не вимикайте телебачення під час оновлення мікропрограми!!",
						"Завантаження програмного забезпечення успішно завершено.\nТелевізор буде автоматично перезапущений!",
						"Знайдено нову версію ПО XXXX. Бажаєте завантажити зараз? Це може зайняти певний час залежно від стану вашої мережі.",
						"Завантаження",
						" Завантажити програмне забезпечення. Бажаєте запустити мигання?",
						"Помилка",
						"Пошук файлів оновлення",
						"ПЗ успішно оновлене.\nПерезапустіть телевізор."];
var sysProductInfo	= ["Поточна версія","Назва виробу","Ім'я виробника","Назва шасі"];
var sysCiDes		= ["Не пред’явлена картка CI."];
var sysAdOptions	= ["Реєстрація DivX®","Скасування реєстрації DivX(R)","T-Link","Authorization Error","Підтвердження дереєстрації",
						"Підтвердження аренди","Оренда завершилась","ІД декларації Bluetooth"];
var sysRegistDes	= ["Для відтворення захищеного відео DivX необхідно зареєструвати ваш пристрій",
						"Код реєстрації:",
						"Реєстрація на http://vod.divx.com"];
var sysDregistDes	= ["Код скасування реєстрації:",
						"Скасуйте реєстрацію за адресою http://vod.divx.com",
						"Продовжити реєстрацію?"];
var mediaAuthorization = ["Ваш пристрій не має дозволу на відтворення цього захищеного відео DivX(R)."];
var deregistrationConfrimation = ["Ваш пристрій вже зареєстровано.","Дійсно скасувати реєстрацію?"];
var rentalConfirmation = "DivX(R) rental здійснено XXXX переглядів із YYYY. Продовжити?";
var rentalExpired 	= "Використано XXXX з YYYY переглядів DivX(R)-файлів. Термін дії підписки на перегляд DivX-файлів минув.";
						
						
var sysLockOptions	= ["Блокувати канал","Блокування час. інтервалу","Батьківська оцінка","Блок вводу","Блокування передньої панелi","Встановлення блокування",
						"Змінити пароль","Максимальна гучність","Видалити всі "];
var sysTimeIntervals= ["Тип блокування","Час початку","Час завершення"];
var sysRatingOptions= ["Жодний","4","5","6","7","8","9","10","11","12",
						"13","14","15","16","17","18","Тільки для дорослих (Іспанія)"];
var changePass		= ["Змінити пароль","Новий пароль","Підтвердити пароль"];
var changePassDes	= ["Пароль невірний.\nБудьласка, введіть знову!",
						"Пароль-підтвердження не співпадає з паролем.\n Будь ласка, введіть знову!",
						"Успішне встановлення паролю!",
						"Введений код занадто простий\nПовторіть ще раз!"];
var sysPowerOnChOptions= "Режим вибору";
var sysPowerOnCh	= ["Останній статус","Вибір користувача"];
var netWlessSecu    = ["Відкрити","WEP","WPA/WPA2-PSK "];
var netWlessSecu2	= ["Жодний","WEP","WPA-PSK","WPA2-PSK","WPA/WPA2-PSK ",""];
var netWlessSecu3	= ["Жодний","WEP","WPA-PSK(TKIP)","WPA-PSK(AES)","WPA2-PSK(TKIP)","WPA2-PSK(AES)","WPA/WPA2-PSK(AUTO)",""];
var netOptions		= ["Інтернет-з'єднання","Інтерфейс","Налаштування безпроводової мережі","Налаштування IP","Інформація",
						"Перевірка з'єднання","DLNA","Пульт ДК","Налаштування Netflix ","Телевізійний зв’язок Wi-Fi",
						"Тип адреси","ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS",
						"Допоміжний DNS","SSID","BSSID","Введіть SSID:","Ідентифікатор користувача"];
var chEditDes		= ["Дубльований номер каналу!","Натисніть червону кнопку, щоб видалити поточний символ!","Неприпустимі номери каналів"];
var chEpgNoProgram	= "Відсутня інформація про програму. Спочатку знайдіть канали!";
var chEpgWords		= ["Програма передач","Дані про передачі відсутні.","Канал заблоковано!","Докладна інформація про передачі відсутня.","Назви передач відсутні."];
var chEpgBooking	= ["Розклад інформація", "Номер каналу","Дата початку","Час початку","Час завершення",
						"Повторити","Графік","Додати","Замінити","Змінити",
						"Додати/модифікувати"];
var epgHotKey		= ["Попер. день","Наст. день","Фільтр","Запис за графіком","Додати графік"];
var chEpgBookRemind	= ["Неправильний час початку","Неправильний час закінчення","Дубльований розклад","Успішне збереження.","Успішно видалено."];
var chSchePara		= ["Запис за графіком","Час початку","Дата початку","Назва передачі","Назва каналу",
						"Тривалість","Повторити","Розклад","Редагувати","Видалити"];
var dateTimer		= ["Один раз","Щодня","Щотижня"];
var scheduleDeleteReminds="Бажаєте видалити цей розклад?";
var scheduleNoLists	= "Записи за графіком відсутні. Щоб додати, натисніть червону кнопку.";
var chListWords		= ["Список каналів","Вибрати список","Режим тюнера","Додати до вибраного","Видалити",
						"Виберіть список каналів","Виберіть режим тюнера","Замінити"];
var chListType		= ["Всі","Цифровий","Аналоговий","Радіо","Безкоштовно","Вибране"];
var chAutoScanOptions=["Виберіть оператора","Тип каналу","Автоматичний пошук"];
var souSoundType	= ["Недійсний","Моно","Моно","Стерео ","Стерео ",
						"Моно","Стерео ","подвійний 1","подвійний 2","подвійний 2",
						"Nicam mono","Nicam stereo","Nicam dual1","Nicam dual2","NICAM Dual",
						"Моно","LL","RR","LR"];
var souPreset		= ["Музика","Кіно","Функція Clear Voice","Стандарт","Особистий"];
var picAdRgbMode	= ["Вимкнути","Тільки червоний","Тільки зелений","Тільки синій"];
var picAdOptions	= ["Зменшення шуму","Заглушення шумів MPEG NR","RGB mode","динамічна контрастність","Функція LED Motion Clarity",
						"Тілесний колір","режим кіно","Режим гри","Температура кольору","баланс білого",
						"Закріпити","Black Stretch","Режим перерозгортки","Гама","Режим HDMI","Баланс білого 10Р","Розширювач кольорового діапазону",
						"Зменшення розмитості","Зменшення тремтіння зображення","Кольоровий простір","Функція Motion Clarity"];
var pic10Pwhite     = ["Інтервал","Червоний","Зелений","Синій","Скинути","Колір","Жовтий","Блакитний","Пурпурний"];
var picMotionClarity = ["Режим руху","Інтерполяція руху","Функція LED Motion Clarity","Зменшення розмитості","Зменшення тремтіння зображення","Скинути"];
var picMotionMode   = ["Авто","Кіно","Згладження","Очистити ","Спорт","Клієнт"];
var picResetDes		= "Усі особисті налаштування будуть відновлені. Виконати вибрану дію?";
var pic10PReset     = "Відновити заводські налаштування балансу білого 10Р?";
var picMotionReset  = "Відновити заводські налаштування функції Motion Clarity?";
var picColorSpaceReset    = "Відновити заводські налаштування кольорового простору?";
var picOptions		= ["Визначені налаштування з..",
						"Підсвічування","Яскравість","Контрастність","Насиченість","Відтінок","Різкість","Температура кольору","Режим екрану","Автоформат",
						"Покращення «Спорт»","3D","3D-навігація","ECO Установки","Геометрія",
						"додаткові налаштування","Застосувати режим зображення","Скинути зображення"];
var picSize			= ["Формат 16:9", "Формат 4:3", "Формат екрана 14:9", "Синерама ",
						"Зміна масштабу 16:9", "Збільшення масштабу 16:9","Зміна масштабу 14:9","Розтягнення зображення ","Широкий зум",
						"Зміна масштабу 2","Широкий зум 2","Власна роздільна здатність екрана","По елементах","Оригінальний","Панорама"];
var others			= ["Гучність","Мовлення","Пароль","Стан","Зберегти","Замінити","Розпочати","Вихід","Пошук","Видалити",
						"Жодний","Автоматично","Пошук","Безпека","Під'єднайте","Оновити","Спробувати ще раз","СТОП","Установки","Канали",
						"Редагувати","Вставити","Cигналу!","Завершити","Стерео ","Аудіо","Джерело","Немає звуку","Поради","Скинути",
						"Клієнт","Настроювання ","Зберегти","Користувач","Закрити клавіатуру","Режим захисту","Щоденно","Список PVR"];
var direction		= ["Лівий","Правий","Вгору","Вниз"];
var audioType 		= ["MPEG","Dolby D"/*"AC3"*/,"MPEG4","AAC", "Dolby D+"/*"AC3P"*/,
						"AACP","MPEG_AD","AC3_AD","AC3P_AD","AACP_AD",
						" "," "," "," "," ",
						" ","HE-AAC", "AAC_V2", "AAC_V4", "HE-AAC_V2",
						"HE-AAC_V4","Невідомий"];
var soundChannels   = ["Невідомий","Моно","Sub","Подвійний моно","Стерео ","Стерео сабвуфер","Stereo Dolby Surround","Об’ємний звук 2CH","Об’ємний звук","Конфігурація каналів 3.0","Конфігурація каналів 4.0","Конфігурація каналів 5.0","Mono LFE","Dual Mono LFE","Stereo LFE","Surround 2Ch LFE","Surround LFE","Конфігурація каналів 3.1","Конфігурація каналів 4.1","5.1CH","7.1CH","Joint Stereo","FMRDO Mono","FMRDO Stereo","FM Mono NICAM Mono","FM Mono NICAM Stereo","FM Mono NICAM Dual","Лівий","Правий","Інше"];
var prompts			= ["Встановіть налаштування зображення, які найкраще підходять до ваших умов перегляду.",
						"Встановіть рівень яскравості. Чим ближче до значення 100 — тим яскравіше зображення.",
						"Встановіть рівень контрастності. Чим ближче до значення 100 — тим більшою буде різниця у темно-яскравих частинах зображення.",
						"Встановіть рівень насиченості. Чим ближче до значення 100 — тим різкіший колір.",
						"Встановіть рівень чіткості. Чим ближче до значення 100 — тим чіткіше відображаються деталі.",
						"Встановіть рівень підсвічування. Чим ближче до значення 100 — тим яскравіший екран.",
						"Встановіть рівень відтінку. Ця установка змінює відтінки кольору.",
						"Виберіть формат зображення, що найкраще підходить до передачі, яку ви переглядаєте.",
						"Налаштуйте опції енергозбереження.",
						"Встановіть налаштування геометрії екрана при під’єднанні ПК.",
						"Виберіть розширені налаштування зображення.",
						"Відновлення усіх налаштувань зображення до початкових значень.",
						"Виберіть режим звуку відповідно до ваших вподобань.",
						"Налаштуйте баланс гучності між лівим та правим каналами.",
						"Функція Sound Retrieval System TruSurround HD забезпечує відтворення глибокого звуку та чіткість звучання нижніх і верхніх частот.",
						"Digital Interface Format дозволяє під’єднати вихід цифрового звуку на телевізорі до аудіообладнання домашнього кінотеатру.",
						"Виберіть мову звучання відповідно до ваших вподобань.",
						"Увімкніть функцію для людей з вадами зору, у випадку поганого зору.",
						"Перевірте зображення, звук та сигнал телевізора.",
						"Виберіть тип списку каналів, що відповідає вашому ТВ-сигналу.",
						"Виберіть мову субтитрів передачі, що відображаються внизу екрана.",
						"Перегляд тексту та зображень поточного каналу.",
						"Стандарт Digital Living Network Alliance. Насолоджуйтеся музикою, фотографіями та відеозаписами в домашній мережі з інших пристроїв, наприклад комп’ютера.",
						"Відображайте вміст вашого смартфону на екрані телевізора та використовуйте смартфон як пульт дистанційного керування для вашого телевізора.",
						"Відображайте вміст із Miracast-сумісного Android-пристрою на екрані вашого телевізора.",
						"Заблокуйте ваш телевізор.",
						"Виберіть ім'я для вашого пристрою.",
						"Виберіть ваші умови перегляду.",
						"Відновлення усіх системних налаштувань до початкових значень."];
var initialTitle	= ["Вітаємо","Початкове установлення"];
var initialPrompt	= ["Виконайте початкове налаштування зараз та отримайте незабутні враження!",
						"Оберіть мову:",
						"Виберіть вашу країну:",
						"Оберіть регіон:",
						"Виберіть тип мережного з'єднання:",
						"Виберіть режим з'єднання з проводовою мережею:",
						"Не вдалося підключитися до xxxxxxxxx! Підключіть пристрій, як зображено на схемі, чи натисніть кнопку Left (Вліво), щоб відновити налаштування.",
						"Підключено до xxxxxxxxx! Для продовження натисніть кнопку Right (Вправо).",
						"1) Ваш телевізор, можливо, оснащений вбудованим безпровідним адаптером\n 2) Або якщо є безпровідний адаптер USB, під’єднайте його до телевізора.  Потім виберіть режим підключення безпровідної мережі",
						"Сканування. Зачекайте...",
						"До ТВ не підключено жодного бездротового пристрою!",
						"Перш ніж натиснути кнопку \"Далі\", перевірте, чи встановлено наступний PIN-код на ТД.",
						"Натисніть кнопку на АР за 120 секунд до того, як натиснете Right (Вправо).",
						"WPS (Стандарт безпечного налаштування безпроводової мережі)",
						"PIN (особистий ідентифікаційний номер)",
						"РВС (конфігурація кнопки)",
						"Доступ до цього вмісту можна отримати лише після підключення до мережі. Пропустити налаштування мережі?",
						"Нове оновлення програмного забезпечення доступне для завантаження; завантаження може зайняти певний час, залежно від стану вашої мережі.",
						"Оновлення програмного забезпечення вашого телевізора дозволить вам скористатись найновішими функціями та сервісами.",
						"Ви не зможете насолоджуватися найновішими функціями та сервісами. Пропустити оновлення програмного забезпечення?",
						"Натисніть праву кнопку, щоб продовжити.",
						"Не вимикайте живлення під час оновлення, оскільки це може призвести до несправності телевізора.",
						"Якщо не хочете виконати оновлення, виберіть NO (НІ).",
						"Триває оновлення. Зачекайте",
						"Оновити програмне забезпечення також можна в меню SYSTEM > SOFTWARE UPDATE (СИСТЕМА > ОНОВЛЕННЯ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ).",
						"Вибрана країна вимагає налаштування пароля.\nВведіть код для вашого телевізора та підтвердіть його.",
						"This code is too simple.\nPlease use different digits.",
						"Вітаємо! Початкове налаштування завершене. Змінити конфігурацію можна в головному меню та відповідних підменю.",
						"Виберіть режим захисту:",
						"Виберіть режим підключення безпровідної мережі:",
						"Мережа"];
var initNetCabAndDonRe = ["Мережний кабель не підключено. Підключіть мережний кабель!","Відсутній вбудований безпровідний адаптер або безпровідний адаптер USB."];
var initChPrompt = ["Налаштування телевізійних каналів","Виберіть тип сканування антени.","Виконується автоналаштування...","Знайдені наступні канали антени:","Виберіть тип кабельного сканування.","Виберіть оператора з наступного списку.","Налаштуйте інформацію щодо сканування","Знайдено наступні кабельні канали:","Виберіть одного оператора із наступного списку","Виберіть супутники для сканування або редагуйте вибраний супутник","Встановіть параметри супутника","Знайдені наступні канали; повторно відсканувати канали можна в меню Channel > Channel Scan (Канал > Сканування каналів)"];
var initClockPrompt = ["Синхронізуйте час через мережу!",
						"Встановіть дату та час:"];
var initialOptions	= ["Умови","Налаштування мережі","Онов-ня пр. забез-ня","Встановлення каналів","Годинник"];
var initialHotkeys	= ["Назад","Вибрати","Далі"];
var initLocations	= ["Дім","Крамниця","Крамниця в режимі демонстрації"];
var initNets		= ["Проводова","Бездротовий","У мене немає мережного з'єднання"];
var initWireManuals	= ["ІР-адреса","Маска підмережі","Шлюз за замовчуванням","Основний DNS","Допоміжний DNS"];
var initSoftUpdates = ["Оновити зараз","Оновити пізніше"];
var initChannelIns	= ["Продовжити","Я не хочу налаштовувати канали"];
var initChScanTypes	= ["Цифровий & Аналоговий","Цифровий","Аналоговий","Я не хочу сканувати"];
var initChDvbts		= ["Канали антени ATV:","Канали антени DTV:"];
var initChDvbcs		= ["Кабельні ATV-канали:","Кабельні DTV-канали:"];
var initChDvbss		= ["Супутникові канали:"];
var initChDvbSOther	= ["Я не хочу сканувати супутникові канали"];
var initEndConnectedStatus= ["Відключено","Мережа Wi-Fi підключена","Провідна мережа підключена"];
var initEndInstallations= "Канали ХХХХ налаштовані";
var initEndUpdate	= ["Оновлено"];

var audioScenes 	= ["Встановлення на столі","Монтаж на стіні"];			
var screenSavers	= ["Відсутня інформація про програму. Спочатку знайдіть канали!",
						"Немає сигналу!",
						"Зашифровано",
						"Тільки дані",
						"Аудіо програма",
						"Немає звуку та зображення",
						"Недоступно",
						"Без телетексту",
						"Дані про передачі відсутні.",
						"Програму заблоковано!",
						"Програму заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Докладна інформація про передачі відсутня.",
						"Ця програма не рекомендується для неповнолітніх.\nНатисніть OK і введіть код.",
						"Канал заблоковано!",
						"Канал заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Ввід заблоковано!\nНатисніть ОК та введіть ваш код.",
						"Не підтримується!",
						"Цей сервіс зараз недоступний",
						"Введ. заблок.!",
						"Назви передач відсутні.",
						"Не працює"
						];
var chBookingPromt	= ["Запрограмований запис поточного каналу. Телевізор почне запис каналу.",
						"Знайдено запис за розкладом.\n Переключіться на XXXX для виконання запису",
						"Для поточного каналу встановлено нагадування.",
						"Знайдено заплановане нагадування.\n Переключіться на XXXX"];
var timeUnit		= ["сек.","мін"];
var ciPromt			= ["Дані мережі змінені. Для оновлення виконайте сканування наявності оновлень. ",];
var othersPromt		= ["Будь ласка, зачекайте…",];
var menuOptions		= ["Зображення","Звук","Kанал","Мережа","Система"];
var optionOptions	= ["Визначені налаштування з..","Попередня настройка звуку","Закріпити","T-Link","\"\"\"зсув у часі\"\"\"","PVR","Запис за графіком","Установки"];
var optionTLinkPromt= [["Автоматичне увімкнення включено","Автом. очікування","Меню посібника"],
						["Увімкнути","Режим очікув.","Гучність підсилювача"]];
var powerPromt		= ["Телевізор зараз вимкнеться! Натисніть будь-яку клавішу, щоб скасувати."];
var ttxLanguage		= ["Західна Європа","Східна Європа","Російська","Арабська/Іврит","Перська ","Арабська","Білоруська","Грецька","Турецька"];
var ttxOptions		= ["Виявити ","Підсторінки циклу","Мова","Сторінка аварійного сигналу","Екстрене повідомлення"];
var weekday         = ["неділя","Понеділок","вівторок","Cереда","четвер","п'ятниця","Субота"];
var lcnConfflict	= "Під час роботи цієї програми виникли проблеми з прийомом сигналу. Інша версія доступна на каналі %d.";
var inShopMode		= "Телевізор працює в режимі «Магазин». Для переключення в режим «Дім» виберіть System (Система) і змініть в меню параметр Location (Розташування).";
var nitRefresh		= "Дані мережі змінено  Ви хочете виконати пошук оновлень? ";
var picHDMIMode     = ["Авто","Графіка","Відео"];

var glassRemind    	= ["Підключіть 3D-окуляри до телевізора\n(Утримуйте клавішу POWER [ЖИВЛЕННЯ] на 3D-окулярах).","Тепер 3D-окуляри підключені до телевізора ",""];
var pvrRemind 		= ["Не від’єднуйте USB-пристрій і не вимикайте живлення"];
var pvrConName   	= ["PVR","Інформація про програму:",["Note: If you record the HD channel, please to select  the  disk(of speed >5.0MB/sec), and to select the disk (of speed >3.0MB/sec) when you want to record the SD channel.","Записане відео збережено у папці \"pvr\"."],"СТОП","Запис","година","Хвилина","Тривалість","Поради","Встановіть тривалість запису за допомогою клавіш зі стрілками."];
var pvrDisRemind 	= "Вставте USB-накопичувач для запису.";
var pvrRemindWords  = ["Вийти?",
							"Припинити запис і переглянути записані файли?",
							"Диск вийнято.",
							"Недостатньо вільного місця.",
							"Записані файлі відсутні. Натисніть Start (Початок), щоб розпочати запис.",
							"PVR не працює на закодованому каналі.",
							"Функція недоступна",
							"Успішне збереження.",
							"Припинити запис та змінити джерело вхідного сигналу?",
							"Телевізор припинить поточний запис. Вийти?",
							"Для правильної роботи функції запису телепередач (PVR) перевірте телевізійний сигнал."];
var pvrChangeCh 	= ["Увімкнути канал?",
							"Припинити запис та змінити канал?"];
var pvrChangeToPIN8	= ["Змінити джерело сигналу на пристрій, підключений до входу SCART?",
				    		"Зупинити запис і змінити джерело сигналу на пристрій, підключений до входу SCART?"];
var pvrChangeToCEC  = ["Змінити джерело сигналу на пристрій, підключений до входу HDMI?",
				  			 "Зупинити запис і змінити джерело сигналу на пристрій, підключений до входу HDMI?"];
var pvrGuideJump    = ["Увійти до електронного довідника цифрових програм (EPG)?",
							"Припинити запис та перейти до EPG?"];
var pvrMediaJump    = ["Увійти до сховища Media (Медіа)?",
							"Припинити запис та перейти до Media?"];
var timeshiftExtra	= ["Бажаєте зупинити зсув у часі та змінити змінити канал?",
						"Зупинити функцію Timeshift і змінити джерело сигналу на пристрій, підключений до входу SCART?",
						"Зупинити функцію Timeshift і змінити джерело сигналу на пристрій, підключений до входу HDMI?",
						"Зміщення часу не працює на закодованому каналі.",
						"Зупинити функцію Timeshift і увійти до EPG?",
						"Бажаєте зупинити зсув у часі та змінити TV на режим USB?",
						"Бажаєте зупинити зсув у часі та змінити змінити вхідне джерело?",
						"Вставте USB-накопичувач для запису.",
						"Недостатній розмір диска.",
						"Телевізор зупинить функцію Timeshift. Вийти?"];
var timeshiftStatus	= ["Перемотати назад","СТОП","Відтворення","Пауза","Перемотати вперед"];
var pvrPowerOffRemind= ["Режим очікування запису","Режим очікув.","Зараз телевізор працює в режимі запису. Продовжити запис, коли телевізор буде переключений в режим очікування?"];
var timeshiftInitTitle= "Настройка диска";
var timeshiftInitReminds= ["Цей майстер служить для настройки USB-диска на зсув у часі. Виберіть режим настройки.",
						 "Для покращення роботи, рекомендуємо форматувати USB-диск. Це призведе до стирання усіх даних.",
						 "Виберіть розмір файла для зсуву у часі.",
						 "Форматування",
						 "Недостатньо вільного місця.",
						 "Створення файла зсуву у часі",
						 "Тест швидкості",
						 "Недостатня швидкість (< %f МБ) для увімкнення функції зсуву у часі!",
						 "Диск готовий для функції зсуву у часі. Але рекомендуємо змінити диск (швидкістю > %f MБ/с) для кращої продуктивності.",
						 "Диск готовий для функції зсуву у часі. "];
var timeshiftInitButtons= ["Форматувати","Пропустити","Скасувати","ОК","Завершити","Вихід"];
var timeshiftInitOther=["Швидк. диска:","МБ/сек"];

var selectChoice	= "Ви впевнені?";
var chAtvStore		= "Зберегти як ХХХХ";
var chEpgFirstGenreUK= ["Кіно","Новини та докум-ні","РОЗВАЖАЛЬНІ ПРОГРАМИ","Спорт","Дитячі","Освіта","Стиль життя","Драма"];
var homePageTitleList = ["ДОДАТКИ","TV","ВІДЕОЗАПИСИ","Головна сторінка"];
var homePageFavAndAllName  = ["Уподобані додатки","Усі додатки"];
var homePageBackUp = ["Електронний посібник","Функція GuideOn"];
var homePageRemind   = ["Повний набір функцій доступний тільки після підключення до мережі.","Пошук каналів на цьому телевізорі ще не був виконаний. Програми з’являться після сканування каналів.","немає програми","Виконати пошук каналів зараз?"];
var homePageHistory = ["Історія"];
var miracastTitle = ["Телевізійний зв’язок Wi-Fi","Пристрій TCL"];
var miracastRemind=["Телевізійний зв’язок Wi-Fi дозволяє відображати екран та відтворювати звук із вашого мобільного пристрою, наприклад, смартфона або планшета, у безпровідний спосіб (без кабелів) на вашому телевізорі. Отже ви зможете переглядати на вашому телевізорі те, що відтворюється на вашому смартфоні або планшеті. Наприклад, ви можете запустити відео на вашому смартфоні і одночасно відтворювати його на телевізорі або використовувати ваш планшет як пульт керування грою, що відображається на великому екрані вашого телевізора.","WiFi TV link на телевізорі готовий. Тепер розпочніть відображення екрана вашого пристрою на екрані телевізора.","Підключення. Зачекайте!","Підключення не виконано!","Не вдалося підключитися. Перевірте підключення!"];
var homePageLittleWin = ["Установки","Медіа","Уподобані канали","Розумне TV","EPG"];

var hbbtvStopRemind  = ["Зупинити відтворення?"];
var colorSystem = ["Авто","PAL","SECAM","NTSC"];
var deviceTitleTipsText = "Для отримання додаткової інформації натисніть OPTION (ФУНКЦІЯ)";
var emptyListInfo = "До телевізору не підключено жодного пристрою!";
var optionVideoListArray_1 = ["Визначені налаштування з..", "Попередня настройка звуку", "Режим відтворення", "Режим екрану", "Режим 3D", 
							  "Перемикач L-R", "Глибина різкості", "Субтитри", "Звукова доріжка", "Назва", "Заголовок", "Інформація"];
var optionVideoListArray_2 = ["Визначені налаштування з..", "Попередня настройка звуку", "Режим відтворення", "Режим екрану", 
							  "Субтитри", "Звукова доріжка", "Назва", "Заголовок", "Інформація"];
var bottomTipsText = ["Відтвор./Пауза", "Перемотати назад", "Перемотати вперед", "Список відтворення", "Установки"];
var picturePresetArray = ["Стандарт", "динамічна", "Природний", "Кіно", "Особистий"];
var videoPlayModeArray = ["Повторити все", "Повторити", "Нормальний"];
var screenModeHDArray = ["16:9", "4:3", "Синерама ", "Широкий зум", "Зміна масштабу 2", "Широкий зум 2", "Розтягнення зображення ", "Автоматично"];
var screenModeSDArray = ["16:9", "4:3", "Синерама ", "Зміна масштабу 14:9", "Зміна масштабу 16:9", "Збільшення масштабу 16:9", "Автоматично"];
var Mode3DArray = ["Вимкнути", "2D-у-3D", "Пліч-о-пліч", "Верх і низ", "Чергування стрічок"];
var videoOptionListArray = ["Вимкнути", "Трек", "Субтитри", "Назва", "Заголовок"];
var subMenuTitleText = "Субтитри";
var langMenuTitleText = "Мова аудіо";
var titleMenuTitleText = "Назва";
var mode3DMenuTitleText = "Режим 3D";
var langInfoText = "Трек";
var STOP_RESUME_INFO = "Зупин.-Віднов.";
var playListName = "Ім'я";
var eb_tips = "Поради";
var ok_button = "ОК";
var eb_info = ["Помилка декодування звукозапису.", "Помилка декодування відеозапису.", "Формат аудіозапису не підтримується.", 
			   "Формат відео не підтримується.", "Не вдалося відкрити цей файл.", "Помилка відтворення. Повторіть спробу пізніше.",
			   "Формат файлу не підтримується.", "Помилка! Робота програвача зупинена.",
			   "Шлях до файлу не існує чи є неприпустимим.\nПовторно вставте пристрій збереження даних і повторіть спробу.",
			   "Продовжити відтворення з попередньої\n позиції?"];
var frameTitleText = "Новий пристрій";
var eb_quit_info = "Бажаєте вийти?";
var eb_yes = "ТАК";
var eb_no = "НІ";
var offinfo = "Вимкнути";
var naInfo = "Нуль";
var consoleInfoArray = ["Перемотати назад", "Перемотати вперед", "Відтвор./Пауза", "Список відтворення"];
var cantOperateText = ["Функція не підтримується."];
var chapterChangeInfo = "Доступні тільки розділи 1–XXXX.";
var metaDataArray = ["Метадані назви/видання: ", "Метадані розділу: ", "Метадані аудіозапису: ", "Метадані субтитрів: "];
var metaTitleInfo = "Назва";
var metaChapterInfo = "Заголовок";
var videoLoadingInfo = "Аналіз...";
var listLoadingInfo = "Завантаження...";
var pgInfo = "Правова категорія: ";
var fileNameText = "Ім'я";
var fileDateText = "Дата";
var fileSizeText = "Розмір";
var fileDurationText = "Тривалість";
var fileDirectorText = "Режисер";
var fileCopyrightText = "Авторські права";
var fileArtistText = "Виконавець";
var fileAlbumText = "Альбом";
var fileGenreText = "Жанр";
var fileYearText = "Рік";
var fileGenreText = "Жанр";
var mainListArray = ["Всі", "Зображення", "Відео", "Музика"];
var sortArray = ["Ім'я", "Дата"];
var parserArray = ["Нормальний", "Рекурсивний  "];
var emptyTipsInfo = "Помилка! Не знайдено підтримуваних форматів файлів.";
var emptyFolderInfo = "Помилка! Не знайдено підтримуваних форматів файлів.";
var sortName = "Сортувати за";
var parserName = "Аналізатор";
var divx_str1 = "Реєстрація DivX®";
var divx_str2 = "Скасування реєстрації DivX(R)";
var infor_str = "Інформація";
var quickMenuEmptyText = "Функції відсутні.";

var musicSoundPresetArray = ["Стандарт", "Кіно", "Музика", "Функція Clear Voice", "Особистий"];
var musicInformationArray = ["Ім'я", "Виконавець", "Альбом", "Жанр: ", "Рік:", "Тривалість:"];
var playListName = "Ім'я";
var playTipsInfo = ["Відтворюється перший файл.", "Відтворюється останній файл."]
var musicNameInfo = "Name";
var musicArtistInfo = "Виконавець";
var musicAlbumInfo = "Інформація";
var optionSoundPresetInfo = "Попередня настройка звуку";
var optionBGMInfo = "Відтворювати у фоновому режимі";
var optionAudioOnlyInfo = "Тільки звук";
var optionInfoText = "Інформація";

var remotePhoneConnecte = "Встановлено підключення ХХХХ до телевізора!";
var tvRemoteTitle		= "Пульт ДК";
var tvRemoteDeveloper	= "Дана програма розроблена компанією TCL";
var tvRemoteDeviceTitle	= "Ім'я пристрою:";
var remoteOption		= ["Спільне використання медіавмісту","Пульт дистанційного керування","Довідка","Про","Smart Connect"];
var remotebottom		= " Завантажте додаток TCL nScreen на свій смартфон ";
var remoteStage			= ["Android","IOS"];
var sharingReminds		= ["Спільний доступ до фотографій, відеозаписів та музики з телефону на телевізорі.",
							"Кроки: \n   1. Натисніть значок додатка TCL nScreen на екрані телефону. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi;\n   2. Натисніть Media Sharing (Спільний доступ до медіафайлів), щоб переглянути медіафайли;\n   3. Відправка медіафайлів на телевізор для відтворення (з одним з наступних варіантів)",
							"      a) Перетягніть папку/файл на значок телевізора вверху екрана;\n      b) Поверніть телефон до телевізора, щоб запустити перший файл;\n      c) Розпочніть відтворення файла на телефоні, а тоді клацніть значок передачі на телевізор;",
							"   4. Під час відтворення на телевізорі коливайте телефоном для відтворення попереднього або наступного файла."];
var controlReminds		= ["Використовуйте телефон для дистанційного керування телевізором.",
							" ",
							"Кроки: \n   1. Натисніть значок додатка TCL nScreen на екрані телефону. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi;\n   2. Натисніть Remote Control (Пульт дистанційного керування) для управління телевізором."];
var helpDeviceWords		= "Взаємодія декількох екранів";
var helpBottom			= "У час хмаркових технологій такі розумні пристрої, як телефон та телевізор можуть взаємодіяти між собою. Діліться медіафайлами зі своєю родиною та керуйте телевізором із телефону. ";
var helpReminds			= ["Підготування\n   1. Завантажте й встановіть додаток TCL nScreen з магазину додатків Google Play чи Apple Store.\n   2. Підключіть телефон до телевізора через ту ж саму мережу Wi-Fi.",
							" ",
							"Рекомендований телефон\n   1. ЦП: не менше 800МГц\n   2. Носій: не менше 80МБ вільного місця",
							" ",
							"Відмова від відповідальності\n   Якщо додаток TCL nScreen не встановлений на вашому телефоні, зверніться до виробника телефону. "];
var helpButtons			= ["Назад","Далі"];
var aboutReminds		= ["Пульт ДК","Дана програма розроблена компанією TCL"];
var aboutExit			= "Вихід";
var smartReminds		= ["Швидке й інтелектуальне з’єднання між телевізором та телефоном.",
							" ",
							"Кроки \n   1. Підключіть телевізор до смартфону через ту ж саму локальну мережу. Натисніть значок додатка TCL nScreen на екрані смартфону.\n   2. Натисніть кнопку Smart Connect (Інтелектуальне з’єднання), щоб відсканувати QR-код.\n   3. Під час роботи телевізора в режимі перегляду телепередач натисніть і утримуйте в додатку TCL nScreen клавішу INFO (ІНФОРМАЦІЯ) протягом 4 секунд. На екрані з’явиться повноекранний QR-код.",];
var smartQRReminds		= ["Натисніть в додатку TCL nScreen на екрані телефону кнопку Smart Connect (Інтелектуальне з’єднання) і відскануйте QR-код для швидкого з’єднання телевізора та телефону.",
							"QR-код містить інформацію про обліковий запис локальної мережі. Зберігайте цю інформацію."];
							

var consoleTipArray = ["Назад","Далі","Консоль","Список відтворення"];							
var optionInfoArray = ["Визначені налаштування з..","Режим відтворення","Тривалість","Ефект ","Інформація"];

var playModeArray = ["Нормальний","Випадк. порядок","Повторити"];
var durationArray = ["Короткий (5 с)", "Середній (10 с)", "Довгий (15 с)"];
var effectArray = ["Жодний", "Розчинення", "Поява зліва", "Поява справа ", "Поява знизу", "Поява зверху", "Всеред. рамки", "Прямокутник назовні", "Випадково"];
var infoArray = ["Назва:","Розмір: ","Дата: ","Розташування"];

var picturePresetBarTitleInfo = "Визначені налаштування з..";
var picturePresetBarArray = ["Стандарт","динамічна","Кінотеатр","Кіно","Особистий"];
var upTipsInfo = "Перемістити зображення"; //add yums 2014-10-10
var consoleTipsArray = ["Консоль","Назад","Далі","Список відтворення","Установки"];  //add yums 2014-10-10
var pictureMoveTipsArray = ["Натисніть кнопку RIGHT (ВПРАВО) ще раз для перегляду наступного зображення","Натисніть кнопку LEFT (ВЛІВО) ще раз для перегляду попереднього зображення","Натисніть кнопку DOWN (ВНИЗ) ще раз для відображення списку відтворення"]; //add yums 2014-10-10

var optionPvrListArray = ["Визначені налаштування з..","Попередня настройка звуку", "Режим екрану", "Режим 3D", "Субтитри", "Звукова доріжка", "Інформація"];							
	
var titleSpanFirstArray = ["Управління і підключення","Основні операції","ДОДАТКИ","TV","Установки","Запитання й відповіді"];
var titleSpanSecondArray = [["Пульт дистанційного керування","Клавіші панелі","Зручна навігація","Підключення телевізора","Підключення телевізора","Підключення телевізора","Бездротовий"],["Запускач","Рядок стану","Джерело"],["Додатки для відтворення","Медіа","Пульт ДК"],["Налаштувати канал і гучність","Список каналів","EPG","Встановлення каналу","Уподобані канали"],["Налаштування зображення","Налаштування звуку","Налаштування каналу","Онов-ня пр. забез-ня","Мова","Батьківський захист"],["Часті запитання","Часті запитання","Усунення несправностей","Усунення несправностей","Умови та положення"]];
var contentSpan1_1Array = [["LIST (СПИСОК):","INFO (ІНФОРМАЦІЯ):","MENU (МЕНЮ):","POWER (ЖИВЛЕННЯ):","SOURCE (ДЖЕРЕЛО СИГНАЛУ):","GUIDE (ДОВІДНИК):","SMART TV:"],["Показує список каналів","Показує інформацію про програму","Перехід на головну сторінку","Вмикає живлення або переключає в режим очікування","Дозволяє вибрати джерело вхідного сигналу","Відображає інформацію програми передач (EPG)","Дозволяє перейти на сторінку Smart TV"]];
var contentSpan1_2Array = ["Попередній канал","Наступний канал","Збільшити гучність","Зменшити гучність","Перехід на головну сторінку","Підтвердити функцію","Режим очікування/увімкнути живлення"];
var contentSpan1_3Array = ["ОК/довідник","Канал вгору","Канал вниз","Зменшити гучність","Збільшити гучність","Присутні у деяких функціях у вигляді клавіш зі стрілками."];
var contentSpan1_4Array = ["ЛОКАЛЬНА МЕРЕЖА","HDMI (MHL)","HDMI","HDMI (ARC)","Адаптер AV OUT","ЛОКАЛЬНА МЕРЕЖА","Смартфон","ПК/зовнішній декодер/DVD","Звуковий підсилювач","Звуковий підсилювач/монітор","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_5Array = ["Порт USB 2.0","Порт USB 3.0","Навушник","Адаптер AV IN","SPDIF","Адаптер CMP AUDIO IN","Адаптер CMP IN (YPbPr)","USB-пристрої","USB-пристрої","Навушник","DVC/ігрова приставка/ зовнішній декодер/DVD","Звуковий підсилювач","DVC/ігрова приставка/ зовнішній декодер/DVD","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_6Array = ["Загальний інтерфейс ","SD","VGA","SCART","Mini SCART","АНТЕННИЙ ВХІД","Карта PCMCIA","SD-карта","ПК","Зовнішній декодер/DVD","Антена/кабель/супутник","Можливо, телевізор не оснащений усіма потрібними гніздами."];
var contentSpan1_7Array = ["Планшет","ПК","Маршрутизатортор","Телефон","TV"];

var contentSpan2Array = [["Для перегляду головної сторінки натискайте клавіші зі стрілками.","Потім натисніть ОК, щоб переглянути популярні програми чи відкрити додаток."],["Відображає дату, мережу, пристрої та ін. у правому верхньому куті екрану."],["Виберіть джерело вхідного сигналу від пристроїв, підключених до телевізора, через різні порти, наприклад TV, AV, HDMI та ін."]];

var contentSpan3Array = ["Насолоджуйтеся та розважайтеся з уподобаними додатками на сторінці Smart TV","Дивіться фотографії, відеозаписи та слухайте музику з USB-пристрою.","Підключіть телевізор і смартфон або планшет до тієї ж самої локальної мережі","Натисніть на екрані смартфону чи планшета значок TCL nScreen або TCL nScreen","Обмінюйтеся зі своєю сім’єю фотографіями, відеозаписами та музикою на декількох екранах і керуйте телевізором за допомогою смартфону"];

var contentSpan4Array = [["Натисніть кнопку UP/DOWN (ВГОРУ/ВНИЗ), щоб переключити канали","Натисніть кнопку LEFT/RIGHT (ВЛІВО/ВПРАВО), щоб налаштувати гучність"],["Для перегляду списку каналів натисніть на пульті дистанційного керування кнопку LIST","Натисніть кнопку UP/DOWN (ВГОРУ/ВНИЗ), щоб вибрати канал"],["Електронний довідник цифрових програм (EPG) — це екранний довідник, що відображає список запланованих телепрограм. Користувач може переміщуватися, вибирати, переглядати та записувати телепрограми."],["Пошук і налаштування каналів"],["Додавайте чи редагуйте уподобані канали в Channel List (Список каналів)"]];

var contentSpan5Array = ["Переглядайте уподобані програми у відеододатках"];

var contentSpan6Array = [["Натисніть кнопку MENU (МЕНЮ), щоб відобразити параметри налаштування системи","Відкрийте налаштування Picture (Зображення), щоб настроїти значення"],["Натисніть кнопку MENU (МЕНЮ), щоб відобразити параметри налаштування системи","Відкрийте налаштування Sound (Звук), щоб настроїти параметри"],["Натисніть кнопку MENU (МЕНЮ), щоб відобразити параметри налаштування системи","Відкрийте налаштування Channel (Канал), щоб настроїти параметри"],["Оновіть телевізор за наявності нового програмного забезпечення"],["Користувач може вибрати мову меню"],["Дозволяє батькам встановити пароль на перегляд каналів або програм, що не призначені для дітей"]];

var contentSpan7_1Array = [["Відсутні зображення та звук","Перевірте плавкий запобіжник чи переривач.","Підключіть інший електричний прилад до розетки, щоб впевнитися, що розетка працює належним чином.","Поганий контакт роз’єму з гніздом живлення","Перевірте джерело сигналу."],["Нормальне зображення, відсутній звук","Натисніть кнопку UP (ВГОРУ), щоб збільшити гучність.","Звук налаштований неправильним чином.","Помилка сигналу телепередачі."],["Нормальний звук, відсутнє зображення","Налаштуйте яскравість і контрастність","Помилка сигналу телепередачі.","Перевірте, чи працює телевізор тільки в режимі відтворення звуку."]];
var contentSpan7_2Array = [["Радіочастотні перешкоди","Цей тип перешкод призводить до утворення на екрані телевізора рухомих пульсацій чи діагональних смуг, і в деяких випадках — втрати контрастності зображення. Знайдіть і виключіть вплив джерела радіочастотних перешкод на телевізор."],["Відсутній колір","Налаштуйте параметри кольору.","Виберіть інший канал. Телевізор може приймати телепередачі в чорно-білому форматі."],["Не працює пульт дистанційного керування","Замініть батарейки.","Неправильно встановлені батарейки. Не підключено живлення до телевізора."]];
var contentSpan7_3Array = [["Не відображується вміст з USB-пристрою","Перевірте, щоб USB-пристрій був сумісним з телевізором.","Перевірте, чи підтримує телевізор формати звуку та файлів зображень."],["При відтворенні відсутній звук","Формат звуку відеозапису не підтримується телевізором."],["Файли відтворюються ривками","Швидкість роботи USB-пристрою може обмежувати швидкість передавання даних на телевізор."]];
var contentSpan7_4Array = [["На що треба звернути увагу при оновленні програмного забезпечення","Не вимикайте живлення під час оновлення програмного забезпечення.","Не натискайте будь-які кнопки на пульті дистанційного керування під час оновлення програмного забезпечення.","Зачекайте, оскільки оновлення програмного забезпечення може зайняти трохи більше часу."],["Після оновлення програмного забезпечення зміни інтерфейсу телевізора не будуть помітні.","У деяких випадках оновлення ПЗ може не тільки оновити чи додати нові функції, але й покращити роботу телевізора без видимих змін у його інтерфейсі. Інколи інтерфейс телевізора може не змінюватися взагалі."]];
var termsTitle = "Умови та положення";
var termsConditions = ["Правова заява компанії TCL — виробника цього телевізора. ","У зв'язку з різними характеристикам виробів, що включають послуги SmartTV, а також у зв'язку обмеженнями, наявними в доступному наповненні (контенті), деякі функції, програми та послуги можуть бути недоступними на деяких пристроях або на деяких територіях. Для використання деяких функцій на SmartTV можуть бути потрібні додаткові периферійні пристрої або можуть зніматись членські внески. Відвідайте нашу веб-сторінку для отримання детальнішої інформації щодо певного пристрою та доступності наповнення. Перелік послуг та доступність наповнення через SmartTV можуть змінюватись час від часу без попередження. \n   Все наповнення та послуги, доступні через даний пристрій, належать третій стороні та захищені авторським правом, патентами, торговими марками та/або іншими законами щодо захисту інтелектуальної власності. Таке наповнення та послуги забезпечуються виключно для персонального некомерційного використання. Забороняється використовувати будь-яке наповнення або послуги у спосіб, не схвалений власником наповнення або постачальником послуг. Без обмеження вищезгаданого, окрім випадків чіткого схвалення власника даного наповнення, забороняється змінювати, копіювати, перевидавати, завантажувати, публікувати, передавати, перекладати, продавати, створювати збірні роботи, використовувати або розповсюджувати у будь-який спосіб або на будь-якому носії будь-яке наповнення або послуги, що відображаються на даному пристрої. \n   ВИ ЧІТКО УСВІДОМИЛИ ТА ПОГОДЖУЄТЕСЬ, ЩО ВИ БЕРЕТЕ НА СЕБЕ ПОВНУ ВІДПОВІДАЛЬНІСТЬ ЗА ВИКОРИСТАННЯ ЦЬОГО ПРИСТРОЮ, А ТАКОЖ ЗА ЙОГО НАЛЕЖНУ ЯКІСТЬ, РОБОТУ ТА ТОЧНІСТЬ РОБОТИ. ДАНИЙ ПРИСТРІЙ ТА ВСЕ НАПОВНЕННЯ І ПОСЛУГИ ВІД ТРЕТЬОЇ СТОРОНИ НАДАЮТЬСЯ У СПОСІБ « ЯК Є » БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ ЯВНО АБО НЕЯВНО. TCL ЧІТКО ВІДМОВЛЯЄТЬСЯ ВІД УСІХ ГАРАНТІЙ ТА УМОВ, ЩО СТОСУЮТЬСЯ ДАНОГО ПРИСТРОЮ ТА БУДЬ-ЯКОГО ВМІСТУ І ПОСЛУГ, ЯВНО ТА НЕЯВНО, ВКЛЮЧАЮЧИ ТА НЕ ОБМЕЖУЮЧИСЬ ГАРАНТІЯМИ ТОВАРНОГО СТАНУ, НАЛЕЖНОЇ ЯКОСТІ, ПРИДАТНОСТІ ДЛЯ ПЕВНИХ ЦІЛЕЙ, ТОЧНОСТІ, СПОКІЙНОГО ВИКОРИСТАННЯ ТА НЕПОРУШЕННЯ ПРАВ ТРЕТЬОЇ СТОРОНИ. TCL НЕ ГАРАТУЄ ТОЧНОСТІ, ДІЙСНОСТІ, СВОЄЧАСНОСТІ, ЗАКОННОСТІ АБО ПОВНОТИ БУДЬ-ЯКОГО НАПОВНЕННЯ АБО ПОСЛУГИ, ЩО ВИКОРИСТОВУЮТЬСЯ ЧЕРЕЗ ДАНИЙ ПРИСТРІЙ І НЕ ГАРАНТУЄ, ЩО ДАНИЙ ПРИСТРІЙ, НАПОВНЕННЯ АБО ПОСЛУГИ ВІДПОВІДАТИМУТЬ ВАШИМ ВИМОГАМ, А ТАКОЖ, ЩО ВАШ ПРИСТРІЙ АБО ПОСЛУГИ БУДУТЬ ПРАЦЮВАТИ БЕЗ ПРЕШКОД ТА ПОМИЛОК. ЗА ЖОДНИХ ОБСТАВИН, ВКЛЮЧАЮЧИ НЕДБАЛІСТЬ, КОМПАНІЯ TCL НЕ НЕСЕ ВІДПОВІДАЛЬНОСТІ, НІ У ВИГЛЯДІ КОНТРАКТУ, НІ У ВИГЛЯДІ ДЕЛІКТУ, ЗА БУДЬ-ЯКІ ПРЯМІ, НЕПРЯМІ, НАВМИСНІ АБО НЕНАВМИСНІ ПОШКОДЖЕННЯ, ЮРИДИЧНІ СПЛАТИ, ГРОШОВІ ВИТРАТИ АБО БУДЬ-ЯКІ ІНШІ ЗБИТКИ, ЩО ВИПЛИВАЮТЬ З ЦЬОГО АБО ВНАСЛІДОК ЦЬОГО, ЗА БУДЬ-ЯКУ ІНФОРМАЦІЮ, ЩО МІСТИТЬСЯ АБО ЗА ВИКОРИСТАННЯ ДАНОГО ПРИСТРОЮ, А ТАКОЖ ЗА БУДЬ-ЯКЕ НАПОВНЕННЯ АБО ПОСЛУГИ, ДО ЯКИХ ОТРИМУЄТЕ ДОСТУП ВИ АБО БУДЬ-ЯКА ТРЕТЯ СТОРОНА, НАВІТЬ ПРИ НАЯВНОСТІ ПОПЕРЕДЖЕННЯ ПРО МОЖЛИВІСТЬ ПОДІБНИХ ЗБИТКІВ. \n   Послуги третьої сторони можуть бути змінені, зупинені, усунені або перервані та доступ до них може бути відключений у будь-який час без попередження, і компанія TCL (виробник телевізорів марки Thomson) не дає пояснень та гарантій, що будь-яке наповнення або послуги будуть залишатись доступними упродовж будь-якого періоду часу. Наповнення та послуги надаються третіми сторонами - мережею та засобами зв'язку, на які компанія TCL не має жодного впливу. Не обмежуючи загальне застосування даної відмови, TCL чітко відмовляється від будь-якої відповідальності за будь-які зміни, переривання, вимкнення, усунення або призупинення надання будь-якого наповнення або послуг, які використовуються на даному пристрої. Компанія TCL може накласти обмеження на використання або доступ до певних послуг або наповнення у будь-якому випадку, без попередження та без відповідальності за це. Компанія TCL не несе відповідальність за технічну підтримку користувачів стосовно наповнення та послуг. Будь-які запитання або запити щодо надання наповнення або послуг слід направляти безпосередньо відповідним постачальникам наповнення та послуг."];

var noChannelListRemind        = ["Не знайдено жодного каналу. Список каналів з’явиться після сканування каналів.","Пошук каналів"];
var closeSubtitleRemind   = "Функція з’явиться при відключенні субтитрів. Налаштувати зараз?";

var estickerTitles = ["Високореалістичні зображення","Відтінки кольору, що виглядають живими","Чудові природні рухи","Якість динамічного зображення","Укрупнення SR UHD","Відчуйте тривимірний світ!","Збільшена продуктивність","Підтримка майбутнього вмісту з роздільною здатністю 4К","Розважайтеся в Інтернеті","Отримайте доступ до додаткового вмісту","Інтегровані цифрові тюнери","Можливість підключення усіх пристроїв","Підтримка різних джерел з роздільною здатністю 4К","Відтворення вмісту з USB-пристрою","Надшвидкісний Wi-Fi","Мобільний вміст на телевізорі","Вміст на мобільних пристроях","Локальний вміст","Схвалено DivX","Плавне зображення","Модуль Canal Ready","Додаток TDT Premium"];
var estickerDescriptions = ["Чудова якість телевізійних програм і відеозаписів завдяки роздільній здатності, що в чотири рази перевищує роздільну здатність Full HD на екрані UHD","Широкий діапазон кольорів гарантує насолоду при перегляді кожного сюжету, насиченого червоними та смарагдовими відтінками","Кадрова інтерполяція 4К і драйвери заднього підсвічування допомагають боротися з розмиттям","Насиченість оригінального зображення покращується, щоб створити справжній динамічний вираз із чудовою контрастністю","Насолоджуйтеся більш чіткім зображенням телевізійних передач і відеозаписів Blu-Ray завдяки технології Super Resolution","Пізнайте технологію 3D TV Ready і дивіться різноманітний вміст із тривимірними зображеннями","Найкращий розважальний досвід завдяки процесору Quad Core, що забезпечує ідеальну взаємодію та покращену продуктивність","Підтримка відеокодека HEVC (H.265) для наступного стандарту відеозаписів із роздільною здатністю 4К","Різноманіття додатків у мережі Інтернет, сервіси «відео на замовлення» (VOD) і «услід за ефіром», перегляд веб-сторінок","Ви маєте можливість побачити більше завдяки додатковим сервісам і вмісту, що пропонуються вашими уподобаними телевізійними каналами","Отримайте доступ до телевізійних каналів високої роздільної здатності без додаткового зовнішнього декодера","Числені цифрові джерела, що легко підключити, — тепер у вашій домівці!","Цей телевізор готовий для відтворення майбутніх трансляцій та відеозаписів із роздільною здатністю 4К з частотою 50–60 Гц через порт HDMI 2.0 завдяки технології захисту медіаконтенту HDCP 2.2","Відтворення відеозаписів і перегляд фотографій безпосередньо з USB-накопичувача, жорсткого диска чи камери на великому екрані з роздільною здатністю 4К","Останнє покоління систем зв’язку 2x2 MIMO та стандарт АС забезпечують неперевершену швидкість доступу до мережі Інтернет","Насолоджуйтеся переглядом фотографій, відеозаписів, розважайтеся і працюйте з додатками з мобільних пристроїв на великому екрані завдяки технології дзеркального відображення екрана Screen Mirroring","На великому екрані відображуються фотографії, відеозаписи, додатки зі смартфону чи планшета ","Переглядайте на великому екрані локальний вміст, наприклад фотографії та відеозаписи з пристроїв, підключених до локальної мережі","Відтворюйте власні чи узяті напрокат фільми, захищені технологією DivX","Ультратонка рамка та надзвичайно витончений дизайн","Перевірено та схвалено телевізійним каналом Canal+","Перевірено та схвалено компанією TDT Premium"];							

var eManualTextArray = ["Електронний посібник","Усі графічні зображення усередині призначені тільки для візуального представлення."];
var frontPanelRemind = "Перед. панель заблок.";
var eRPRemind		 = "Режим продажу може не відповідати вимогам ERP. Ви впевнені?";	
var noRelatedChannel = "Відповідні канали відсутні";
var option0624Name          = ["BOP","BFS","Подія за подією","Отримати ID користувача","BGM","Reset all","Відновити попередні налаштування","NRM","Вибір стандарту DVB-T2 та країни","Режим HbbTV"];
var DVBT2AndChoice = ["Увімкнути","За країною","Вимкнути"];
var hbbtvServiceRemind = "Скоро буде доступною служба HbbTV.";
var insertWord = "Вставити";		
var viewDetail = "Перегляд докладних відомостей";							

var remindOAD  = "Оновлення програми. Рекомендоване оновлення програми може бути доступним на іншому каналі. Якщо погодитесь на його завантаження, перехід на канал може відбутись автоматично. Бажаєте зробити це зараз?";

var LEDStatus = ["Блимає", "Нормальний"];
var netFlixRemind = "Ця функція перерве доступ до сервісів Netflix доти, доки ви не увійдете знову.";
var ESNExplanation = "Електронний серійний номер";
var resetShopRemind = "Система перезавантажується, будь ласка, не вимикайте телевізор";
var initialSelectOption = "Виберіть одну з опцій:";
var databaseRemind   = "Система виявила, що база даних пошкоджена з невідомих причин, і автоматично перебудує її; натисніть ОK, щоб продовжити";
var Deactivation = "Вихід";
var oadFutureRemind = "Оновлення програмного забезпечення. Нова версія рекомендованого програмного забезпечення буде доступна за %s. Процес оновлення займе деякий час, при цьому екран може згаснути. Не вимикайте приймач протягом оновлення. Якщо ви бажаєте виконати оновлення, залиште приймач увімкненим або в режимі очікування в заданий час. Бажаєте виконати оновлення?";														
							
var bt_title = "Bluetooth";
var bt_soundOutPutName = "Вихід звуку";
var bt_soundOutPutTV = "Динаміки ТВ";
var bt_soundOutPutBT = "Пристрій Bluetooth";
var bt_soundOutPutBT_TV = "Bluetooth і ТВ";
var bt_refreshBarName = "Пристрої";
var bt_settingTips_On = "Увімкніть Bluetooth і проскануйте пристрої";
var bt_settingTips_Finding = "Пошук доступних пристроїв";
var bt_settingTips_NoDevice = "Пристрої недоступні";
var bt_deviceList_State_NoConnect = "Не підключено";
var bt_deviceList_State_Connecting = "Підключення";
var bt_deviceList_State_Connected = "Підключено";
var bt_deviceList_State_Paired = "З′єднано";
var bt_deviceList_Conncect_Failed_Tips1 = "Помилка підключення";
var bt_deviceList_Conncect_Failed_Tips2 = "Підтвердіть, що увімкнена ф-ція Bluetooth ХХХ";
var bt_deviceList_Conncect_Success = "Підключено до пристрою Bluetooth";
var bt_deviceList_Disconncect_Success = "Відключено від пристрою Bluetooth";
var bt_deviceList_Disconnect = "Відключитися від ХХХ?";
var bt_tipsTitle = "Порада";
var bt_bluetooth_Pairing_Title = "Bluetooth спаровування";
var bt_bluetooth_Input_Pin = "Введіть PIN-код:";
var bt_bluetooth_Output_Pin_Tip = "Ввести PIN-код XXXX з клавіатури";
var bt_bluetooth_Pin_Wrong_Tip = "Невірний PIN-код";
var bt_bluetooth_Remove_Pair_Title = "Запит";
var bt_bluetooth_Remove_Pair_Ask = "Забути цей пристрій?";
var bt_bluetooth_module_error = "Bluetooth помилка модуля!";

var netflixDialogOptions = ["OK","Потім","Не показувати це знову"];
var netflixDialogContent = "У Netflix є тисячі фільмів для перегляду, перейти зараз? ";
var netflixRemoteDialogContent = "Зараз у продажу є пульт дистанційного керування з кнопкою Netflix. Відвідайте наступний веб-сайт, щоб дізнатись більше.\nhttps://store.tcleu.com";
							
var applyPictureModeSwitchValue	 = ["Поточне джерело","Усі джерела"];
var audioDescriptionName = ["Опис аудіо","Колонка","Гучність колонки","Навушники","Гучність навушників","Гучність AD","BT-пристрій","Гучність BT-пристрою"];
var audioDescriptionOptions = ["Вимкнути","Нормальний","Опис аудіо"];							
var volumeOffRemind = 'Встановіть XXX на «Вкл.» в меню Налаштування.';
var switchSourceRemind   = " вставлено. Бажаєте увімкнути зараз?";								
							
var mEPSRemind		 = "Shop mode does not meet the MEPS requirements. Are you sure you want to select it?";		
var parentRatingAUOptions = ["No block", "Block G and above(optional)", "Block PG and above",
							 "Block M and above", "Block MA and above", "Block AV and above", 
							 "Block R and above", "Block all"];	
var mEPSTips		= ["The current picture mode does not meet the MEPS\nrequirements, standard mode is recommended.", 
					   "Your TV is in shop mode.\nFor home mode, please see Settings menu."];

var footballModeName = "Режим Спорт";
var resetStadium = "Стадіон";
var netflix = "NETFLIX";
var golive = "GOLIVE";								
							
							
//以下数组是虚拟遥控器的html中所有span的文字，要一一对应

var virtualRemoteValues	= ["1","2","3","4","5","6","7","8","9","Вихід","0","Зміна масштабу+",
                       	   "Вихід",
                       	   "Список","0","Текст","Посібник","Ввід","Вихід","Меню","Субтитри","Вікно відомостей",
                       	   "Зупинити",
                       	   "Вікно відомостей","Меню","Вихід"
                       	   ];
var nscreenTips = "GuideOn забезпечує користувачам зручну навігацію даними.";
var nscreenContent = 'Кроки: Клацніть на “TCL nScreen” на телефоні.  Підключіть телефон до телевізора через одну локальну мережу; 2.Клацніть "GuideOn", щоб відкрити GuideOn; 3.GuideOn забезпечує функціональність, подібну до друкованої програми передач, інформуючи користувачів щодо того, які телевізійні передачі доступні.';
var singalBrokenoffTips = "Сигнал перервано. Системі не вдається завершити завантаження.";
var contentSpan1_1Array_AU =  [["POWER (ЖИВЛЕННЯ):","SOURCE (ДЖЕРЕЛО СИГНАЛУ):","MENU (МЕНЮ):","BACK:","INFO (ІНФОРМАЦІЯ):","HOME:","EXIT:","LIST (СПИСОК):"],
                             ["Turns power on or standby mode","Select the input source",
                                 "Show TV settings menu","Go back to the Previous menu or exit a running APP","Показує інформацію про програму",
                             "Перехід на головну сторінку", "Go back to the Previous menu or exit a running APP","Показує список каналів"]];
var guideDescriptionWords ="Скануйте QR-код, щоб завантажити застосунок GuideOn на ваш телефон.";			     
var settingNoticeSourceName ="Автоджерело";